#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsModal

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsModal.ActivityDetailsModal_C
// 0x0058 (0x04D0 - 0x0478)
class UActivityDetailsModal_C final : public UFortActivityDetailsModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowKeyArtDelayed;                                 // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideSpinner;                                       // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowKeyArt;                                        // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOpen;                                            // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_KeyArt_768x768;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingSpinner;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   KeyArtParameter;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               DefaultImage;                                      // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoadingParameter;                                  // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoading;                                        // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ActivityDetailsModal(int32 EntryPoint);
	void Construct();
	void OnPreviewImageChanged(const bool bIsLoading_0, const class UTexture* Texture);
	void OnInitialized();
	void UpdateImage(bool bInIsLoading, const class UTexture* InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsModal_C">();
	}
	static class UActivityDetailsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsModal_C>();
	}
};
static_assert(alignof(UActivityDetailsModal_C) == 0x000008, "Wrong alignment on UActivityDetailsModal_C");
static_assert(sizeof(UActivityDetailsModal_C) == 0x0004D0, "Wrong size on UActivityDetailsModal_C");
static_assert(offsetof(UActivityDetailsModal_C, UberGraphFrame) == 0x000478, "Member 'UActivityDetailsModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, ShowKeyArtDelayed) == 0x000480, "Member 'UActivityDetailsModal_C::ShowKeyArtDelayed' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, HideSpinner) == 0x000488, "Member 'UActivityDetailsModal_C::HideSpinner' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, ShowKeyArt) == 0x000490, "Member 'UActivityDetailsModal_C::ShowKeyArt' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, OnOpen) == 0x000498, "Member 'UActivityDetailsModal_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, Image_KeyArt_768x768) == 0x0004A0, "Member 'UActivityDetailsModal_C::Image_KeyArt_768x768' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, LoadingSpinner) == 0x0004A8, "Member 'UActivityDetailsModal_C::LoadingSpinner' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, KeyArtParameter) == 0x0004B0, "Member 'UActivityDetailsModal_C::KeyArtParameter' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, DefaultImage) == 0x0004B8, "Member 'UActivityDetailsModal_C::DefaultImage' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, LoadingParameter) == 0x0004C0, "Member 'UActivityDetailsModal_C::LoadingParameter' has a wrong offset!");
static_assert(offsetof(UActivityDetailsModal_C, bIsLoading) == 0x0004C8, "Member 'UActivityDetailsModal_C::bIsLoading' has a wrong offset!");

}

