#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserStatusWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserStatusWarning.ActivityBrowserStatusWarning_C
// 0x0018 (0x0278 - 0x0260)
class UActivityBrowserStatusWarning_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnStarted;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_WarningTagName;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserStatusWarning(int32 EntryPoint);
	void Play_Start_Animation(const class FText& In_Warning_Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserStatusWarning_C">();
	}
	static class UActivityBrowserStatusWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserStatusWarning_C>();
	}
};
static_assert(alignof(UActivityBrowserStatusWarning_C) == 0x000008, "Wrong alignment on UActivityBrowserStatusWarning_C");
static_assert(sizeof(UActivityBrowserStatusWarning_C) == 0x000278, "Wrong size on UActivityBrowserStatusWarning_C");
static_assert(offsetof(UActivityBrowserStatusWarning_C, UberGraphFrame) == 0x000260, "Member 'UActivityBrowserStatusWarning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusWarning_C, OnStarted) == 0x000268, "Member 'UActivityBrowserStatusWarning_C::OnStarted' has a wrong offset!");
static_assert(offsetof(UActivityBrowserStatusWarning_C, Text_WarningTagName) == 0x000270, "Member 'UActivityBrowserStatusWarning_C::Text_WarningTagName' has a wrong offset!");

}

