#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.ExecuteUbergraph_ActivityBrowserArrowButton
// 0x00A8 (0x00A8 - 0x0000)
struct ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_1;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetActiveAnimation_ActiveAnimation_2;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton) == 0x000008, "Wrong alignment on ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton");
static_assert(sizeof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton) == 0x0000A8, "Wrong size on ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation) == 0x000008, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable) == 0x000010, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable) == 0x000014, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_1) == 0x00001C, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetVisibility_ReturnValue) == 0x000024, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_2) == 0x000028, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetEndTime_ReturnValue) == 0x000034, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default) == 0x000040, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_struct_Variable_3) == 0x000048, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_CustomEvent_IsActive_1) == 0x000058, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_CustomEvent_IsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Event_IsDesignTime) == 0x000070, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_CustomEvent_IsActive) == 0x000071, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000078, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, Temp_bool_Variable_1) == 0x000080, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_1) == 0x000088, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000090, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, K2Node_Select_Default_1) == 0x000098, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton, CallFunc_GetActiveAnimation_ActiveAnimation_2) == 0x0000A0, "Member 'ActivityBrowserArrowButton_C_ExecuteUbergraph_ActivityBrowserArrowButton::CallFunc_GetActiveAnimation_ActiveAnimation_2' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.OnRowReset
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_OnRowReset final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserArrowButton_C_OnRowReset) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_OnRowReset");
static_assert(sizeof(ActivityBrowserArrowButton_C_OnRowReset) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_OnRowReset");
static_assert(offsetof(ActivityBrowserArrowButton_C_OnRowReset, IsActive) == 0x000000, "Member 'ActivityBrowserArrowButton_C_OnRowReset::IsActive' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_PreConstruct");
static_assert(sizeof(ActivityBrowserArrowButton_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_PreConstruct");
static_assert(offsetof(ActivityBrowserArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.OnRowActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserArrowButton_C_OnRowActiveChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserArrowButton_C_OnRowActiveChanged");
static_assert(sizeof(ActivityBrowserArrowButton_C_OnRowActiveChanged) == 0x000001, "Wrong size on ActivityBrowserArrowButton_C_OnRowActiveChanged");
static_assert(offsetof(ActivityBrowserArrowButton_C_OnRowActiveChanged, IsActive) == 0x000000, "Member 'ActivityBrowserArrowButton_C_OnRowActiveChanged::IsActive' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.UpdateArrowColor
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_UpdateArrowColor) == 0x000004, "Wrong alignment on ActivityBrowserArrowButton_C_UpdateArrowColor");
static_assert(sizeof(ActivityBrowserArrowButton_C_UpdateArrowColor) == 0x000020, "Wrong size on ActivityBrowserArrowButton_C_UpdateArrowColor");
static_assert(offsetof(ActivityBrowserArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'ActivityBrowserArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_UpdateArrowColor, HoverColor) == 0x000010, "Member 'ActivityBrowserArrowButton_C_UpdateArrowColor::HoverColor' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.SnapAnimationToEnd
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserArrowButton_C_SnapAnimationToEnd final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_SnapAnimationToEnd) == 0x000008, "Wrong alignment on ActivityBrowserArrowButton_C_SnapAnimationToEnd");
static_assert(sizeof(ActivityBrowserArrowButton_C_SnapAnimationToEnd) == 0x000018, "Wrong size on ActivityBrowserArrowButton_C_SnapAnimationToEnd");
static_assert(offsetof(ActivityBrowserArrowButton_C_SnapAnimationToEnd, InAnimation) == 0x000000, "Member 'ActivityBrowserArrowButton_C_SnapAnimationToEnd::InAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_SnapAnimationToEnd, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'ActivityBrowserArrowButton_C_SnapAnimationToEnd::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_SnapAnimationToEnd, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ActivityBrowserArrowButton_C_SnapAnimationToEnd::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserArrowButton.ActivityBrowserArrowButton_C.GetActiveAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserArrowButton_C_GetActiveAnimation final
{
public:
	class UWidgetAnimation*                       ActiveAnimation;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserArrowButton_C_GetActiveAnimation) == 0x000008, "Wrong alignment on ActivityBrowserArrowButton_C_GetActiveAnimation");
static_assert(sizeof(ActivityBrowserArrowButton_C_GetActiveAnimation) == 0x000018, "Wrong size on ActivityBrowserArrowButton_C_GetActiveAnimation");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, ActiveAnimation) == 0x000000, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::ActiveAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, Temp_bool_Variable) == 0x000008, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserArrowButton_C_GetActiveAnimation, K2Node_Select_Default) == 0x000010, "Member 'ActivityBrowserArrowButton_C_GetActiveAnimation::K2Node_Select_Default' has a wrong offset!");

}

