#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRow

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserRow.ActivityBrowserRow_C
// 0x0070 (0x0380 - 0x0310)
class UActivityBrowserRow_C final : public UFortActivityBrowserRowList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnLoadingMore;                                     // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPeek;                                            // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveDownIntoView;                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowMoveUpOutOfViewAnim;                          // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         LoadingMoreTilesHB;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UActivityBrowserArrowButton_C*>  ArrowButtons;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   FontPressedAnimateParam;                           // 0x0360(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoadingMoreDisplayDelay;                           // 0x036C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadingMoreVisible;                              // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLoadingMoreQueryActive;                          // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LoadingMoreDelayTimer;                             // 0x0378(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserRow(int32 EntryPoint);
	void FinishedLoadingMoreDelay();
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnQueryStatusChanged(bool bIsActive);
	void OnRowMoveDown();
	void Destruct();
	void Construct();
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void OnCategoryItemChanged(const bool bIsActive, const bool bPlayAnimation);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowMoveUp();
	void Finished_1026ADFB4D09BA1BBFE112927E529688();
	void Finished_E8947A1748F689711DC56388DB21BBA2();
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserRow_C">();
	}
	static class UActivityBrowserRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserRow_C>();
	}
};
static_assert(alignof(UActivityBrowserRow_C) == 0x000008, "Wrong alignment on UActivityBrowserRow_C");
static_assert(sizeof(UActivityBrowserRow_C) == 0x000380, "Wrong size on UActivityBrowserRow_C");
static_assert(offsetof(UActivityBrowserRow_C, UberGraphFrame) == 0x000310, "Member 'UActivityBrowserRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, OnLoadingMore) == 0x000318, "Member 'UActivityBrowserRow_C::OnLoadingMore' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, OnPeek) == 0x000320, "Member 'UActivityBrowserRow_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, OnRowMoveDownIntoView) == 0x000328, "Member 'UActivityBrowserRow_C::OnRowMoveDownIntoView' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, OnRowMoveUpOutOfViewAnim) == 0x000330, "Member 'UActivityBrowserRow_C::OnRowMoveUpOutOfViewAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, OnRowActiveInactiveAnim) == 0x000338, "Member 'UActivityBrowserRow_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, LoadingMoreTilesHB) == 0x000340, "Member 'UActivityBrowserRow_C::LoadingMoreTilesHB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, VBContent) == 0x000348, "Member 'UActivityBrowserRow_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, ArrowButtons) == 0x000350, "Member 'UActivityBrowserRow_C::ArrowButtons' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, FontPressedAnimateParam) == 0x000360, "Member 'UActivityBrowserRow_C::FontPressedAnimateParam' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, IsWaitingForInactiveAnim) == 0x000368, "Member 'UActivityBrowserRow_C::IsWaitingForInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, LoadingMoreDisplayDelay) == 0x00036C, "Member 'UActivityBrowserRow_C::LoadingMoreDisplayDelay' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, IsLoadingMoreVisible) == 0x000370, "Member 'UActivityBrowserRow_C::IsLoadingMoreVisible' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, IsLoadingMoreQueryActive) == 0x000371, "Member 'UActivityBrowserRow_C::IsLoadingMoreQueryActive' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRow_C, LoadingMoreDelayTimer) == 0x000378, "Member 'UActivityBrowserRow_C::LoadingMoreDelayTimer' has a wrong offset!");

}

