#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRowPromoted

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.ExecuteUbergraph_ActivityBrowserRowPromoted
// 0x0088 (0x0088 - 0x0000)
struct ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsActive_1;                          // 0x0014(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x0039(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActive;                            // 0x0062(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayAnimation;                       // 0x0063(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted) == 0x000008, "Wrong alignment on ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted");
static_assert(sizeof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted) == 0x000088, "Wrong size on ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, EntryPoint) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetCurrentInputType_ReturnValue) == 0x000011, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetIsActive_ReturnValue) == 0x000013, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_Event_bIsActive_1) == 0x000014, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_Event_bIsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_Not_PreBool_ReturnValue_1) == 0x000015, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetIsInPeekState_ReturnValue) == 0x000028, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetIsInPeekState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_BooleanAND_ReturnValue_1) == 0x000038, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_Event_bIsInPeekState) == 0x000039, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00003C, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetIsActive_ReturnValue_1) == 0x000048, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetIsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x00004C, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000050, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000058, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_CustomEvent_NewInputType) == 0x000061, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_Event_bIsActive) == 0x000062, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_Event_bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_Event_bPlayAnimation) == 0x000063, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_Event_bPlayAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'ActivityBrowserRowPromoted_C_ExecuteUbergraph_ActivityBrowserRowPromoted::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.OnCategoryItemChanged
// 0x0002 (0x0002 - 0x0000)
struct ActivityBrowserRowPromoted_C_OnCategoryItemChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_OnCategoryItemChanged) == 0x000001, "Wrong alignment on ActivityBrowserRowPromoted_C_OnCategoryItemChanged");
static_assert(sizeof(ActivityBrowserRowPromoted_C_OnCategoryItemChanged) == 0x000002, "Wrong size on ActivityBrowserRowPromoted_C_OnCategoryItemChanged");
static_assert(offsetof(ActivityBrowserRowPromoted_C_OnCategoryItemChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_OnCategoryItemChanged::bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_OnCategoryItemChanged, bPlayAnimation) == 0x000001, "Member 'ActivityBrowserRowPromoted_C_OnCategoryItemChanged::bPlayAnimation' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRowPromoted_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserRowPromoted_C_HandleInputMethodChanged");
static_assert(sizeof(ActivityBrowserRowPromoted_C_HandleInputMethodChanged) == 0x000001, "Wrong size on ActivityBrowserRowPromoted_C_HandleInputMethodChanged");
static_assert(offsetof(ActivityBrowserRowPromoted_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRowPromoted_C_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_OnRowPeekStateChanged) == 0x000001, "Wrong alignment on ActivityBrowserRowPromoted_C_OnRowPeekStateChanged");
static_assert(sizeof(ActivityBrowserRowPromoted_C_OnRowPeekStateChanged) == 0x000001, "Wrong size on ActivityBrowserRowPromoted_C_OnRowPeekStateChanged");
static_assert(offsetof(ActivityBrowserRowPromoted_C_OnRowPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_OnRowPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRowPromoted_C_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_OnRowIsActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserRowPromoted_C_OnRowIsActiveChanged");
static_assert(sizeof(ActivityBrowserRowPromoted_C_OnRowIsActiveChanged) == 0x000001, "Wrong size on ActivityBrowserRowPromoted_C_OnRowIsActiveChanged");
static_assert(offsetof(ActivityBrowserRowPromoted_C_OnRowIsActiveChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_OnRowIsActiveChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.UpdateNewRow
// 0x0003 (0x0003 - 0x0000)
struct ActivityBrowserRowPromoted_C_UpdateNewRow final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayAnimation_0;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_UpdateNewRow) == 0x000001, "Wrong alignment on ActivityBrowserRowPromoted_C_UpdateNewRow");
static_assert(sizeof(ActivityBrowserRowPromoted_C_UpdateNewRow) == 0x000003, "Wrong size on ActivityBrowserRowPromoted_C_UpdateNewRow");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateNewRow, IsActive) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_UpdateNewRow::IsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateNewRow, PlayAnimation_0) == 0x000001, "Member 'ActivityBrowserRowPromoted_C_UpdateNewRow::PlayAnimation_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateNewRow, CallFunc_GetIsInPeekState_ReturnValue) == 0x000002, "Member 'ActivityBrowserRowPromoted_C_UpdateNewRow::CallFunc_GetIsInPeekState_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.SnapToEndOfAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserRowPromoted_C_SnapToEndOfAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation) == 0x000008, "Wrong alignment on ActivityBrowserRowPromoted_C_SnapToEndOfAnimation");
static_assert(sizeof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation) == 0x000018, "Wrong size on ActivityBrowserRowPromoted_C_SnapToEndOfAnimation");
static_assert(offsetof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation, InAnimation) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_SnapToEndOfAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation, PlayMode) == 0x000008, "Member 'ActivityBrowserRowPromoted_C_SnapToEndOfAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'ActivityBrowserRowPromoted_C_SnapToEndOfAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_SnapToEndOfAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ActivityBrowserRowPromoted_C_SnapToEndOfAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C.UpdateWidgetVisibility
// 0x0020 (0x0020 - 0x0000)
struct ActivityBrowserRowPromoted_C_UpdateWidgetVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility) == 0x000008, "Wrong alignment on ActivityBrowserRowPromoted_C_UpdateWidgetVisibility");
static_assert(sizeof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility) == 0x000020, "Wrong size on ActivityBrowserRowPromoted_C_UpdateWidgetVisibility");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, Temp_byte_Variable) == 0x000000, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, Temp_byte_Variable_1) == 0x000001, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, Temp_bool_Variable) == 0x000010, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_GetCurrentInputType_ReturnValue) == 0x000011, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_GetIsActive_ReturnValue) == 0x000012, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000015, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRowPromoted_C_UpdateWidgetVisibility, K2Node_Select_Default) == 0x000018, "Member 'ActivityBrowserRowPromoted_C_UpdateWidgetVisibility::K2Node_Select_Default' has a wrong offset!");

}

