#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRowPromoted

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C
// 0x0030 (0x0328 - 0x02F8)
class UActivityBrowserRowPromoted_C final : public UFortActivityBrowserRowPromoted
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPeek;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TakeoverTile;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ActivityBrowserRowPromoted(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnCategoryItemChanged(const bool bIsActive, const bool bPlayAnimation);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnRowMoveDown();
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void OnRowIsActiveChanged(const bool bIsActive);
	void Finished_B26293ED40CE705EEB4611B38FB15D81();
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void UpdateWidgetVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserRowPromoted_C">();
	}
	static class UActivityBrowserRowPromoted_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserRowPromoted_C>();
	}
};
static_assert(alignof(UActivityBrowserRowPromoted_C) == 0x000008, "Wrong alignment on UActivityBrowserRowPromoted_C");
static_assert(sizeof(UActivityBrowserRowPromoted_C) == 0x000328, "Wrong size on UActivityBrowserRowPromoted_C");
static_assert(offsetof(UActivityBrowserRowPromoted_C, UberGraphFrame) == 0x0002F8, "Member 'UActivityBrowserRowPromoted_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRowPromoted_C, OnPeek) == 0x000300, "Member 'UActivityBrowserRowPromoted_C::OnPeek' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRowPromoted_C, OnRowActiveInactiveAnim) == 0x000308, "Member 'UActivityBrowserRowPromoted_C::OnRowActiveInactiveAnim' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRowPromoted_C, TakeoverTile) == 0x000310, "Member 'UActivityBrowserRowPromoted_C::TakeoverTile' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRowPromoted_C, VBContent) == 0x000318, "Member 'UActivityBrowserRowPromoted_C::VBContent' has a wrong offset!");
static_assert(offsetof(UActivityBrowserRowPromoted_C, IsWaitingForInactiveAnim) == 0x000320, "Member 'UActivityBrowserRowPromoted_C::IsWaitingForInactiveAnim' has a wrong offset!");

}

