#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserWidget.ActivityBrowserWidget_C.ExecuteUbergraph_ActivityBrowserWidget
// 0x00C0 (0x00C0 - 0x0000)
struct ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasIntroPlayed_IsFinishedLoading;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerQueueType                              K2Node_Event_PlayerQueueType;                      // 0x0049(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerQueueType                              Temp_byte_Variable_4;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0060(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingPromotedContent_ReturnValue;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserSoloButton_V2_C*        K2Node_DynamicCast_AsActivity_Browser_Solo_Button_V2; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_2;                           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsPromoted, bool IsFirstRow)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPromoted;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsFirstRow;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget) == 0x000008, "Wrong alignment on ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget");
static_assert(sizeof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget) == 0x0000C0, "Wrong size on ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, EntryPoint) == 0x000000, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_text_Variable) == 0x000008, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_text_Variable_1) == 0x000020, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_bool_Variable) == 0x000038, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_byte_Variable) == 0x000039, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_byte_Variable_1) == 0x00003A, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_bool_Variable_1) == 0x00003B, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_byte_Variable_2) == 0x00003C, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_byte_Variable_3) == 0x00003D, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_Select_Default) == 0x00003E, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_GetHasIntroPlayed_IsFinishedLoading) == 0x000048, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_GetHasIntroPlayed_IsFinishedLoading' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_Event_PlayerQueueType) == 0x000049, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_Event_PlayerQueueType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, Temp_byte_Variable_4) == 0x00004A, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_Select_Default_1) == 0x000060, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_IsShowingPromotedContent_ReturnValue) == 0x000088, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_IsShowingPromotedContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_GetEndTime_ReturnValue) == 0x00008C, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_DynamicCast_AsActivity_Browser_Solo_Button_V2) == 0x000090, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_DynamicCast_AsActivity_Browser_Solo_Button_V2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_Select_Default_2) == 0x000099, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A8, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_CustomEvent_IsPromoted) == 0x0000B8, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_CustomEvent_IsPromoted' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, K2Node_CustomEvent_IsFirstRow) == 0x0000B9, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::K2Node_CustomEvent_IsFirstRow' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000BA, "Member 'ActivityBrowserWidget_C_ExecuteUbergraph_ActivityBrowserWidget::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ActivityBrowserWidget.ActivityBrowserWidget_C.RowChanged
// 0x0002 (0x0002 - 0x0000)
struct ActivityBrowserWidget_C_RowChanged final
{
public:
	bool                                          IsPromoted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFirstRow;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserWidget_C_RowChanged) == 0x000001, "Wrong alignment on ActivityBrowserWidget_C_RowChanged");
static_assert(sizeof(ActivityBrowserWidget_C_RowChanged) == 0x000002, "Wrong size on ActivityBrowserWidget_C_RowChanged");
static_assert(offsetof(ActivityBrowserWidget_C_RowChanged, IsPromoted) == 0x000000, "Member 'ActivityBrowserWidget_C_RowChanged::IsPromoted' has a wrong offset!");
static_assert(offsetof(ActivityBrowserWidget_C_RowChanged, IsFirstRow) == 0x000001, "Member 'ActivityBrowserWidget_C_RowChanged::IsFirstRow' has a wrong offset!");

// Function ActivityBrowserWidget.ActivityBrowserWidget_C.OnPlayerQueueTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserWidget_C_OnPlayerQueueTypeChanged final
{
public:
	EPlayerQueueType                              PlayerQueueType;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserWidget_C_OnPlayerQueueTypeChanged) == 0x000001, "Wrong alignment on ActivityBrowserWidget_C_OnPlayerQueueTypeChanged");
static_assert(sizeof(ActivityBrowserWidget_C_OnPlayerQueueTypeChanged) == 0x000001, "Wrong size on ActivityBrowserWidget_C_OnPlayerQueueTypeChanged");
static_assert(offsetof(ActivityBrowserWidget_C_OnPlayerQueueTypeChanged, PlayerQueueType) == 0x000000, "Member 'ActivityBrowserWidget_C_OnPlayerQueueTypeChanged::PlayerQueueType' has a wrong offset!");

}

