#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTileExpandDetailsButton

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTileExpandDetailsButton.ActivityBrowserTileExpandDetailsButton_C
// 0x0040 (0x0C10 - 0x0BD0)
class UActivityBrowserTileExpandDetailsButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusFlash;                                        // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPCHoverUnHover;                                  // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFocus;                                           // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsIcon;                                 // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ScalingSB;                                         // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         KeybindShift_X;                                    // 0x0C00(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KeybindShift_Y;                                    // 0x0C04(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BrushPadding;                                      // 0x0C08(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserTileExpandDetailsButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnTileFocused();
	void OnTileReset();
	void OnTileLostFocus();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void SnapAnimationToEnd(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void ChangeKeybindLocation();
	void SetBrushPadding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTileExpandDetailsButton_C">();
	}
	static class UActivityBrowserTileExpandDetailsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTileExpandDetailsButton_C>();
	}
};
static_assert(alignof(UActivityBrowserTileExpandDetailsButton_C) == 0x000008, "Wrong alignment on UActivityBrowserTileExpandDetailsButton_C");
static_assert(sizeof(UActivityBrowserTileExpandDetailsButton_C) == 0x000C10, "Wrong size on UActivityBrowserTileExpandDetailsButton_C");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, UberGraphFrame) == 0x000BD0, "Member 'UActivityBrowserTileExpandDetailsButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, FocusFlash) == 0x000BD8, "Member 'UActivityBrowserTileExpandDetailsButton_C::FocusFlash' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, OnPCHoverUnHover) == 0x000BE0, "Member 'UActivityBrowserTileExpandDetailsButton_C::OnPCHoverUnHover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, OnFocus) == 0x000BE8, "Member 'UActivityBrowserTileExpandDetailsButton_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, Image_DetailsIcon) == 0x000BF0, "Member 'UActivityBrowserTileExpandDetailsButton_C::Image_DetailsIcon' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, ScalingSB) == 0x000BF8, "Member 'UActivityBrowserTileExpandDetailsButton_C::ScalingSB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, KeybindShift_X) == 0x000C00, "Member 'UActivityBrowserTileExpandDetailsButton_C::KeybindShift_X' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, KeybindShift_Y) == 0x000C04, "Member 'UActivityBrowserTileExpandDetailsButton_C::KeybindShift_Y' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTileExpandDetailsButton_C, BrushPadding) == 0x000C08, "Member 'UActivityBrowserTileExpandDetailsButton_C::BrushPadding' has a wrong offset!");

}

