#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPlayerBrowserFavoriteView

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityPlayerBrowserFavoriteView.ActivityPlayerBrowserFavoriteView_C.ExecuteUbergraph_ActivityPlayerBrowserFavoriteView
// 0x0018 (0x0018 - 0x0000)
struct ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView) == 0x000008, "Wrong alignment on ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView");
static_assert(sizeof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView) == 0x000018, "Wrong size on ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView");
static_assert(offsetof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView, EntryPoint) == 0x000000, "Member 'ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView, CallFunc_GetNumItems_ReturnValue) == 0x000004, "Member 'ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'ActivityPlayerBrowserFavoriteView_C_ExecuteUbergraph_ActivityPlayerBrowserFavoriteView::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

