#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCreateView

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityCreateView.ActivityCreateView_C
// 0x0028 (0x0510 - 0x04E8)
class UActivityCreateView_C final : public UFortActivityCreateView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisabledIconPulse;                                 // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         DisabledWarningHB;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DisabledWarningMessage;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityCreateView(int32 EntryPoint);
	void BP_OnPartySizeChanged(const int32 PartySize);
	void BP_OnLocalPlayerDemoted();
	void BP_OnLocalPlayerPromotedToLeader();
	void BP_OnActivated();
	void RefreshDisabledState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityCreateView_C">();
	}
	static class UActivityCreateView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCreateView_C>();
	}
};
static_assert(alignof(UActivityCreateView_C) == 0x000008, "Wrong alignment on UActivityCreateView_C");
static_assert(sizeof(UActivityCreateView_C) == 0x000510, "Wrong size on UActivityCreateView_C");
static_assert(offsetof(UActivityCreateView_C, UberGraphFrame) == 0x0004E8, "Member 'UActivityCreateView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityCreateView_C, DisabledIconPulse) == 0x0004F0, "Member 'UActivityCreateView_C::DisabledIconPulse' has a wrong offset!");
static_assert(offsetof(UActivityCreateView_C, Intro) == 0x0004F8, "Member 'UActivityCreateView_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityCreateView_C, DisabledWarningHB) == 0x000500, "Member 'UActivityCreateView_C::DisabledWarningHB' has a wrong offset!");
static_assert(offsetof(UActivityCreateView_C, DisabledWarningMessage) == 0x000508, "Member 'UActivityCreateView_C::DisabledWarningMessage' has a wrong offset!");

}

