#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPlayerView

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityPlayerView.ActivityPlayerView_C.ExecuteUbergraph_ActivityPlayerView
// 0x0028 (0x0028 - 0x0000)
struct ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActivityPlayerBrowserView*         K2Node_DynamicCast_AsFort_Activity_Player_Browser_View; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView) == 0x000008, "Wrong alignment on ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView");
static_assert(sizeof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView) == 0x000028, "Wrong size on ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView");
static_assert(offsetof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView, EntryPoint) == 0x000000, "Member 'ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView, K2Node_DynamicCast_AsFort_Activity_Player_Browser_View) == 0x000010, "Member 'ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView::K2Node_DynamicCast_AsFort_Activity_Player_Browser_View' has a wrong offset!");
static_assert(offsetof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'ActivityPlayerView_C_ExecuteUbergraph_ActivityPlayerView::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

