#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.ExecuteUbergraph_ActivityDetailsDisplay
// 0x0060 (0x0060 - 0x0000)
struct ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PartySize;                            // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFavorite;                          // 0x0014(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayAnimation;                       // 0x0015(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsDetailsValid;                      // 0x0016(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserTileFavoriteButton_C*   K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserTileFavoriteButton_C*   K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay");
static_assert(sizeof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay) == 0x000060, "Wrong size on ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, EntryPoint) == 0x000000, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_Event_PartySize) == 0x000010, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_Event_PartySize' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_Event_bIsFavorite) == 0x000014, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_Event_bIsFavorite' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_Event_bPlayAnimation) == 0x000015, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_Event_bPlayAnimation' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_Event_bIsDetailsValid) == 0x000016, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_Event_bIsDetailsValid' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_Event_IsDesignTime) == 0x000017, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_GetParent_ReturnValue) == 0x000018, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button) == 0x000028, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_IsMobileGame_ReturnValue) == 0x000040, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button_1) == 0x000048, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_DynamicCast_AsActivity_Browser_Tile_Favorite_Button_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay, CallFunc_Array_Add_ReturnValue_2) == 0x00005C, "Member 'ActivityDetailsDisplay_C_ExecuteUbergraph_ActivityDetailsDisplay::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityDetailsDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityDetailsDisplay_C_PreConstruct");
static_assert(sizeof(ActivityDetailsDisplay_C_PreConstruct) == 0x000001, "Wrong size on ActivityDetailsDisplay_C_PreConstruct");
static_assert(offsetof(ActivityDetailsDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityDetailsDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.OnDetailsUpdated
// 0x0001 (0x0001 - 0x0000)
struct ActivityDetailsDisplay_C_OnDetailsUpdated final
{
public:
	bool                                          bIsDetailsValid;                                   // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsDisplay_C_OnDetailsUpdated) == 0x000001, "Wrong alignment on ActivityDetailsDisplay_C_OnDetailsUpdated");
static_assert(sizeof(ActivityDetailsDisplay_C_OnDetailsUpdated) == 0x000001, "Wrong size on ActivityDetailsDisplay_C_OnDetailsUpdated");
static_assert(offsetof(ActivityDetailsDisplay_C_OnDetailsUpdated, bIsDetailsValid) == 0x000000, "Member 'ActivityDetailsDisplay_C_OnDetailsUpdated::bIsDetailsValid' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.OnIsFavoriteChanged
// 0x0002 (0x0002 - 0x0000)
struct ActivityDetailsDisplay_C_OnIsFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsDisplay_C_OnIsFavoriteChanged) == 0x000001, "Wrong alignment on ActivityDetailsDisplay_C_OnIsFavoriteChanged");
static_assert(sizeof(ActivityDetailsDisplay_C_OnIsFavoriteChanged) == 0x000002, "Wrong size on ActivityDetailsDisplay_C_OnIsFavoriteChanged");
static_assert(offsetof(ActivityDetailsDisplay_C_OnIsFavoriteChanged, bIsFavorite) == 0x000000, "Member 'ActivityDetailsDisplay_C_OnIsFavoriteChanged::bIsFavorite' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_OnIsFavoriteChanged, bPlayAnimation) == 0x000001, "Member 'ActivityDetailsDisplay_C_OnIsFavoriteChanged::bPlayAnimation' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.OnPartySizeChanged
// 0x0004 (0x0004 - 0x0000)
struct ActivityDetailsDisplay_C_OnPartySizeChanged final
{
public:
	int32                                         PartySize;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_OnPartySizeChanged) == 0x000004, "Wrong alignment on ActivityDetailsDisplay_C_OnPartySizeChanged");
static_assert(sizeof(ActivityDetailsDisplay_C_OnPartySizeChanged) == 0x000004, "Wrong size on ActivityDetailsDisplay_C_OnPartySizeChanged");
static_assert(offsetof(ActivityDetailsDisplay_C_OnPartySizeChanged, PartySize) == 0x000000, "Member 'ActivityDetailsDisplay_C_OnPartySizeChanged::PartySize' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.GetCreatorTextFormat
// 0x0098 (0x0098 - 0x0000)
struct ActivityDetailsDisplay_C_GetCreatorTextFormat final
{
public:
	class FText                                   CreatorName;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
static_assert(alignof(ActivityDetailsDisplay_C_GetCreatorTextFormat) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_GetCreatorTextFormat");
static_assert(sizeof(ActivityDetailsDisplay_C_GetCreatorTextFormat) == 0x000098, "Wrong size on ActivityDetailsDisplay_C_GetCreatorTextFormat");
static_assert(offsetof(ActivityDetailsDisplay_C_GetCreatorTextFormat, CreatorName) == 0x000000, "Member 'ActivityDetailsDisplay_C_GetCreatorTextFormat::CreatorName' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_GetCreatorTextFormat, ReturnValue) == 0x000018, "Member 'ActivityDetailsDisplay_C_GetCreatorTextFormat::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_GetCreatorTextFormat, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'ActivityDetailsDisplay_C_GetCreatorTextFormat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_GetCreatorTextFormat, K2Node_MakeArray_Array) == 0x000070, "Member 'ActivityDetailsDisplay_C_GetCreatorTextFormat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_GetCreatorTextFormat, CallFunc_Format_ReturnValue) == 0x000080, "Member 'ActivityDetailsDisplay_C_GetCreatorTextFormat::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.RefreshDisabledState
// 0x00C0 (0x00C0 - 0x0000)
struct ActivityDetailsDisplay_C_RefreshDisabledState final
{
public:
	EFortInvalidActivityReason                    Local_InvalidActivityReason;                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInvalidActivityReason                    Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInvalidActivityReason                    CallFunc_GetInvalidActivityReason_ReturnValue;     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_RefreshDisabledState) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_RefreshDisabledState");
static_assert(sizeof(ActivityDetailsDisplay_C_RefreshDisabledState) == 0x0000C0, "Wrong size on ActivityDetailsDisplay_C_RefreshDisabledState");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Local_InvalidActivityReason) == 0x000000, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Local_InvalidActivityReason' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_byte_Variable) == 0x000001, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable) == 0x000008, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable_1) == 0x000020, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable_2) == 0x000038, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable_3) == 0x000050, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable_4) == 0x000068, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, Temp_text_Variable_5) == 0x000080, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000098, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, CallFunc_GetInvalidActivityReason_ReturnValue) == 0x000099, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::CallFunc_GetInvalidActivityReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009B, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, K2Node_Select_Default) == 0x0000A0, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshDisabledState, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'ActivityDetailsDisplay_C_RefreshDisabledState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.UpdateVisibility
// 0x0010 (0x0010 - 0x0000)
struct ActivityDetailsDisplay_C_UpdateVisibility final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowWidget;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_UpdateVisibility) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_UpdateVisibility");
static_assert(sizeof(ActivityDetailsDisplay_C_UpdateVisibility) == 0x000010, "Wrong size on ActivityDetailsDisplay_C_UpdateVisibility");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, Target) == 0x000000, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::Target' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, ShowWidget) == 0x000008, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::ShowWidget' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, Temp_byte_Variable) == 0x000009, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, Temp_byte_Variable_1) == 0x00000B, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, Temp_bool_Variable) == 0x00000C, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateVisibility, K2Node_Select_Default) == 0x00000D, "Member 'ActivityDetailsDisplay_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.UpdateButtonVisibility
// 0x0010 (0x0010 - 0x0000)
struct ActivityDetailsDisplay_C_UpdateButtonVisibility final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowWidget;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_UpdateButtonVisibility) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_UpdateButtonVisibility");
static_assert(sizeof(ActivityDetailsDisplay_C_UpdateButtonVisibility) == 0x000010, "Wrong size on ActivityDetailsDisplay_C_UpdateButtonVisibility");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, Target) == 0x000000, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::Target' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, ShowWidget) == 0x000008, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::ShowWidget' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, Temp_byte_Variable) == 0x000009, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, Temp_byte_Variable_1) == 0x00000B, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, Temp_bool_Variable) == 0x00000C, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateButtonVisibility, K2Node_Select_Default) == 0x00000D, "Member 'ActivityDetailsDisplay_C_UpdateButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.UpdateFavoriteStatus
// 0x0010 (0x0010 - 0x0000)
struct ActivityDetailsDisplay_C_UpdateFavoriteStatus final
{
public:
	bool                                          IsFavorite;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayAnimation_0;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserStatusFavorite_C*       CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityDetailsDisplay_C_UpdateFavoriteStatus) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_UpdateFavoriteStatus");
static_assert(sizeof(ActivityDetailsDisplay_C_UpdateFavoriteStatus) == 0x000010, "Wrong size on ActivityDetailsDisplay_C_UpdateFavoriteStatus");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateFavoriteStatus, IsFavorite) == 0x000000, "Member 'ActivityDetailsDisplay_C_UpdateFavoriteStatus::IsFavorite' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateFavoriteStatus, PlayAnimation_0) == 0x000001, "Member 'ActivityDetailsDisplay_C_UpdateFavoriteStatus::PlayAnimation_0' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateFavoriteStatus, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'ActivityDetailsDisplay_C_UpdateFavoriteStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateFavoriteStatus, CallFunc_IsValid_ReturnValue_1) == 0x000003, "Member 'ActivityDetailsDisplay_C_UpdateFavoriteStatus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_UpdateFavoriteStatus, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000008, "Member 'ActivityDetailsDisplay_C_UpdateFavoriteStatus::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.SetButtonsInteractable
// 0x0028 (0x0028 - 0x0000)
struct ActivityDetailsDisplay_C_SetButtonsInteractable final
{
public:
	bool                                          IsInteractionEnabled;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsDisplay_C_SetButtonsInteractable) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_SetButtonsInteractable");
static_assert(sizeof(ActivityDetailsDisplay_C_SetButtonsInteractable) == 0x000028, "Wrong size on ActivityDetailsDisplay_C_SetButtonsInteractable");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, IsInteractionEnabled) == 0x000000, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::IsInteractionEnabled' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, CallFunc_Array_Get_Item) == 0x000018, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_SetButtonsInteractable, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'ActivityDetailsDisplay_C_SetButtonsInteractable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ActivityDetailsDisplay.ActivityDetailsDisplay_C.RefreshContentWarnings
// 0x0068 (0x0068 - 0x0000)
struct ActivityDetailsDisplay_C_RefreshContentWarnings final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserStatusWarning_C*        CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetContentWarningStrings_ReturnValue;     // 0x0018(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0040(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityDetailsDisplay_C_RefreshContentWarnings) == 0x000008, "Wrong alignment on ActivityDetailsDisplay_C_RefreshContentWarnings");
static_assert(sizeof(ActivityDetailsDisplay_C_RefreshContentWarnings) == 0x000068, "Wrong size on ActivityDetailsDisplay_C_RefreshContentWarnings");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshContentWarnings, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ActivityDetailsDisplay_C_RefreshContentWarnings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityDetailsDisplay_C_RefreshContentWarnings, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ActivityDetailsDisplay_C_RefreshContentWarnings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
