#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityDetailsDisplay

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityDetailsDisplay.ActivityDetailsDisplay_C
// 0x00B0 (0x0408 - 0x0358)
class UActivityDetailsDisplay_C final : public UFortActivityDetailsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisabledIconPulse;                                 // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DescriptionScrollRestarted;                        // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AcceptButtonOvr;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DisabledWarningHB;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DisabledWarningMessage;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       StatusEntryBox;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       WarningEntryBox;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActivityBrowserStatusFavorite_C*       FavoriteWidget;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAcceptButton;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowCreator;                                       // 0x03A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowTags;                                          // 0x03A2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowFavoriteButton;                                // 0x03A3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowFavoriteStatus;                                // 0x03A4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowContentWarning;                                // 0x03A5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowDetailsButton;                                 // 0x03A6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A7[0x1];                                      // 0x03A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonButtonBase*>              Buttons;                                           // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, class FText>              Content_Warning_Map;                               // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ActivityDetailsDisplay(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnDetailsUpdated(const bool bIsDetailsValid);
	void OnIsFavoriteChanged(const bool bIsFavorite, const bool bPlayAnimation);
	void OnParentActivated();
	void ResetWidgetState();
	void OnPartySizeChanged(const int32 PartySize);
	void OnLocalPlayerDemoted();
	void OnLocalPlayerPromotedToLeader();
	void OnDescriptionScrollRestarted();
	class FText GetCreatorTextFormat(const class FText& CreatorName);
	void RefreshDisabledState();
	void UpdateVisibility(class UWidget* Target, bool ShowWidget);
	void UpdateButtonVisibility(class UWidget* Target, bool ShowWidget);
	void UpdateFavoriteStatus(bool IsFavorite, bool PlayAnimation_0);
	void SetButtonsInteractable(bool IsInteractionEnabled);
	void RefreshContentWarnings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityDetailsDisplay_C">();
	}
	static class UActivityDetailsDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityDetailsDisplay_C>();
	}
};
static_assert(alignof(UActivityDetailsDisplay_C) == 0x000008, "Wrong alignment on UActivityDetailsDisplay_C");
static_assert(sizeof(UActivityDetailsDisplay_C) == 0x000408, "Wrong size on UActivityDetailsDisplay_C");
static_assert(offsetof(UActivityDetailsDisplay_C, UberGraphFrame) == 0x000358, "Member 'UActivityDetailsDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, DisabledIconPulse) == 0x000360, "Member 'UActivityDetailsDisplay_C::DisabledIconPulse' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, DescriptionScrollRestarted) == 0x000368, "Member 'UActivityDetailsDisplay_C::DescriptionScrollRestarted' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, AcceptButtonOvr) == 0x000370, "Member 'UActivityDetailsDisplay_C::AcceptButtonOvr' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, DisabledWarningHB) == 0x000378, "Member 'UActivityDetailsDisplay_C::DisabledWarningHB' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, DisabledWarningMessage) == 0x000380, "Member 'UActivityDetailsDisplay_C::DisabledWarningMessage' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, StatusEntryBox) == 0x000388, "Member 'UActivityDetailsDisplay_C::StatusEntryBox' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, WarningEntryBox) == 0x000390, "Member 'UActivityDetailsDisplay_C::WarningEntryBox' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, FavoriteWidget) == 0x000398, "Member 'UActivityDetailsDisplay_C::FavoriteWidget' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowAcceptButton) == 0x0003A0, "Member 'UActivityDetailsDisplay_C::ShowAcceptButton' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowCreator) == 0x0003A1, "Member 'UActivityDetailsDisplay_C::ShowCreator' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowTags) == 0x0003A2, "Member 'UActivityDetailsDisplay_C::ShowTags' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowFavoriteButton) == 0x0003A3, "Member 'UActivityDetailsDisplay_C::ShowFavoriteButton' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowFavoriteStatus) == 0x0003A4, "Member 'UActivityDetailsDisplay_C::ShowFavoriteStatus' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowContentWarning) == 0x0003A5, "Member 'UActivityDetailsDisplay_C::ShowContentWarning' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, ShowDetailsButton) == 0x0003A6, "Member 'UActivityDetailsDisplay_C::ShowDetailsButton' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, Buttons) == 0x0003A8, "Member 'UActivityDetailsDisplay_C::Buttons' has a wrong offset!");
static_assert(offsetof(UActivityDetailsDisplay_C, Content_Warning_Map) == 0x0003B8, "Member 'UActivityDetailsDisplay_C::Content_Warning_Map' has a wrong offset!");

}

