#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTabButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserTabButton.ActivityBrowserTabButton_C.ExecuteUbergraph_ActivityBrowserTabButton
// 0x0040 (0x0040 - 0x0000)
struct ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFavorite;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton) == 0x000008, "Wrong alignment on ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton");
static_assert(sizeof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton) == 0x000040, "Wrong size on ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, EntryPoint) == 0x000000, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_GetSelected_ReturnValue) == 0x000010, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000011, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000020, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000030, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton, K2Node_Event_bIsFavorite) == 0x000038, "Member 'ActivityBrowserTabButton_C_ExecuteUbergraph_ActivityBrowserTabButton::K2Node_Event_bIsFavorite' has a wrong offset!");

// Function ActivityBrowserTabButton.ActivityBrowserTabButton_C.OnFavoriteChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTabButton_C_OnFavoriteChanged final
{
public:
	bool                                          bIsFavorite;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserTabButton_C_OnFavoriteChanged) == 0x000001, "Wrong alignment on ActivityBrowserTabButton_C_OnFavoriteChanged");
static_assert(sizeof(ActivityBrowserTabButton_C_OnFavoriteChanged) == 0x000001, "Wrong size on ActivityBrowserTabButton_C_OnFavoriteChanged");
static_assert(offsetof(ActivityBrowserTabButton_C_OnFavoriteChanged, bIsFavorite) == 0x000000, "Member 'ActivityBrowserTabButton_C_OnFavoriteChanged::bIsFavorite' has a wrong offset!");

}

