#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPlayerBrowserHistoryView

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityPlayerBrowserHistoryView.ActivityPlayerBrowserHistoryView_C
// 0x0020 (0x0530 - 0x0510)
class UActivityPlayerBrowserHistoryView_C final : public UFortActivityPlayerBrowserView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_NoResults;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       WidgetSwitcher_Results;                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityPlayerBrowserHistoryView(int32 EntryPoint);
	void Construct();
	void BP_OnTileViewUpdated();
	void BP_OnActivated();
	void OnPlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityPlayerBrowserHistoryView_C">();
	}
	static class UActivityPlayerBrowserHistoryView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityPlayerBrowserHistoryView_C>();
	}
};
static_assert(alignof(UActivityPlayerBrowserHistoryView_C) == 0x000008, "Wrong alignment on UActivityPlayerBrowserHistoryView_C");
static_assert(sizeof(UActivityPlayerBrowserHistoryView_C) == 0x000530, "Wrong size on UActivityPlayerBrowserHistoryView_C");
static_assert(offsetof(UActivityPlayerBrowserHistoryView_C, UberGraphFrame) == 0x000510, "Member 'UActivityPlayerBrowserHistoryView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityPlayerBrowserHistoryView_C, Intro) == 0x000518, "Member 'UActivityPlayerBrowserHistoryView_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityPlayerBrowserHistoryView_C, Text_NoResults) == 0x000520, "Member 'UActivityPlayerBrowserHistoryView_C::Text_NoResults' has a wrong offset!");
static_assert(offsetof(UActivityPlayerBrowserHistoryView_C, WidgetSwitcher_Results) == 0x000528, "Member 'UActivityPlayerBrowserHistoryView_C::WidgetSwitcher_Results' has a wrong offset!");

}

