#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPlayerBrowerTabButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityPlayerBrowerTabButton.ActivityPlayerBrowerTabButton_C.ExecuteUbergraph_ActivityPlayerBrowerTabButton
// 0x0028 (0x0028 - 0x0000)
struct ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton) == 0x000008, "Wrong alignment on ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton");
static_assert(sizeof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton) == 0x000028, "Wrong size on ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, EntryPoint) == 0x000000, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_GetSelected_ReturnValue) == 0x000004, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000005, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000020, "Member 'ActivityPlayerBrowerTabButton_C_ExecuteUbergraph_ActivityPlayerBrowerTabButton::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");

}

