#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserRow.ActivityBrowserRow_C.ExecuteUbergraph_ActivityBrowserRow
// 0x0158 (0x0158 - 0x0000)
struct ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsActive_2;                          // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsActive_1;                          // 0x0039(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayAnimation;                       // 0x003A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x0050(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserArrowButton_C*          K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_4;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserArrowButton_C*          CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsActive;                            // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_2;    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow) == 0x000008, "Wrong alignment on ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow");
static_assert(sizeof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow) == 0x000158, "Wrong size on ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, EntryPoint) == 0x000000, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_byte_Variable) == 0x000004, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_byte_Variable_1) == 0x000005, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Event_bIsActive_2) == 0x000028, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Event_bIsActive_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetIsActive_ReturnValue) == 0x000038, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetIsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Event_bIsActive_1) == 0x000039, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Event_bIsActive_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Event_bPlayAnimation) == 0x00003A, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Event_bPlayAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00003C, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000040, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Event_bIsInPeekState) == 0x000050, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000058, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_byte_Variable_2) == 0x000068, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button) == 0x000070, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1) == 0x000080, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_DynamicCast_AsActivity_Browser_Arrow_Button_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Array_Add_ReturnValue_1) == 0x00008C, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_byte_Variable_3) == 0x0000A4, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_byte_Variable_4) == 0x0000B8, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetIsInPeekState_ReturnValue) == 0x0000BA, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetIsInPeekState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_int_Array_Index_Variable) == 0x0000BC, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000C0, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000D0, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000D8, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000D9, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_BooleanAND_ReturnValue) == 0x0000DA, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E0, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetRenderOpacity_ReturnValue) == 0x0000E8, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetIsActive_ReturnValue_1) == 0x0000EC, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetIsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000ED, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_BooleanOR_ReturnValue) == 0x0000EE, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Event_bIsActive) == 0x0000EF, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Event_bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_CustomEvent_NewInputType) == 0x000100, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, K2Node_Select_Default) == 0x000101, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000108, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000110, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetEndTime_ReturnValue) == 0x000114, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_GetAnimationCurrentTime_ReturnValue_2) == 0x000118, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_GetAnimationCurrentTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00011C, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_SelectFloat_ReturnValue) == 0x000120, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000128, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000130, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000140, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'ActivityBrowserRow_C_ExecuteUbergraph_ActivityBrowserRow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_C_HandleInputMethodChanged");
static_assert(sizeof(ActivityBrowserRow_C_HandleInputMethodChanged) == 0x000001, "Wrong size on ActivityBrowserRow_C_HandleInputMethodChanged");
static_assert(offsetof(ActivityBrowserRow_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'ActivityBrowserRow_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.OnQueryStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_C_OnQueryStatusChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRow_C_OnQueryStatusChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_C_OnQueryStatusChanged");
static_assert(sizeof(ActivityBrowserRow_C_OnQueryStatusChanged) == 0x000001, "Wrong size on ActivityBrowserRow_C_OnQueryStatusChanged");
static_assert(offsetof(ActivityBrowserRow_C_OnQueryStatusChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRow_C_OnQueryStatusChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.OnRowPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_C_OnRowPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRow_C_OnRowPeekStateChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_C_OnRowPeekStateChanged");
static_assert(sizeof(ActivityBrowserRow_C_OnRowPeekStateChanged) == 0x000001, "Wrong size on ActivityBrowserRow_C_OnRowPeekStateChanged");
static_assert(offsetof(ActivityBrowserRow_C_OnRowPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ActivityBrowserRow_C_OnRowPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.OnCategoryItemChanged
// 0x0002 (0x0002 - 0x0000)
struct ActivityBrowserRow_C_OnCategoryItemChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRow_C_OnCategoryItemChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_C_OnCategoryItemChanged");
static_assert(sizeof(ActivityBrowserRow_C_OnCategoryItemChanged) == 0x000002, "Wrong size on ActivityBrowserRow_C_OnCategoryItemChanged");
static_assert(offsetof(ActivityBrowserRow_C_OnCategoryItemChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRow_C_OnCategoryItemChanged::bIsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_OnCategoryItemChanged, bPlayAnimation) == 0x000001, "Member 'ActivityBrowserRow_C_OnCategoryItemChanged::bPlayAnimation' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.OnRowIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserRow_C_OnRowIsActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserRow_C_OnRowIsActiveChanged) == 0x000001, "Wrong alignment on ActivityBrowserRow_C_OnRowIsActiveChanged");
static_assert(sizeof(ActivityBrowserRow_C_OnRowIsActiveChanged) == 0x000001, "Wrong size on ActivityBrowserRow_C_OnRowIsActiveChanged");
static_assert(offsetof(ActivityBrowserRow_C_OnRowIsActiveChanged, bIsActive) == 0x000000, "Member 'ActivityBrowserRow_C_OnRowIsActiveChanged::bIsActive' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.SnapToEndOfAnimation
// 0x0018 (0x0018 - 0x0000)
struct ActivityBrowserRow_C_SnapToEndOfAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_C_SnapToEndOfAnimation) == 0x000008, "Wrong alignment on ActivityBrowserRow_C_SnapToEndOfAnimation");
static_assert(sizeof(ActivityBrowserRow_C_SnapToEndOfAnimation) == 0x000018, "Wrong size on ActivityBrowserRow_C_SnapToEndOfAnimation");
static_assert(offsetof(ActivityBrowserRow_C_SnapToEndOfAnimation, InAnimation) == 0x000000, "Member 'ActivityBrowserRow_C_SnapToEndOfAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_SnapToEndOfAnimation, PlayMode) == 0x000008, "Member 'ActivityBrowserRow_C_SnapToEndOfAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_SnapToEndOfAnimation, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'ActivityBrowserRow_C_SnapToEndOfAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_SnapToEndOfAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ActivityBrowserRow_C_SnapToEndOfAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ActivityBrowserRow.ActivityBrowserRow_C.UpdateNewRow
// 0x0040 (0x0040 - 0x0000)
struct ActivityBrowserRow_C_UpdateNewRow final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayAnimation_0;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInPeekState_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserArrowButton_C*          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivityBrowserRow_C_UpdateNewRow) == 0x000008, "Wrong alignment on ActivityBrowserRow_C_UpdateNewRow");
static_assert(sizeof(ActivityBrowserRow_C_UpdateNewRow) == 0x000040, "Wrong size on ActivityBrowserRow_C_UpdateNewRow");
static_assert(offsetof(ActivityBrowserRow_C_UpdateNewRow, IsActive) == 0x000000, "Member 'ActivityBrowserRow_C_UpdateNewRow::IsActive' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_UpdateNewRow, PlayAnimation_0) == 0x000001, "Member 'ActivityBrowserRow_C_UpdateNewRow::PlayAnimation_0' has a wrong offset!");
static_assert(offsetof(ActivityBrowserRow_C_UpdateNewRow, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ActivityBrowserRow_C_UpdateNewRow::Temp_int_Array_Index_Variable' has a wrong offset!");
