#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTabButton

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTabButton.ActivityBrowserTabButton_C
// 0x0030 (0x0C20 - 0x0BF0)
class UActivityBrowserTabButton_C final : public UFortActivityBrowserTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnModeFavorited;                                   // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselected;                                        // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_FavoriteIcon;                                // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserTabButton(int32 EntryPoint);
	void OnFavoriteChanged(bool bIsFavorite);
	void BP_OnDeselected();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTabButton_C">();
	}
	static class UActivityBrowserTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTabButton_C>();
	}
};
static_assert(alignof(UActivityBrowserTabButton_C) == 0x000008, "Wrong alignment on UActivityBrowserTabButton_C");
static_assert(sizeof(UActivityBrowserTabButton_C) == 0x000C20, "Wrong size on UActivityBrowserTabButton_C");
static_assert(offsetof(UActivityBrowserTabButton_C, UberGraphFrame) == 0x000BF0, "Member 'UActivityBrowserTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTabButton_C, OnModeFavorited) == 0x000BF8, "Member 'UActivityBrowserTabButton_C::OnModeFavorited' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTabButton_C, Unselected) == 0x000C00, "Member 'UActivityBrowserTabButton_C::Unselected' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTabButton_C, Hovered) == 0x000C08, "Member 'UActivityBrowserTabButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTabButton_C, Selected) == 0x000C10, "Member 'UActivityBrowserTabButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTabButton_C, Image_FavoriteIcon) == 0x000C18, "Member 'UActivityBrowserTabButton_C::Image_FavoriteIcon' has a wrong offset!");

}

