#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTag

#include "Basic.hpp"

#include "DiscoveryBrowserUI_structs.hpp"
#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTag.ActivityBrowserTag_C
// 0x0038 (0x02A8 - 0x0270)
class UActivityBrowserTag_C final : public UFortActivityBrowserTag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               HeightSB;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EpicContentIcon;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerIcon;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_XP;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TagContainer;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              TagSwitcher;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActivityBrowserTag(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnTagUpdated();
	void Construct();
	void SetTextColorFromMaterialInstance();
	void SetDefaultStyling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTag_C">();
	}
	static class UActivityBrowserTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTag_C>();
	}
};
static_assert(alignof(UActivityBrowserTag_C) == 0x000008, "Wrong alignment on UActivityBrowserTag_C");
static_assert(sizeof(UActivityBrowserTag_C) == 0x0002A8, "Wrong size on UActivityBrowserTag_C");
static_assert(offsetof(UActivityBrowserTag_C, UberGraphFrame) == 0x000270, "Member 'UActivityBrowserTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, HeightSB) == 0x000278, "Member 'UActivityBrowserTag_C::HeightSB' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, Image_EpicContentIcon) == 0x000280, "Member 'UActivityBrowserTag_C::Image_EpicContentIcon' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, Image_PlayerIcon) == 0x000288, "Member 'UActivityBrowserTag_C::Image_PlayerIcon' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, Image_XP) == 0x000290, "Member 'UActivityBrowserTag_C::Image_XP' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, TagContainer) == 0x000298, "Member 'UActivityBrowserTag_C::TagContainer' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, TagSwitcher) == 0x0002A0, "Member 'UActivityBrowserTag_C::TagSwitcher' has a wrong offset!");

}

