#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AgeGateFlow

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AgeGateFlow.AgeGateFlow_C
// 0x0020 (0x0578 - 0x0558)
class UAgeGateFlow_C final : public UFortAgeGateFlow
{
public:
	class UCommonActionWidget*                    CommonActionWidget_794;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_255;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AgeGateFlow_C">();
	}
	static class UAgeGateFlow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgeGateFlow_C>();
	}
};
static_assert(alignof(UAgeGateFlow_C) == 0x000008, "Wrong alignment on UAgeGateFlow_C");
static_assert(sizeof(UAgeGateFlow_C) == 0x000578, "Wrong size on UAgeGateFlow_C");
static_assert(offsetof(UAgeGateFlow_C, CommonActionWidget_794) == 0x000558, "Member 'UAgeGateFlow_C::CommonActionWidget_794' has a wrong offset!");
static_assert(offsetof(UAgeGateFlow_C, Image) == 0x000560, "Member 'UAgeGateFlow_C::Image' has a wrong offset!");
static_assert(offsetof(UAgeGateFlow_C, Image_1) == 0x000568, "Member 'UAgeGateFlow_C::Image_1' has a wrong offset!");
static_assert(offsetof(UAgeGateFlow_C, Image_255) == 0x000570, "Member 'UAgeGateFlow_C::Image_255' has a wrong offset!");

}

