#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AGV_Sideways

#include "Basic.hpp"


namespace SDK::Params
{

// Function AGV_Sideways.AGV_Sideways_C.ExecuteUbergraph_AGV_Sideways
// 0x0018 (0x0018 - 0x0000)
struct AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsInside;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways) == 0x000008, "Wrong alignment on AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways");
static_assert(sizeof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways) == 0x000018, "Wrong size on AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways");
static_assert(offsetof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways, EntryPoint) == 0x000000, "Member 'AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways::EntryPoint' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways, K2Node_ComponentBoundEvent_bIsInside) == 0x000004, "Member 'AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways::K2Node_ComponentBoundEvent_bIsInside' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000010, "Member 'AGV_Sideways_C_ExecuteUbergraph_AGV_Sideways::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");

// Function AGV_Sideways.AGV_Sideways_C.BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature final
{
public:
	bool                                          bIsInside;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature");
static_assert(sizeof(AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature) == 0x000001, "Wrong size on AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature");
static_assert(offsetof(AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature, bIsInside) == 0x000000, "Member 'AGV_Sideways_C_BndEvt__AudioShapeSphere_K2Node_ComponentBoundEvent_2_OnAudioShapeInsideStateChanged__DelegateSignature::bIsInside' has a wrong offset!");

// Function AGV_Sideways.AGV_Sideways_C.SetRadius
// 0x0008 (0x0008 - 0x0000)
struct AGV_Sideways_C_SetRadius final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AGV_Sideways_C_SetRadius) == 0x000004, "Wrong alignment on AGV_Sideways_C_SetRadius");
static_assert(sizeof(AGV_Sideways_C_SetRadius) == 0x000008, "Wrong size on AGV_Sideways_C_SetRadius");
static_assert(offsetof(AGV_Sideways_C_SetRadius, InRadius) == 0x000000, "Member 'AGV_Sideways_C_SetRadius::InRadius' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_SetRadius, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'AGV_Sideways_C_SetRadius::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function AGV_Sideways.AGV_Sideways_C.IsOptimized
// 0x0004 (0x0004 - 0x0000)
struct AGV_Sideways_C_IsOptimized final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AGV_Sideways_C_IsOptimized) == 0x000001, "Wrong alignment on AGV_Sideways_C_IsOptimized");
static_assert(sizeof(AGV_Sideways_C_IsOptimized) == 0x000004, "Wrong size on AGV_Sideways_C_IsOptimized");
static_assert(offsetof(AGV_Sideways_C_IsOptimized, Result) == 0x000000, "Member 'AGV_Sideways_C_IsOptimized::Result' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_IsOptimized, CallFunc_IsErebus_ReturnValue) == 0x000001, "Member 'AGV_Sideways_C_IsOptimized::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_IsOptimized, CallFunc_IsMobilePlatform_ReturnValue) == 0x000002, "Member 'AGV_Sideways_C_IsOptimized::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AGV_Sideways_C_IsOptimized, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'AGV_Sideways_C_IsOptimized::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

