#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemShopOfferPurchasedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemShopOfferPurchasedOverlay.AthenaItemShopOfferPurchasedOverlay_C
// 0x0190 (0x0600 - 0x0470)
class UAthenaItemShopOfferPurchasedOverlay_C final : public UAthenaItemShopPurchaseOverlayModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SuccessfullyRefundedBundleItem;                    // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Refunded;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item____FAST;                   // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Successfully_Purchased___Bundle_Item_;             // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__out_;                                 // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__loop_;                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item_;                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased_;                                        // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderItemNAme;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards1;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards2;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards3;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards4;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityFlare;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                ItemCard;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayMainItem;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMiniBundleItems;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Bundle_Item_Index;                                 // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid___Column;                           // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid___Row;                              // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReceivedItemLootInfo              Fort_Received_Loot_Info_Struct;                    // 0x0520(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBundleItemMiniCardWidget_C*>    Bundle_Mini_Item_Cards;                            // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          BundleBlurPlayed;                                  // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Mini_Bundle_Item_Location(int32 Bundle_Item_Index_0, class UHorizontalBox** HBox_Row);
	void Bundle_Item_Anim_Speed(float* Speed);
	void Get_Bundle_Info_from_Item_Def(class UFortAccountItemDefinition* Item_Definition, struct FBundledItemInfo* Bundled_Item_Info, bool* bFoundItem);
	void HandleBack(bool* PassThrough);
	void UpdateFromOffer(class UFortAccountItemDefinition* Item_Definition);
	void WidgetAnimationEvt_Purchased__K2Node_WidgetAnimationEvent_0();
	void Show_Next_Item();
	void BundleBlurOut();
	void WidgetAnimationEvt_Purchased___Bundle_Item__K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Purchased___Bundle_Item____FAST_K2Node_WidgetAnimationEvent_1();
	void Populate_Bundle_Mini_Cards();
	void Show_Bundle_Mini_Item_Card();
	void WidgetAnimationEvt_Refunded_K2Node_WidgetAnimationEvent_3();
	void InitBundleLayout();
	void Destruct();
	void BP_OnSetOffer();
	void ExecuteUbergraph_AthenaItemShopOfferPurchasedOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemShopOfferPurchasedOverlay_C">();
	}
	static class UAthenaItemShopOfferPurchasedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemShopOfferPurchasedOverlay_C>();
	}
};
static_assert(alignof(UAthenaItemShopOfferPurchasedOverlay_C) == 0x000008, "Wrong alignment on UAthenaItemShopOfferPurchasedOverlay_C");
static_assert(sizeof(UAthenaItemShopOfferPurchasedOverlay_C) == 0x000600, "Wrong size on UAthenaItemShopOfferPurchasedOverlay_C");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, UberGraphFrame) == 0x000470, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, SuccessfullyRefundedBundleItem) == 0x000478, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::SuccessfullyRefundedBundleItem' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Refunded) == 0x000480, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Refunded' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Purchased___Bundle_Item____FAST) == 0x000488, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Purchased___Bundle_Item____FAST' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Successfully_Purchased___Bundle_Item_) == 0x000490, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Successfully_Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Bundle_Blur__out_) == 0x000498, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Bundle_Blur__out_' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Bundle_Blur__loop_) == 0x0004A0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Bundle_Blur__loop_' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Purchased___Bundle_Item_) == 0x0004A8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Purchased_) == 0x0004B0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Purchased_' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, BorderItemNAme) == 0x0004B8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::BorderItemNAme' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, HBoxMiniCards1) == 0x0004C0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::HBoxMiniCards1' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, HBoxMiniCards2) == 0x0004C8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::HBoxMiniCards2' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, HBoxMiniCards3) == 0x0004D0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::HBoxMiniCards3' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, HBoxMiniCards4) == 0x0004D8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::HBoxMiniCards4' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, ImageRarityFlare) == 0x0004E0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::ImageRarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, ItemCard) == 0x0004E8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, OverlayMainItem) == 0x0004F0, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::OverlayMainItem' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, RarityGlow) == 0x0004F8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, SizeBoxMiniBundleItems) == 0x000500, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::SizeBoxMiniBundleItems' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, TextName) == 0x000508, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Bundle_Item_Index) == 0x000510, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Bundle_Item_Index' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, BundleMiniGrid___Column) == 0x000514, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::BundleMiniGrid___Column' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, BundleMiniGrid___Row) == 0x000518, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::BundleMiniGrid___Row' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Fort_Received_Loot_Info_Struct) == 0x000520, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Fort_Received_Loot_Info_Struct' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, Bundle_Mini_Item_Cards) == 0x0005E8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::Bundle_Mini_Item_Cards' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferPurchasedOverlay_C, BundleBlurPlayed) == 0x0005F8, "Member 'UAthenaItemShopOfferPurchasedOverlay_C::BundleBlurPlayed' has a wrong offset!");

}

