#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMOTDTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMOTDTile.AthenaMOTDTile_C
// 0x0088 (0x0CF8 - 0x0C70)
class UAthenaMOTDTile_C final : public UFortAthenaMOTDTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0C80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Details;                                    // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_PipDisplay;                                 // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ClickCatcher;                                // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            LoadSwitcher;                                      // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowImageOnly;                                    // 0x0CE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE1[0x7];                                      // 0x0CE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool NewIsHovered)> OnHoveredChanged;                                  // 0x0CE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_AthenaMOTDTile(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ShowImageOnly();
	void UpdateDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMOTDTile_C">();
	}
	static class UAthenaMOTDTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMOTDTile_C>();
	}
};
static_assert(alignof(UAthenaMOTDTile_C) == 0x000008, "Wrong alignment on UAthenaMOTDTile_C");
static_assert(sizeof(UAthenaMOTDTile_C) == 0x000CF8, "Wrong size on UAthenaMOTDTile_C");
static_assert(offsetof(UAthenaMOTDTile_C, UberGraphFrame) == 0x000C70, "Member 'UAthenaMOTDTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHovered) == 0x000C78, "Member 'UAthenaMOTDTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Intro) == 0x000C80, "Member 'UAthenaMOTDTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_Details) == 0x000C88, "Member 'UAthenaMOTDTile_C::Border_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Border_PipDisplay) == 0x000C90, "Member 'UAthenaMOTDTile_C::Border_PipDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, CommonLoadGuard_0) == 0x000C98, "Member 'UAthenaMOTDTile_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Fill) == 0x000CA0, "Member 'UAthenaMOTDTile_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_196) == 0x000CA8, "Member 'UAthenaMOTDTile_C::Image_196' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, Image_ClickCatcher) == 0x000CB0, "Member 'UAthenaMOTDTile_C::Image_ClickCatcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImage) == 0x000CB8, "Member 'UAthenaMOTDTile_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadingImageOvr) == 0x000CC0, "Member 'UAthenaMOTDTile_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, LoadSwitcher) == 0x000CC8, "Member 'UAthenaMOTDTile_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, NewsItemScale) == 0x000CD0, "Member 'UAthenaMOTDTile_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, SizeBox_Tile) == 0x000CD8, "Member 'UAthenaMOTDTile_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, bShowImageOnly) == 0x000CE0, "Member 'UAthenaMOTDTile_C::bShowImageOnly' has a wrong offset!");
static_assert(offsetof(UAthenaMOTDTile_C, OnHoveredChanged) == 0x000CE8, "Member 'UAthenaMOTDTile_C::OnHoveredChanged' has a wrong offset!");

}

