#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_BurstReaction_Exploding

#include "Basic.hpp"

#include "Athena_DamageStateParticles_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_BurstReaction_Exploding.Athena_Prop_BurstReaction_Exploding_C.ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding
// 0x0A28 (0x0A28 - 0x0000)
struct Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         CallFunc_GetDeathParticles_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_2;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_3;                // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_4;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_5;                // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_2;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0110(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x013C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy_2;                       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x01D8(0x0018)()
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTags_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPercent_ReturnValue;             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0258(0x00C0)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0318(0x00C0)(ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x03D8(0x00C0)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_1;                             // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x04A0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x04CC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0568(0x0018)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue; // 0x0598(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x05A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x05B0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x05D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0608(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0630(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_6;                // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_3;               // 0x0658(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665[0x3];                                      // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_4;               // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_7;                // 0x06BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x06D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x06E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x06EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_4;                     // 0x0704(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_5;               // 0x0724(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_1;     // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0740(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x3];                                      // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue_1;               // 0x0764(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0770(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_1;                    // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0788(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_6;               // 0x07AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x07C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C3[0x5];                                      // 0x07C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_3; // 0x07E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue_1; // 0x07EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1; // 0x07FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0804(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0810(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x083C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x08D8(0x0018)()
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x08F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_901[0x7];                                      // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x0908(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0918(0x0020)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTags_ReturnValue_1;                    // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D[0x3];                                      // 0x093D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0940(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0960(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x096C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x097C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_5;                     // 0x0988(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_7;               // 0x0994(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue_2;     // 0x09A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x09AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue_2;               // 0x09BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue_2;                    // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_2;            // 0x09CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D9[0x3];                                      // 0x09D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_8;               // 0x09DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x09E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x09F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0A00(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0A0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0A10(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0A1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1D[0x3];                                      // 0x0A1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding) == 0x000008, "Wrong alignment on Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding");
static_assert(sizeof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding) == 0x000A28, "Wrong size on Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, EntryPoint) == 0x000000, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetDeathParticles_ReturnValue) == 0x000008, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetDeathParticles_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_object_Variable) == 0x000010, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue) == 0x00002C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue) == 0x000038, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_1) == 0x000044, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue) == 0x000068, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_2) == 0x000074, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000080, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue_1) == 0x00008C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_3) == 0x000098, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_Variable) == 0x0000A4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue_1) == 0x0000A8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000B0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue_1) == 0x0000B4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_IsClosed_Variable) == 0x0000C0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_Has_Been_Initd_Variable) == 0x0000C1, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_HitLocation) == 0x0000C4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_IsServer_ReturnValue) == 0x0000D4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_4) == 0x0000D8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x0000E4, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Normal_ReturnValue_2) == 0x0000F0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetVelocity_ReturnValue_5) == 0x0000FC, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetVelocity_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Damage_2) == 0x000108, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Damage_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageTags_2) == 0x000110, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageTags_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Momentum_2) == 0x000130, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Momentum_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_HitInfo_2) == 0x00013C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_InstigatedBy_2) == 0x0001C8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_InstigatedBy_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageCauser_2) == 0x0001D0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageCauser_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_EffectContext_2) == 0x0001D8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_EffectContext_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_VSize_ReturnValue_2) == 0x0001F0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001F8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000201, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SelectVector_ReturnValue_2) == 0x000204, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_HasTags_ReturnValue) == 0x000210, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_HasTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000214, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_int_Array_Index_Variable) == 0x000220, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000224, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_Array_Get_Item) == 0x000230, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000238, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetHealthPercent_ReturnValue) == 0x000240, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetHealthPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000248, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000250, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000258, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000318, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_MakeGameplayCueParameters_ReturnValue_2) == 0x0003D8, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_MakeGameplayCueParameters_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, Temp_bool_Has_Been_Initd_Variable_1) == 0x000498, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Damage_1) == 0x00049C, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageTags_1) == 0x0004A0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_Momentum_1) == 0x0004C0, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_HitInfo_1) == 0x0004CC, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_InstigatedBy_1) == 0x000558, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_DamageCauser_1) == 0x000560, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, K2Node_Event_EffectContext_1) == 0x000568, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_K2_GetPawn_ReturnValue) == 0x000580, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_IsValid_ReturnValue) == 0x000588, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000590, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding, CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue) == 0x000598, "Member 'Athena_Prop_BurstReaction_Exploding_C_ExecuteUbergraph_Athena_Prop_BurstReaction_Exploding::CallFunc_BP_FortApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
