#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBoundActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBoundActionButton.AthenaBoundActionButton_C
// 0x0018 (0x0C28 - 0x0C10)
class UAthenaBoundActionButton_C final : public UFortBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateInputActionIconSize();
	void OnUpdateInputAction();
	void ExecuteUbergraph_AthenaBoundActionButton(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBoundActionButton_C">();
	}
	static class UAthenaBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBoundActionButton_C>();
	}
};
static_assert(alignof(UAthenaBoundActionButton_C) == 0x000008, "Wrong alignment on UAthenaBoundActionButton_C");
static_assert(sizeof(UAthenaBoundActionButton_C) == 0x000C28, "Wrong size on UAthenaBoundActionButton_C");
static_assert(offsetof(UAthenaBoundActionButton_C, UberGraphFrame) == 0x000C10, "Member 'UAthenaBoundActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBoundActionButton_C, ContentBorder) == 0x000C18, "Member 'UAthenaBoundActionButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UAthenaBoundActionButton_C, InputActionIconScale) == 0x000C20, "Member 'UAthenaBoundActionButton_C::InputActionIconScale' has a wrong offset!");

}

