#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemShopOfferStyleScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemShopOfferStyleScreen.AthenaItemShopOfferStyleScreen_C
// 0x0038 (0x0500 - 0x04C8)
class UAthenaItemShopOfferStyleScreen_C final : public UAthenaItemShopOfferStyleScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCloseButton_C*                         CloseButton;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OfferSet;                                          // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexIntoOffersWithVariantsList;                   // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OfferSubIndicesWithVariants;                       // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortItemDefinition*                    InitialTriggeringItemDef;                          // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CharacterItem_0;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandleBack(bool* bPassThrough);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void HandleBackAction();
	void ExecuteUbergraph_AthenaItemShopOfferStyleScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemShopOfferStyleScreen_C">();
	}
	static class UAthenaItemShopOfferStyleScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemShopOfferStyleScreen_C>();
	}
};
static_assert(alignof(UAthenaItemShopOfferStyleScreen_C) == 0x000008, "Wrong alignment on UAthenaItemShopOfferStyleScreen_C");
static_assert(sizeof(UAthenaItemShopOfferStyleScreen_C) == 0x000500, "Wrong size on UAthenaItemShopOfferStyleScreen_C");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, UberGraphFrame) == 0x0004C8, "Member 'UAthenaItemShopOfferStyleScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, CloseButton) == 0x0004D0, "Member 'UAthenaItemShopOfferStyleScreen_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, OfferSet) == 0x0004D8, "Member 'UAthenaItemShopOfferStyleScreen_C::OfferSet' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, IndexIntoOffersWithVariantsList) == 0x0004DC, "Member 'UAthenaItemShopOfferStyleScreen_C::IndexIntoOffersWithVariantsList' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, OfferSubIndicesWithVariants) == 0x0004E0, "Member 'UAthenaItemShopOfferStyleScreen_C::OfferSubIndicesWithVariants' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, InitialTriggeringItemDef) == 0x0004F0, "Member 'UAthenaItemShopOfferStyleScreen_C::InitialTriggeringItemDef' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopOfferStyleScreen_C, CharacterItem_0) == 0x0004F8, "Member 'UAthenaItemShopOfferStyleScreen_C::CharacterItem_0' has a wrong offset!");

}

