#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemShopConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemShopConfirmation.AthenaItemShopConfirmation_C
// 0x00A8 (0x04E8 - 0x0440)
class UAthenaItemShopConfirmation_C final : public UAthenaItemShopOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaDirectAcquisitonDetails_BattlePassStarDetails_C* AthenaDirectAcquisitonDetails_BattlePassStarDetails; // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencyVB;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemRewardsSB;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* NonrefundableText;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OfferName;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice1;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanPurchase;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPurchasing;                                      // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x2];                                      // 0x04BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberToPurchase;                                  // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPurchaseLeft;                                   // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanPurchaseRight;                                  // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanChangeQuantity;                                 // 0x04C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C3[0x5];                                      // 0x04C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Confirm;                                           // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Decline;                                           // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetPurchaseNumber(int32 InNumToPurchse);
	void UpdateCatalogOfferName();
	void UpdateItemList();
	void SetupPrice(class UWidget* PriceContainer, class UTextBlock* NormalPriceText, class UWidget* SalePriceContainer, class UTextBlock* SalePriceText, class UImage* CurrencyImage);
	void UpdateFromOffer();
	void BP_OnActivated();
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Construct();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_171_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_OnSetOffer();
	void ExecuteUbergraph_AthenaItemShopConfirmation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemShopConfirmation_C">();
	}
	static class UAthenaItemShopConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemShopConfirmation_C>();
	}
};
static_assert(alignof(UAthenaItemShopConfirmation_C) == 0x000008, "Wrong alignment on UAthenaItemShopConfirmation_C");
static_assert(sizeof(UAthenaItemShopConfirmation_C) == 0x0004E8, "Wrong size on UAthenaItemShopConfirmation_C");
static_assert(offsetof(UAthenaItemShopConfirmation_C, UberGraphFrame) == 0x000440, "Member 'UAthenaItemShopConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, AthenaDirectAcquisitonDetails_BattlePassStarDetails) == 0x000448, "Member 'UAthenaItemShopConfirmation_C::AthenaDirectAcquisitonDetails_BattlePassStarDetails' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CancelButton) == 0x000450, "Member 'UAthenaItemShopConfirmation_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CommonTextBlock_0) == 0x000458, "Member 'UAthenaItemShopConfirmation_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, Currency1ItemImage2) == 0x000460, "Member 'UAthenaItemShopConfirmation_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CurrencyVB) == 0x000468, "Member 'UAthenaItemShopConfirmation_C::CurrencyVB' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, ItemRewardsSB) == 0x000470, "Member 'UAthenaItemShopConfirmation_C::ItemRewardsSB' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, Lightbox) == 0x000478, "Member 'UAthenaItemShopConfirmation_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, MTXButton) == 0x000480, "Member 'UAthenaItemShopConfirmation_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, NonrefundableText) == 0x000488, "Member 'UAthenaItemShopConfirmation_C::NonrefundableText' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, O_Sale_PreviousPrice) == 0x000490, "Member 'UAthenaItemShopConfirmation_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, OfferName) == 0x000498, "Member 'UAthenaItemShopConfirmation_C::OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, PurchaseButton) == 0x0004A0, "Member 'UAthenaItemShopConfirmation_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, TextOfferDisplayPrice1) == 0x0004A8, "Member 'UAthenaItemShopConfirmation_C::TextOfferDisplayPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, TextOriginalPrice1) == 0x0004B0, "Member 'UAthenaItemShopConfirmation_C::TextOriginalPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CanPurchase) == 0x0004B8, "Member 'UAthenaItemShopConfirmation_C::CanPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, IsPurchasing) == 0x0004B9, "Member 'UAthenaItemShopConfirmation_C::IsPurchasing' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, NumberToPurchase) == 0x0004BC, "Member 'UAthenaItemShopConfirmation_C::NumberToPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CanPurchaseLeft) == 0x0004C0, "Member 'UAthenaItemShopConfirmation_C::CanPurchaseLeft' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CanPurchaseRight) == 0x0004C1, "Member 'UAthenaItemShopConfirmation_C::CanPurchaseRight' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, CanChangeQuantity) == 0x0004C2, "Member 'UAthenaItemShopConfirmation_C::CanChangeQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, Confirm) == 0x0004C8, "Member 'UAthenaItemShopConfirmation_C::Confirm' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopConfirmation_C, Decline) == 0x0004D8, "Member 'UAthenaItemShopConfirmation_C::Decline' has a wrong offset!");

}

