#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemShopOfferStyleScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaItemShopOfferStyleScreen.AthenaItemShopOfferStyleScreen_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemShopOfferStyleScreen_C_HandleBack final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemShopOfferStyleScreen_C_HandleBack) == 0x000001, "Wrong alignment on AthenaItemShopOfferStyleScreen_C_HandleBack");
static_assert(sizeof(AthenaItemShopOfferStyleScreen_C_HandleBack) == 0x000001, "Wrong size on AthenaItemShopOfferStyleScreen_C_HandleBack");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_HandleBack, bPassThrough) == 0x000000, "Member 'AthenaItemShopOfferStyleScreen_C_HandleBack::bPassThrough' has a wrong offset!");

// Function AthenaItemShopOfferStyleScreen.AthenaItemShopOfferStyleScreen_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaItemShopOfferStyleScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaItemShopOfferStyleScreen.AthenaItemShopOfferStyleScreen_C.ExecuteUbergraph_AthenaItemShopOfferStyleScreen
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_bPassThrough;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleBack_bPassThrough_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen) == 0x000008, "Wrong alignment on AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen");
static_assert(sizeof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen) == 0x000010, "Wrong size on AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen, EntryPoint) == 0x000000, "Member 'AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen, CallFunc_HandleBack_bPassThrough) == 0x000004, "Member 'AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen::CallFunc_HandleBack_bPassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen, CallFunc_HandleBack_bPassThrough_1) == 0x000005, "Member 'AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen::CallFunc_HandleBack_bPassThrough_1' has a wrong offset!");
static_assert(offsetof(AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'AthenaItemShopOfferStyleScreen_C_ExecuteUbergraph_AthenaItemShopOfferStyleScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

