#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemShopMTXOfferDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemShopMTXOfferDetails.AthenaItemShopMTXOfferDetails_C
// 0x0118 (0x0608 - 0x04F0)
class UAthenaItemShopMTXOfferDetails_C final : public UAthenaItemShopRealMoneyOfferDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseColor;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BonusMTXArea;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_CurrencyIcon;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXArea;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneCloseButton;                               // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneMTX;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute1;                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute2;                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuckHighlight;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UFortMtxOfferData*>         ABAssetCollection;                                 // 0x05B8(0x0050)(Edit, BlueprintVisible)

public:
	void InitDetailAttributes();
	void SetupCurrencyImage();
	void SetPurchaseButtonText(const class FText& ButtonText);
	void UpdatePurchaseButton();
	bool IsGiftingStorefrontOffer();
	void InitCurrency();
	void GetCurrencyABAssetFromQuantity(int32 Quantity, class UFortMtxOfferData** DataAsset);
	void InitStoreTypeVisuals();
	void PopDetails();
	void BP_OnSetOffer();
	void ExecuteUbergraph_AthenaItemShopMTXOfferDetails(int32 EntryPoint);
	void Init();
	void ResetPurchaseButtonText();
	void OnPurchasingStarted();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemShopMTXOfferDetails_C">();
	}
	static class UAthenaItemShopMTXOfferDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemShopMTXOfferDetails_C>();
	}
};
static_assert(alignof(UAthenaItemShopMTXOfferDetails_C) == 0x000008, "Wrong alignment on UAthenaItemShopMTXOfferDetails_C");
static_assert(sizeof(UAthenaItemShopMTXOfferDetails_C) == 0x000608, "Wrong size on UAthenaItemShopMTXOfferDetails_C");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, UberGraphFrame) == 0x0004F0, "Member 'UAthenaItemShopMTXOfferDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, BaseColor) == 0x0004F8, "Member 'UAthenaItemShopMTXOfferDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, BaseColorDetails) == 0x000500, "Member 'UAthenaItemShopMTXOfferDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, BonusMTXArea) == 0x000508, "Member 'UAthenaItemShopMTXOfferDetails_C::BonusMTXArea' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, BorderDisclaimer) == 0x000510, "Member 'UAthenaItemShopMTXOfferDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, CommonText_BaseQuantity) == 0x000518, "Member 'UAthenaItemShopMTXOfferDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, CommonText_BonusQuantity) == 0x000520, "Member 'UAthenaItemShopMTXOfferDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, Highlight) == 0x000528, "Member 'UAthenaItemShopMTXOfferDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, Image_CurrencyIcon) == 0x000530, "Member 'UAthenaItemShopMTXOfferDetails_C::Image_CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, KeyArt) == 0x000538, "Member 'UAthenaItemShopMTXOfferDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, MTXArea) == 0x000540, "Member 'UAthenaItemShopMTXOfferDetails_C::MTXArea' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, MTXButtonBox) == 0x000548, "Member 'UAthenaItemShopMTXOfferDetails_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, OverlayGradient) == 0x000550, "Member 'UAthenaItemShopMTXOfferDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, OverlayGradientDetails) == 0x000558, "Member 'UAthenaItemShopMTXOfferDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, OverlaySalePrice) == 0x000560, "Member 'UAthenaItemShopMTXOfferDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, SafeZoneCloseButton) == 0x000568, "Member 'UAthenaItemShopMTXOfferDetails_C::SafeZoneCloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, SafeZoneMTX) == 0x000570, "Member 'UAthenaItemShopMTXOfferDetails_C::SafeZoneMTX' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, StoreMain_OfferDetailsAttribute1) == 0x000578, "Member 'UAthenaItemShopMTXOfferDetails_C::StoreMain_OfferDetailsAttribute1' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, StoreMain_OfferDetailsAttribute2) == 0x000580, "Member 'UAthenaItemShopMTXOfferDetails_C::StoreMain_OfferDetailsAttribute2' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, TextDescription) == 0x000588, "Member 'UAthenaItemShopMTXOfferDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, TextName) == 0x000590, "Member 'UAthenaItemShopMTXOfferDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, TextOfferDisplayPrice) == 0x000598, "Member 'UAthenaItemShopMTXOfferDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, TextOriginalPrice) == 0x0005A0, "Member 'UAthenaItemShopMTXOfferDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, VBoxOfferInfo) == 0x0005A8, "Member 'UAthenaItemShopMTXOfferDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, VBuckHighlight) == 0x0005B0, "Member 'UAthenaItemShopMTXOfferDetails_C::VBuckHighlight' has a wrong offset!");
static_assert(offsetof(UAthenaItemShopMTXOfferDetails_C, ABAssetCollection) == 0x0005B8, "Member 'UAthenaItemShopMTXOfferDetails_C::ABAssetCollection' has a wrong offset!");

}

