#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ActorSpawner_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.ExecuteUbergraph_B_ActorSpawner_Parent
// 0x0450 (0x0450 - 0x0000)
struct B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     CallFunc_GetActorClassToSpawn_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x00A8(0x0020)()
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_New_Transform;                  // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EF[0x1];                                      // 0x02EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_2;            // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0390(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0398(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue_1;              // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_1;              // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0400(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent) == 0x000010, "Wrong alignment on B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent");
static_assert(sizeof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent) == 0x000450, "Wrong size on B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, EntryPoint) == 0x000000, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetActorClassToSpawn_ReturnValue) == 0x000008, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetActorClassToSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor) == 0x000010, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_ClassDynamicCast_AsBuilding_Gameplay_Actor' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_IsValidClass_ReturnValue) == 0x000019, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x00001C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000020, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_Actor) == 0x000028, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000030, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_QueryInstance) == 0x000038, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_QueryStatus) == 0x000040, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_IsServer_ReturnValue) == 0x000041, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x000048, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x000058, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, Temp_object_Variable) == 0x000060, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RowToBool_ReturnValue) == 0x000070, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, Temp_int_Variable) == 0x000084, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, Temp_object_Variable_1) == 0x000098, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, Temp_object_Variable_2) == 0x0000A0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, Temp_struct_Variable) == 0x0000A8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakTransform_Location) == 0x000100, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakTransform_Rotation) == 0x00010C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakTransform_Scale) == 0x000118, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000131, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_SelectVector_ReturnValue) == 0x000134, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000170, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000174, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000180, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000184, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000188, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_New_Transform) == 0x0001A0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_New_Transform' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001D0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0001D8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001E0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_DynamicCast_AsBuilding_Actor) == 0x0001E8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RunEQSQuery_ReturnValue) == 0x0001F8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetGameMode_ReturnValue) == 0x000200, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000208, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000210, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00021C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RotateAngleAxis_ReturnValue) == 0x000228, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_MakeRotFromZX_ReturnValue) == 0x000234, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000240, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00024C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000258, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_LineTraceSingle_OutHit) == 0x000264, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_LineTraceSingle_ReturnValue) == 0x0002EC, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x0002ED, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002EE, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_Time) == 0x0002F0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_Distance) == 0x0002F4, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_Location) == 0x0002F8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x000304, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_Normal) == 0x000310, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x00031C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000328, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_HitActor) == 0x000330, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_HitComponent) == 0x000338, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x000340, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_HitItem) == 0x000348, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_ElementIndex) == 0x00034C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x000350, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_TraceStart) == 0x000354, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x000360, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x00036C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RotateAngleAxis_ReturnValue_2) == 0x000378, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RotateAngleAxis_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_GameState) == 0x000388, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_Playlist) == 0x000390, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000398, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003B8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_SelectVector_ReturnValue_1) == 0x0003C8, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_MakeRotFromZX_ReturnValue_1) == 0x0003D4, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_MakeRotFromZX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x0003E0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_SelectRotator_ReturnValue) == 0x0003E4, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_SelectRotator_ReturnValue_1) == 0x0003F0, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_SelectRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_MakeTransform_ReturnValue_1) == 0x000400, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000430, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_FClamp_ReturnValue_1) == 0x000434, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000438, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00043C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_FClamp_ReturnValue_2) == 0x000440, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_FTrunc_ReturnValue) == 0x000444, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x000448, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent, CallFunc_Clamp_ReturnValue) == 0x00044C, "Member 'B_ActorSpawner_Parent_C_ExecuteUbergraph_B_ActorSpawner_Parent::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.SpawnActor
// 0x0030 (0x0030 - 0x0000)
struct B_ActorSpawner_Parent_C_SpawnActor final
{
public:
	struct FTransform                             New_Transform;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ActorSpawner_Parent_C_SpawnActor) == 0x000010, "Wrong alignment on B_ActorSpawner_Parent_C_SpawnActor");
static_assert(sizeof(B_ActorSpawner_Parent_C_SpawnActor) == 0x000030, "Wrong size on B_ActorSpawner_Parent_C_SpawnActor");
static_assert(offsetof(B_ActorSpawner_Parent_C_SpawnActor, New_Transform) == 0x000000, "Member 'B_ActorSpawner_Parent_C_SpawnActor::New_Transform' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.EQS Finished
// 0x0010 (0x0010 - 0x0000)
struct B_ActorSpawner_Parent_C_EQS_Finished final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ActorSpawner_Parent_C_EQS_Finished) == 0x000008, "Wrong alignment on B_ActorSpawner_Parent_C_EQS_Finished");
static_assert(sizeof(B_ActorSpawner_Parent_C_EQS_Finished) == 0x000010, "Wrong size on B_ActorSpawner_Parent_C_EQS_Finished");
static_assert(offsetof(B_ActorSpawner_Parent_C_EQS_Finished, QueryInstance_0) == 0x000000, "Member 'B_ActorSpawner_Parent_C_EQS_Finished::QueryInstance_0' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_EQS_Finished, QueryStatus) == 0x000008, "Member 'B_ActorSpawner_Parent_C_EQS_Finished::QueryStatus' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.ServerActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct B_ActorSpawner_Parent_C_ServerActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ActorSpawner_Parent_C_ServerActorSpawned) == 0x000008, "Wrong alignment on B_ActorSpawner_Parent_C_ServerActorSpawned");
static_assert(sizeof(B_ActorSpawner_Parent_C_ServerActorSpawned) == 0x000008, "Wrong size on B_ActorSpawner_Parent_C_ServerActorSpawned");
static_assert(offsetof(B_ActorSpawner_Parent_C_ServerActorSpawned, Actor) == 0x000000, "Member 'B_ActorSpawner_Parent_C_ServerActorSpawned::Actor' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.OnReady_3020151C426C42F77FE60292E2524DFC
// 0x0030 (0x0030 - 0x0000)
struct B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC) == 0x000008, "Wrong alignment on B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC");
static_assert(sizeof(B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC) == 0x000030, "Wrong size on B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC");
static_assert(offsetof(B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC, GameState) == 0x000000, "Member 'B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC::GameState' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC, Playlist) == 0x000008, "Member 'B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC::Playlist' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC, PlaylistContextTags) == 0x000010, "Member 'B_ActorSpawner_Parent_C_OnReady_3020151C426C42F77FE60292E2524DFC::PlaylistContextTags' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.UserConstructionScript
// 0x0058 (0x0058 - 0x0000)
struct B_ActorSpawner_Parent_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(B_ActorSpawner_Parent_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_ActorSpawner_Parent_C_UserConstructionScript");
static_assert(sizeof(B_ActorSpawner_Parent_C_UserConstructionScript) == 0x000058, "Wrong size on B_ActorSpawner_Parent_C_UserConstructionScript");
static_assert(offsetof(B_ActorSpawner_Parent_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue) == 0x000000, "Member 'B_ActorSpawner_Parent_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000010, "Member 'B_ActorSpawner_Parent_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'B_ActorSpawner_Parent_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'B_ActorSpawner_Parent_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'B_ActorSpawner_Parent_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function B_ActorSpawner_Parent.B_ActorSpawner_Parent_C.GetActorClassToSpawn
// 0x0010 (0x0010 - 0x0000)
struct B_ActorSpawner_Parent_C_GetActorClassToSpawn final
{
public:
	TSubclassOf<class AActor>                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     CallFunc_SelectRandomActorTypeFromList_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(B_ActorSpawner_Parent_C_GetActorClassToSpawn) == 0x000008, "Wrong alignment on B_ActorSpawner_Parent_C_GetActorClassToSpawn");
static_assert(sizeof(B_ActorSpawner_Parent_C_GetActorClassToSpawn) == 0x000010, "Wrong size on B_ActorSpawner_Parent_C_GetActorClassToSpawn");
static_assert(offsetof(B_ActorSpawner_Parent_C_GetActorClassToSpawn, ReturnValue) == 0x000000, "Member 'B_ActorSpawner_Parent_C_GetActorClassToSpawn::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ActorSpawner_Parent_C_GetActorClassToSpawn, CallFunc_SelectRandomActorTypeFromList_ReturnValue) == 0x000008, "Member 'B_ActorSpawner_Parent_C_GetActorClassToSpawn::CallFunc_SelectRandomActorTypeFromList_ReturnValue' has a wrong offset!");

}

