#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Sideways_SplitScreen_P2

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Sideways_SplitScreen_P2.B_Athena_Sideways_SplitScreen_P2_C.BlueprintModifyPostProcess
// 0x0560 (0x0560 - 0x0000)
struct B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings_0;                             // 0x0010(0x0550)(Parm, OutParm)
};
static_assert(alignof(B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess");
static_assert(sizeof(B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess) == 0x000560, "Wrong size on B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess");
static_assert(offsetof(B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess, PostProcessSettings_0) == 0x000010, "Member 'B_Athena_Sideways_SplitScreen_P2_C_BlueprintModifyPostProcess::PostProcessSettings_0' has a wrong offset!");

}

