#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_BuriedChest_Spawner_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C
// 0x00F8 (0x0318 - 0x0220)
class AB_Athena_BuriedChest_Spawner_Parent_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEnvQuery*                              EQS;                                               // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MinChanceToSpawn;                              // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxChanceToSpawn;                              // 0x0260(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnRadius;                                   // 0x0288(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnEnabled;                                  // 0x02B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SpawnGlobalEnabled;                            // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 BuriedChestPropClass;                              // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnDirectlyUnderSpawner;                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectlyUnderTraceDownDistance;                    // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               DirectlyUnderTraceChannel;                         // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugDrawDurationTime;                             // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void EQSFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void OnReady_15E7642D436E49800BF6F09D6BBB7637(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void UserConstructionScript();
	bool CheckForSpawnRate();
	void SpawnChest(class UClass* Class_0, const struct FTransform& SpawnTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_BuriedChest_Spawner_Parent_C">();
	}
	static class AB_Athena_BuriedChest_Spawner_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_BuriedChest_Spawner_Parent_C>();
	}
};
static_assert(alignof(AB_Athena_BuriedChest_Spawner_Parent_C) == 0x000008, "Wrong alignment on AB_Athena_BuriedChest_Spawner_Parent_C");
static_assert(sizeof(AB_Athena_BuriedChest_Spawner_Parent_C) == 0x000318, "Wrong size on AB_Athena_BuriedChest_Spawner_Parent_C");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, UberGraphFrame) == 0x000220, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, DefaultSceneRoot) == 0x000228, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, EQS) == 0x000230, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::EQS' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, Row_MinChanceToSpawn) == 0x000238, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::Row_MinChanceToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, Row_MaxChanceToSpawn) == 0x000260, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::Row_MaxChanceToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, Row_SpawnRadius) == 0x000288, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::Row_SpawnRadius' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, Row_SpawnEnabled) == 0x0002B0, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::Row_SpawnEnabled' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, Row_SpawnGlobalEnabled) == 0x0002D8, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::Row_SpawnGlobalEnabled' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, BuriedChestPropClass) == 0x000300, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::BuriedChestPropClass' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, SpawnDirectlyUnderSpawner) == 0x000308, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::SpawnDirectlyUnderSpawner' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, DirectlyUnderTraceDownDistance) == 0x00030C, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::DirectlyUnderTraceDownDistance' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, DirectlyUnderTraceChannel) == 0x000310, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::DirectlyUnderTraceChannel' has a wrong offset!");
static_assert(offsetof(AB_Athena_BuriedChest_Spawner_Parent_C, DebugDrawDurationTime) == 0x000314, "Member 'AB_Athena_BuriedChest_Spawner_Parent_C::DebugDrawDurationTime' has a wrong offset!");

}

