#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_BuriedChest_Spawner_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent
// 0x02C0 (0x02C0 - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0018(0x0020)(ConstParm)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckForSpawnRate_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0xC];                                      // 0x0274(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent) == 0x000010, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent) == 0x0002C0, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, EntryPoint) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CustomEvent_GameState) == 0x000008, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CustomEvent_Playlist) == 0x000010, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000018, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, Temp_struct_Variable) == 0x000048, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, Temp_object_Variable) == 0x000068, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, Temp_object_Variable_1) == 0x000070, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000078, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, Temp_object_Variable_2) == 0x000088, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x000098, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RunEQSQuery_ReturnValue) == 0x0000A0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_MakeRotator_ReturnValue) == 0x0000A8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_IsServer_ReturnValue) == 0x0000B4, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CustomEvent_QueryInstance) == 0x0000B8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CustomEvent_QueryStatus) == 0x0000C0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x0000C8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x0000D8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_CheckForSpawnRate_ReturnValue) == 0x0000D9, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_CheckForSpawnRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000120, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000124, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RowToBool_ReturnValue) == 0x000128, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RowToBool_ReturnValue_1) == 0x000129, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RowToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BooleanAND_ReturnValue) == 0x00012A, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00012C, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000138, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_MakeVector_ReturnValue) == 0x00013C, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_MakeRotator_ReturnValue_1) == 0x000148, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_Add_VectorVector_ReturnValue) == 0x000154, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_LineTraceSingle_OutHit) == 0x000160, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_LineTraceSingle_ReturnValue) == 0x0001E8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0001EC, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F1, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_Time) == 0x0001F4, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_Distance) == 0x0001F8, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_Location) == 0x0001FC, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_ImpactPoint) == 0x000208, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_Normal) == 0x000214, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_ImpactNormal) == 0x000220, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_PhysMat) == 0x000230, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_HitActor) == 0x000238, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_HitComponent) == 0x000240, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_HitBoneName) == 0x000248, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_ElementIndex) == 0x000254, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_FaceIndex) == 0x000258, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_TraceStart) == 0x00025C, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, CallFunc_MakeTransform_ReturnValue_1) == 0x000280, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B0, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_ExecuteUbergraph_B_Athena_BuriedChest_Spawner_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.EQSFinished
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished) == 0x000008, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished) == 0x000010, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished, QueryInstance) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished::QueryInstance' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished, QueryStatus) == 0x000008, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_EQSFinished::QueryStatus' has a wrong offset!");

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.OnReady_15E7642D436E49800BF6F09D6BBB7637
// 0x0030 (0x0030 - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637) == 0x000008, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637) == 0x000030, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637, GameState) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637::GameState' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637, Playlist) == 0x000008, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637::Playlist' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637, PlaylistContextTags) == 0x000010, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_OnReady_15E7642D436E49800BF6F09D6BBB7637::PlaylistContextTags' has a wrong offset!");

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.UserConstructionScript
// 0x0034 (0x0034 - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript) == 0x000034, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000018, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000024, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.CheckForSpawnRate
// 0x001C (0x001C - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate) == 0x000004, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate) == 0x00001C, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, ReturnValue) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000018, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_CheckForSpawnRate::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function B_Athena_BuriedChest_Spawner_Parent.B_Athena_BuriedChest_Spawner_Parent_C.SpawnChest
// 0x0050 (0x0050 - 0x0000)
struct B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest) == 0x000010, "Wrong alignment on B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest");
static_assert(sizeof(B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest) == 0x000050, "Wrong size on B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest, Class_0) == 0x000000, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest::Class_0' has a wrong offset!");
static_assert(offsetof(B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest, SpawnTransform) == 0x000010, "Member 'B_Athena_BuriedChest_Spawner_Parent_C_SpawnChest::SpawnTransform' has a wrong offset!");
