#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PetrolWeapon

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_PetrolWeapon.B_PetrolWeapon_C.ExecuteUbergraph_B_PetrolWeapon
// 0x0240 (0x0240 - 0x0000)
struct B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x00A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddPreviousSource_ReturnValue;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility;    // 0x0140(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_1;  // 0x0148(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_IsTargeting;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_2;  // 0x0164(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_3;  // 0x016C(0x0008)(NoDestructor)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_4;  // 0x0174(0x0008)(NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ConstParm, ReferenceParm)
	struct FWeaponHudKeyActionVisibility          K2Node_MakeStruct_WeaponHudKeyActionVisibility_5;  // 0x0190(0x0008)(NoDestructor)
	TArray<struct FWeaponHudKeyActionVisibility>  K2Node_MakeArray_Array_2;                          // 0x0198(0x0010)(ConstParm, ReferenceParm)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon) == 0x000008, "Wrong alignment on B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon");
static_assert(sizeof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon) == 0x000240, "Wrong size on B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, EntryPoint) == 0x000000, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_K2_SetActorRelativeTransform_SweepHitResult) == 0x000004, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_K2_SetActorRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_HasAuthority_ReturnValue) == 0x00008D, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_HasAuthority_ReturnValue_1) == 0x00008E, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_HasAuthority_ReturnValue_2) == 0x00009C, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_MakeHitResult_ReturnValue) == 0x0000A0, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_Event_SpawnProjectile) == 0x000128, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_Event_SpawnProjectile' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_AddPreviousSource_ReturnValue) == 0x000130, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_AddPreviousSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000134, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_Event_bPersistentFire) == 0x000135, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_Event_bSecondaryFire) == 0x000136, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000138, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility) == 0x000140, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility_1) == 0x000148, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeArray_Array) == 0x000150, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_CustomEvent_IsTargeting) == 0x000160, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_CustomEvent_IsTargeting' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility_2) == 0x000164, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility_3) == 0x00016C, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility_3' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility_4) == 0x000174, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility_4' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeArray_Array_1) == 0x000180, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeStruct_WeaponHudKeyActionVisibility_5) == 0x000190, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeStruct_WeaponHudKeyActionVisibility_5' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_MakeArray_Array_2) == 0x000198, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_GetInstigator_ReturnValue) == 0x0001A8, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_DynamicCast_AsFort_Pawn) == 0x0001B0, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_CreateDelegate_OutputDelegate) == 0x0001BC, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001CC, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001DC, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_IsValid_ReturnValue_1) == 0x0001EC, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_GetInstigator_ReturnValue_1) == 0x0001F0, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_DynamicCast_AsFort_Pawn_1) == 0x0001F8, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, K2Node_CreateDelegate_OutputDelegate_3) == 0x000204, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_GetInstigator_ReturnValue_2) == 0x000218, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000220, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_GetInstigator_ReturnValue_3) == 0x000228, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000230, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_IsValid_ReturnValue_2) == 0x000238, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon, CallFunc_IsValid_ReturnValue_3) == 0x000239, "Member 'B_PetrolWeapon_C_ExecuteUbergraph_B_PetrolWeapon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function B_PetrolWeapon.B_PetrolWeapon_C.HUDKeyAction_Targeting
// 0x0001 (0x0001 - 0x0000)
struct B_PetrolWeapon_C_HUDKeyAction_Targeting final
{
public:
	bool                                          IsTargeting;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_PetrolWeapon_C_HUDKeyAction_Targeting) == 0x000001, "Wrong alignment on B_PetrolWeapon_C_HUDKeyAction_Targeting");
static_assert(sizeof(B_PetrolWeapon_C_HUDKeyAction_Targeting) == 0x000001, "Wrong size on B_PetrolWeapon_C_HUDKeyAction_Targeting");
static_assert(offsetof(B_PetrolWeapon_C_HUDKeyAction_Targeting, IsTargeting) == 0x000000, "Member 'B_PetrolWeapon_C_HUDKeyAction_Targeting::IsTargeting' has a wrong offset!");

// Function B_PetrolWeapon.B_PetrolWeapon_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_PetrolWeapon_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_PetrolWeapon_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_PetrolWeapon_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_PetrolWeapon_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_PetrolWeapon_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_PetrolWeapon_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_PetrolWeapon_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_PetrolWeapon_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_PetrolWeapon_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_PetrolWeapon.B_PetrolWeapon_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_PetrolWeapon_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_PetrolWeapon_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_PetrolWeapon_C_OnSpawnProjectile");
static_assert(sizeof(B_PetrolWeapon_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_PetrolWeapon_C_OnSpawnProjectile");
static_assert(offsetof(B_PetrolWeapon_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_PetrolWeapon_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

}

