#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Generic_Athena_Deprecated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_Generic_Athena_Deprecated.B_Ranged_Generic_Athena_Deprecated_C.ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated
// 0x0AF0 (0x0AF0 - 0x0000)
struct B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseFirstPersonTargeting_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MathExpression_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortAIPawn*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_Enable_Or_Disable;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_StencilBufferValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAlterationItemDefinition*          K2Node_Event_NewAlteration;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0070(0x0608)()
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_1;                // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_2;                // 0x067B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue_3;                // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeToNextFire_ReturnValue;            // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0690(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue;            // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69A[0x2];                                      // 0x069A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x069C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DA[0x2];                                      // 0x06DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit_1;                  // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit;                    // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingFirstPersonCamera_ReturnValue;     // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue; // 0x070D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x070E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70F[0x1];                                      // 0x070F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWindManager*                       CallFunc_GetWindManager_ReturnValue;               // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetADSTransitionInTime_ReturnValue;       // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0734(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_1;          // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_782[0x6];                                      // 0x0782(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_1; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_3;                  // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_4;                  // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_2; // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2[0x2];                                      // 0x07F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x07F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0800(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x080C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x081C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_2;          // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bVisible;                             // 0x082D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x082E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82F[0x1];                                      // 0x082F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0841(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_842[0x2];                                      // 0x0842(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue_1;     // 0x0844(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x084A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsTargeting_ReturnValue_1;             // 0x084B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetWeaponDataSmallPreviewImage_ReturnValue; // 0x0850(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayPersistentFireFX_ReturnValue;   // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetOrLoadSynchronously_ReturnValue;       // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetBeamPSC_ReturnValue;                   // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseBeamParticles_ReturnValue;          // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_2;            // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_SetBeamParticleSystem_ReturnValue;        // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_3;            // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D9[0x3];                                      // 0x08D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x08DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x08EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            CallFunc_Array_Get_Item;                           // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0911(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_912[0x2];                                      // 0x0912(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x091A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91B[0x5];                                      // 0x091B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0920(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0950(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0980(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x098C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0998(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x09A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x09B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x09BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x09E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x09F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0A04(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0A10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0A18(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0A24(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0AAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB1[0x3];                                      // 0x0AB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0AC0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0ACC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0AD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0AD4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0AE0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0AED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated) == 0x000010, "Wrong alignment on B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated");
static_assert(sizeof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated) == 0x000AF0, "Wrong size on B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, EntryPoint) == 0x000000, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetPI_ReturnValue) == 0x000004, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_UseFirstPersonTargeting_ReturnValue) == 0x00000C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_UseFirstPersonTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, Temp_int_Array_Index_Variable) == 0x000014, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000019, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_bPersistentFire) == 0x00001A, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_bSecondaryFire) == 0x00001B, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_ReloadStage) == 0x00001C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_MathExpression_ReturnValue) == 0x000024, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_MathExpression_ReturnValue_1) == 0x000028, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_bNewIsTargeting) == 0x000029, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue) == 0x00002A, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SetHiddenInGameControllerOnly_ReturnValue) == 0x00002B, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SetHiddenInGameControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1) == 0x00002C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_Enable_Or_Disable) == 0x000040, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_Enable_Or_Disable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_StencilBufferValue) == 0x000044, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_StencilBufferValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000058, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000060, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_NewAlteration) == 0x000068, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_NewAlteration' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_Event_CosmeticMod) == 0x000070, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsAssetNull_ReturnValue) == 0x000678, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsAssetNull_ReturnValue_1) == 0x000679, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsAssetNull_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_Not_PreBool_ReturnValue) == 0x00067A, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsAssetNull_ReturnValue_2) == 0x00067B, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsAssetNull_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsAssetNull_ReturnValue_3) == 0x00067C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsAssetNull_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetTimeToNextFire_ReturnValue) == 0x000680, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetTimeToNextFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000684, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000688, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00068C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_K2_SetTimer_ReturnValue) == 0x000690, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_UseScopeTargeting_ReturnValue) == 0x000698, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_UseScopeTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsValid_ReturnValue) == 0x000699, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetSocketLocation_ReturnValue) == 0x00069C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0006A8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, Temp_object_Variable) == 0x0006B0, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetInstigator_ReturnValue) == 0x0006B8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_AsParticle_System) == 0x0006C0, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_bSuccess) == 0x0006C8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_AsFort_Pawn) == 0x0006D0, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_bSuccess_1) == 0x0006D8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_Enable_1) == 0x0006D9, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_TargetLimit_1) == 0x0006DC, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_TargetLimit_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0006E0, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SelectInt_ReturnValue) == 0x0006E8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0006F0, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_Loaded) == 0x0006F8, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_Enable) == 0x000700, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CustomEvent_TargetLimit) == 0x000704, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CustomEvent_TargetLimit' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_SelectInt_ReturnValue_1) == 0x000708, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsUsingFirstPersonCamera_ReturnValue) == 0x00070C, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsUsingFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue) == 0x00070D, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_Not_PreBool_ReturnValue_1) == 0x00070E, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetInstigatorController_ReturnValue) == 0x000710, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000718, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_bSuccess_2) == 0x000720, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetWindManager_ReturnValue) == 0x000728, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetWindManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetADSTransitionInTime_ReturnValue) == 0x000730, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetADSTransitionInTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_CreateDelegate_OutputDelegate_1) == 0x000734, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetInstigator_ReturnValue_1) == 0x000748, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, Temp_object_Variable_1) == 0x000750, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000758, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_bSuccess_3) == 0x000760, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_AsParticle_System_1) == 0x000768, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_AsParticle_System_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, K2Node_DynamicCast_bSuccess_4) == 0x000770, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000778, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_UseScopeTargeting_ReturnValue_1) == 0x000780, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_UseScopeTargeting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_IsValid_ReturnValue_1) == 0x000781, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, CallFunc_GetInstigator_ReturnValue_2) == 0x000788, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated, Temp_int_Loop_Counter_Variable) == 0x000790, "Member 'B_Ranged_Generic_Athena_Deprecated_C_ExecuteUbergraph_B_Ranged_Generic_Athena_Deprecated::Temp_int_Loop_Counter_Variable' has a wrong offset!");
