#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusBoundActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusBoundActionButton.BacchusBoundActionButton_C
// 0x0020 (0x0C48 - 0x0C28)
class UBacchusBoundActionButton_C final : public UBacchusBoundActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       FortMobileImageInputAction;                        // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BacchusBoundActionButton(int32 EntryPoint);
	void Construct();
	void OnUpdateInputAction();
	void UpdateInputActionIconSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusBoundActionButton_C">();
	}
	static class UBacchusBoundActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusBoundActionButton_C>();
	}
};
static_assert(alignof(UBacchusBoundActionButton_C) == 0x000008, "Wrong alignment on UBacchusBoundActionButton_C");
static_assert(sizeof(UBacchusBoundActionButton_C) == 0x000C48, "Wrong size on UBacchusBoundActionButton_C");
static_assert(offsetof(UBacchusBoundActionButton_C, UberGraphFrame) == 0x000C28, "Member 'UBacchusBoundActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusBoundActionButton_C, ContentBorder) == 0x000C30, "Member 'UBacchusBoundActionButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UBacchusBoundActionButton_C, FortMobileImageInputAction) == 0x000C38, "Member 'UBacchusBoundActionButton_C::FortMobileImageInputAction' has a wrong offset!");
static_assert(offsetof(UBacchusBoundActionButton_C, InputActionIconScale) == 0x000C40, "Member 'UBacchusBoundActionButton_C::InputActionIconScale' has a wrong offset!");

}

