#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusItemShopCreatorButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusItemShopCreatorButton.BacchusItemShopCreatorButton_C
// 0x0028 (0x0CF0 - 0x0CC8)
class UBacchusItemShopCreatorButton_C final : public UFortTextButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0CD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Arrow;                                         // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipArrow;                                        // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIsTop;                                            // 0x0CE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BacchusItemShopCreatorButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusItemShopCreatorButton_C">();
	}
	static class UBacchusItemShopCreatorButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusItemShopCreatorButton_C>();
	}
};
static_assert(alignof(UBacchusItemShopCreatorButton_C) == 0x000008, "Wrong alignment on UBacchusItemShopCreatorButton_C");
static_assert(sizeof(UBacchusItemShopCreatorButton_C) == 0x000CF0, "Wrong size on UBacchusItemShopCreatorButton_C");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, UberGraphFrame) == 0x000CC8, "Member 'UBacchusItemShopCreatorButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Hover) == 0x000CD0, "Member 'UBacchusItemShopCreatorButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, Backing) == 0x000CD8, "Member 'UBacchusItemShopCreatorButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, IMG_Arrow) == 0x000CE0, "Member 'UBacchusItemShopCreatorButton_C::IMG_Arrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bFlipArrow) == 0x000CE8, "Member 'UBacchusItemShopCreatorButton_C::bFlipArrow' has a wrong offset!");
static_assert(offsetof(UBacchusItemShopCreatorButton_C, bIsTop) == 0x000CE9, "Member 'UBacchusItemShopCreatorButton_C::bIsTop' has a wrong offset!");

}

