#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSidewaysPlayspaceReplicatedState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BaseSidewaysPlayspaceReplicatedState.BaseSidewaysPlayspaceReplicatedState_C
// 0x0020 (0x0248 - 0x0228)
class ABaseSidewaysPlayspaceReplicatedState_C : public AFortPlayspaceReplicatedState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActorComponent_ReplicatedParamHelper*  RepParamHelper;                                    // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugRelevancyRange;                              // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLocalPlayerInPlayspace;                           // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BaseSidewaysPlayspaceReplicatedState(int32 EntryPoint);
	void CheckForLocalPlayer();
	void CustomEvent_0();
	void ReceiveBeginPlay();
	void HandleLocalPlayerEnteredPlayspace();
	void HandleLocalPlayerExitedPlayspace();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseSidewaysPlayspaceReplicatedState_C">();
	}
	static class ABaseSidewaysPlayspaceReplicatedState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseSidewaysPlayspaceReplicatedState_C>();
	}
};
static_assert(alignof(ABaseSidewaysPlayspaceReplicatedState_C) == 0x000008, "Wrong alignment on ABaseSidewaysPlayspaceReplicatedState_C");
static_assert(sizeof(ABaseSidewaysPlayspaceReplicatedState_C) == 0x000248, "Wrong size on ABaseSidewaysPlayspaceReplicatedState_C");
static_assert(offsetof(ABaseSidewaysPlayspaceReplicatedState_C, UberGraphFrame) == 0x000228, "Member 'ABaseSidewaysPlayspaceReplicatedState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABaseSidewaysPlayspaceReplicatedState_C, RepParamHelper) == 0x000230, "Member 'ABaseSidewaysPlayspaceReplicatedState_C::RepParamHelper' has a wrong offset!");
static_assert(offsetof(ABaseSidewaysPlayspaceReplicatedState_C, DefaultSceneRoot) == 0x000238, "Member 'ABaseSidewaysPlayspaceReplicatedState_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABaseSidewaysPlayspaceReplicatedState_C, bDebugRelevancyRange) == 0x000240, "Member 'ABaseSidewaysPlayspaceReplicatedState_C::bDebugRelevancyRange' has a wrong offset!");
static_assert(offsetof(ABaseSidewaysPlayspaceReplicatedState_C, bLocalPlayerInPlayspace) == 0x000241, "Member 'ABaseSidewaysPlayspaceReplicatedState_C::bLocalPlayerInPlayspace' has a wrong offset!");

}

