#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSidewaysPlayspaceEncounterComponent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BaseSidewaysPlayspaceEncounterComponent.BaseSidewaysPlayspaceEncounterComponent_C.RefreshActorsInVolume
// 0x0018 (0x0018 - 0x0000)
struct BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASidewaysPlayspace*                     K2Node_DynamicCast_AsSideways_Playspace;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume) == 0x000008, "Wrong alignment on BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume");
static_assert(sizeof(BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume) == 0x000018, "Wrong size on BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume, K2Node_DynamicCast_AsSideways_Playspace) == 0x000008, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume::K2Node_DynamicCast_AsSideways_Playspace' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_RefreshActorsInVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BaseSidewaysPlayspaceEncounterComponent.BaseSidewaysPlayspaceEncounterComponent_C.SetRepParamFloat
// 0x0040 (0x0040 - 0x0000)
struct BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat final
{
public:
	struct FGameplayTag                           ParamTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Modified;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayspace*                         K2Node_DynamicCast_AsFort_Playspace;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayspaceReplicatedState*          CallFunc_GetReplicatedState_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent_ReplicatedParamHelper*  CallFunc_GetReplicatedParamHelper_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendParamAsFloat_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat) == 0x000008, "Wrong alignment on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat");
static_assert(sizeof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat) == 0x000040, "Wrong size on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, ParamTag) == 0x000000, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::ParamTag' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, Value) == 0x000008, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::Value' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, Modified) == 0x00000C, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::Modified' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, K2Node_DynamicCast_AsFort_Playspace) == 0x000018, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::K2Node_DynamicCast_AsFort_Playspace' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_GetReplicatedState_ReturnValue) == 0x000028, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_GetReplicatedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_GetReplicatedParamHelper_ReturnValue) == 0x000030, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_GetReplicatedParamHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_SendParamAsFloat_ReturnValue) == 0x000039, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_SendParamAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamFloat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BaseSidewaysPlayspaceEncounterComponent.BaseSidewaysPlayspaceEncounterComponent_C.SetRepParamInt
// 0x0040 (0x0040 - 0x0000)
struct BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt final
{
public:
	struct FGameplayTag                           ParamTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Modified;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayspace*                         K2Node_DynamicCast_AsFort_Playspace;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayspaceReplicatedState*          CallFunc_GetReplicatedState_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent_ReplicatedParamHelper*  CallFunc_GetReplicatedParamHelper_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendParamAsInt_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt) == 0x000008, "Wrong alignment on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt");
static_assert(sizeof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt) == 0x000040, "Wrong size on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, ParamTag) == 0x000000, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::ParamTag' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, Value) == 0x000008, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::Value' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, Modified) == 0x00000C, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::Modified' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, K2Node_DynamicCast_AsFort_Playspace) == 0x000018, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::K2Node_DynamicCast_AsFort_Playspace' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_GetReplicatedState_ReturnValue) == 0x000028, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_GetReplicatedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_GetReplicatedParamHelper_ReturnValue) == 0x000030, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_GetReplicatedParamHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_SendParamAsInt_ReturnValue) == 0x000039, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_SendParamAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamInt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BaseSidewaysPlayspaceEncounterComponent.BaseSidewaysPlayspaceEncounterComponent_C.SetRepParamBool
// 0x0040 (0x0040 - 0x0000)
struct BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool final
{
public:
	struct FGameplayTag                           ParamTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Modified;                                          // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayspace*                         K2Node_DynamicCast_AsFort_Playspace;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayspaceReplicatedState*          CallFunc_GetReplicatedState_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent_ReplicatedParamHelper*  CallFunc_GetReplicatedParamHelper_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendParamAsBool_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool) == 0x000008, "Wrong alignment on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool");
static_assert(sizeof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool) == 0x000040, "Wrong size on BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, ParamTag) == 0x000000, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::ParamTag' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, Value) == 0x000008, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::Value' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, Modified) == 0x000009, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::Modified' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, K2Node_DynamicCast_AsFort_Playspace) == 0x000018, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::K2Node_DynamicCast_AsFort_Playspace' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_GetReplicatedState_ReturnValue) == 0x000028, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_GetReplicatedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_GetReplicatedParamHelper_ReturnValue) == 0x000030, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_GetReplicatedParamHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_SendParamAsBool_ReturnValue) == 0x000039, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_SendParamAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_SetRepParamBool::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BaseSidewaysPlayspaceEncounterComponent.BaseSidewaysPlayspaceEncounterComponent_C.EnableTrackingRadius
// 0x0098 (0x0098 - 0x0000)
struct BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CircleColor;                                       // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorTarget;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x0020(0x0010)(ReferenceParm)
	class UFortGameStateComponent_RadiusTracker*  CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRadiusTrackingInitializer             CallFunc_MakeRadiusTrackingInitializer_ReturnValue; // 0x0038(0x0058)()
	struct FRadiusTrackingGroupKey                CallFunc_AddActorTrackingInfo_ReturnValue;         // 0x0090(0x0004)(NoDestructor)
};
static_assert(alignof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius) == 0x000008, "Wrong alignment on BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius");
static_assert(sizeof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius) == 0x000098, "Wrong size on BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, Radius) == 0x000000, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::Radius' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, CircleColor) == 0x000004, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::CircleColor' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, ActorTarget) == 0x000018, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::ActorTarget' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x000020, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue) == 0x000030, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, CallFunc_MakeRadiusTrackingInitializer_ReturnValue) == 0x000038, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::CallFunc_MakeRadiusTrackingInitializer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius, CallFunc_AddActorTrackingInfo_ReturnValue) == 0x000090, "Member 'BaseSidewaysPlayspaceEncounterComponent_C_EnableTrackingRadius::CallFunc_AddActorTrackingInfo_ReturnValue' has a wrong offset!");

}

