#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseConfirmationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPurchaseConfirmationButton.BattlePassPurchaseConfirmationButton_C
// 0x0068 (0x0CA0 - 0x0C38)
class UBattlePassPurchaseConfirmationButton_C final : public UBattlePassPurchaseConfirmationButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TextBounce;                                        // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ResetTrianglesANim;                                // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverTrianglesAnim;                                // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GlowBurst;                                         // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopingButtonGlow;                                 // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingHoverLift;                                  // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverTriangles;                                    // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuck;                                             // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBundle;                                          // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_C99[0x3];                                      // 0x0C99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayCycle;                                        // 0x0C9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePassPurchaseConfirmationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPurchaseConfirmationButton_C">();
	}
	static class UBattlePassPurchaseConfirmationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseConfirmationButton_C>();
	}
};
static_assert(alignof(UBattlePassPurchaseConfirmationButton_C) == 0x000008, "Wrong alignment on UBattlePassPurchaseConfirmationButton_C");
static_assert(sizeof(UBattlePassPurchaseConfirmationButton_C) == 0x000CA0, "Wrong size on UBattlePassPurchaseConfirmationButton_C");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, UberGraphFrame) == 0x000C38, "Member 'UBattlePassPurchaseConfirmationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, TextBounce) == 0x000C40, "Member 'UBattlePassPurchaseConfirmationButton_C::TextBounce' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, ResetTrianglesANim) == 0x000C48, "Member 'UBattlePassPurchaseConfirmationButton_C::ResetTrianglesANim' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, HoverTrianglesAnim) == 0x000C50, "Member 'UBattlePassPurchaseConfirmationButton_C::HoverTrianglesAnim' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, GlowBurst) == 0x000C58, "Member 'UBattlePassPurchaseConfirmationButton_C::GlowBurst' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, LoopingButtonGlow) == 0x000C60, "Member 'UBattlePassPurchaseConfirmationButton_C::LoopingButtonGlow' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, Selected) == 0x000C68, "Member 'UBattlePassPurchaseConfirmationButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, Backing) == 0x000C70, "Member 'UBattlePassPurchaseConfirmationButton_C::Backing' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, BackingHoverLift) == 0x000C78, "Member 'UBattlePassPurchaseConfirmationButton_C::BackingHoverLift' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, ButtonBacking) == 0x000C80, "Member 'UBattlePassPurchaseConfirmationButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, HoverTriangles) == 0x000C88, "Member 'UBattlePassPurchaseConfirmationButton_C::HoverTriangles' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, VBuck) == 0x000C90, "Member 'UBattlePassPurchaseConfirmationButton_C::VBuck' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, IsBundle) == 0x000C98, "Member 'UBattlePassPurchaseConfirmationButton_C::IsBundle' has a wrong offset!");
static_assert(offsetof(UBattlePassPurchaseConfirmationButton_C, DelayCycle) == 0x000C9C, "Member 'UBattlePassPurchaseConfirmationButton_C::DelayCycle' has a wrong offset!");

}

