#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_Grabber

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SidewaysEncounter_Grabber.BGA_Athena_SidewaysEncounter_Grabber_C.ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber
// 0x0178 (0x0178 - 0x0000)
struct BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmallSidewaysPlayspaceEncounterComponent_C* CallFunc_GetSidewaysEncounterComponent_EncounterComponent; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_2;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber) == 0x000178, "Wrong size on BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, EntryPoint) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_Lerp_ReturnValue) == 0x00001C, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000020, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000028, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000030, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000038, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000040, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000D0, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_Array_AddUnique_ReturnValue) == 0x0000DC, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0000E0, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000E8, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F0, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherComp) == 0x0000F8, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000100, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x000104, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000108, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_Array_RemoveItem_ReturnValue) == 0x000111, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetParentActor_ReturnValue) == 0x000118, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small) == 0x000120, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetSidewaysEncounterComponent_EncounterComponent) == 0x000130, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetSidewaysEncounterComponent_EncounterComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_IsServer_ReturnValue) == 0x000138, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetParentActor_ReturnValue_1) == 0x000140, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_1) == 0x000148, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_3) == 0x000150, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_RowToBool_ReturnValue) == 0x000151, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_RowToBool_ReturnValue_1) == 0x000152, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_RowToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetParentActor_ReturnValue_2) == 0x000158, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetParentActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_2) == 0x000160, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_4) == 0x000168, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_GetValueAtLevel_ReturnValue) == 0x00016C, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_Grabber::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_Grabber.BGA_Athena_SidewaysEncounter_Grabber_C.BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_Grabber.BGA_Athena_SidewaysEncounter_Grabber_C.BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_BndEvt__GrabberRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_Grabber.BGA_Athena_SidewaysEncounter_Grabber_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript) == 0x000001, "Wrong alignment on BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript) == 0x000002, "Wrong size on BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BGA_Athena_SidewaysEncounter_Grabber_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

