#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_Lock_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Enum_Athena_Lock_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.ExecuteUbergraph_BGA_Athena_Lock_Parent
// 0x02E0 (0x02E0 - 0x0000)
struct BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVault_Door_C*                          K2Node_DynamicCast_AsVault_Door;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllLocksUnlocked_AllUnlocked;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Athena_Lock                              K2Node_CustomEvent_LockState;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_InteractingPawn;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllLocksUnlocked_AllUnlocked_1;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0060(0x0020)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LockCheck_CheckPassed;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LockCheck_CheckPassed_1;                  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              Temp_byte_Variable_1;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              Temp_byte_Variable_2;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue_1;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Athena_Lock                              Temp_byte_Variable_3;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              Temp_byte_Variable_4;                              // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CloseActor_ReturnValue;                   // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0150(0x0020)()
	class ABuildingContainer*                     K2Node_DynamicCast_AsBuilding_Container;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_SpawnLoot_ReturnValue;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Athena_Lock                              Temp_byte_Variable_5;                              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Athena_Lock                              K2Node_Select_Default;                             // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenActor_ReturnValue;                    // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformLinkingCheck_ReturnValue;          // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0228(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_Lock_Parent_C*              K2Node_DynamicCast_AsBGA_Athena_Lock_Parent;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0268(0x0020)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_1;    // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x02A0(0x0020)()
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive_1; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted_1; // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_2;                           // 0x02C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVault_Door_C*                          K2Node_DynamicCast_AsVault_Door_1;                 // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent) == 0x0002E0, "Wrong size on BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, EntryPoint) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsVault_Door) == 0x000008, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsVault_Door' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_AllLocksUnlocked_AllUnlocked) == 0x000011, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_AllLocksUnlocked_AllUnlocked' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_Event_InteractingPawn) == 0x000018, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_Event_InteractionBeingAttempted) == 0x000020, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_LockState) == 0x000035, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_LockState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_InteractingPawn_1) == 0x000038, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_InteractingPawn_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_InteractingPawn) == 0x000040, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_AllLocksUnlocked_AllUnlocked_1) == 0x000048, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_AllLocksUnlocked_AllUnlocked_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_GameState) == 0x000050, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_Playlist) == 0x000058, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_PlaylistContextTags) == 0x000060, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_struct_Variable) == 0x000090, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000098, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable) == 0x0000A0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A4, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_LockCheck_CheckPassed) == 0x0000B4, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_LockCheck_CheckPassed' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_LockCheck_CheckPassed_1) == 0x0000B5, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_LockCheck_CheckPassed_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValid_ReturnValue) == 0x0000B6, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetQuestManager_ReturnValue) == 0x0000C8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D4, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0000E8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValidClass_ReturnValue) == 0x0000F0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValid_ReturnValue_3) == 0x0000F1, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0000F8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000100, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_struct_Variable_1) == 0x000108, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable_1) == 0x000110, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable_2) == 0x000111, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000114, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000118, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_RowToBool_ReturnValue) == 0x000120, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_RowToBool_ReturnValue_1) == 0x000121, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_RowToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_int_Array_Index_Variable) == 0x000124, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetParentActor_ReturnValue) == 0x000128, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsBuilding_Actor) == 0x000130, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable_3) == 0x000139, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable_4) == 0x00013A, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_CloseActor_ReturnValue) == 0x00013B, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_CloseActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x000140, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000150, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsBuilding_Container) == 0x000170, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsBuilding_Container' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000178, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_BP_SpawnLoot_ReturnValue) == 0x000179, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_BP_SpawnLoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000180, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess_3) == 0x000188, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_byte_Variable_5) == 0x000189, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_Select_Default) == 0x00018A, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_OpenActor_ReturnValue) == 0x00018B, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_OpenActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000190, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetQuestManager_ReturnValue_1) == 0x000198, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsServer_ReturnValue) == 0x0001A0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0001A1, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0001A2, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_int_Loop_Counter_Variable) == 0x0001A4, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x0001A8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_PerformLinkingCheck_ReturnValue) == 0x0001AC, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_PerformLinkingCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_DamagedActor) == 0x0001B0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_Damage) == 0x0001B8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_InstigatedBy) == 0x0001C0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_DamageCauser) == 0x0001C8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_HitLocation) == 0x0001D0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_FHitComponent) == 0x0001E0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_BoneName) == 0x0001E8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_CustomEvent_Momentum) == 0x0001F0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000200, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_Select_Default_1) == 0x000208, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_IsValid_ReturnValue_4) == 0x000210, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000211, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000212, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_object_Variable) == 0x000218, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetParentActor_ReturnValue_1) == 0x000220, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000228, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_Array_Get_Item) == 0x000238, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetObjectClass_ReturnValue) == 0x000240, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsBGA_Athena_Lock_Parent) == 0x000248, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsBGA_Athena_Lock_Parent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess_4) == 0x000250, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_ClassIsChildOf_ReturnValue) == 0x000251, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000252, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_Array_Length_ReturnValue) == 0x000254, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_BooleanOR_ReturnValue) == 0x000258, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_Less_IntInt_ReturnValue) == 0x000259, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_object_Variable_1) == 0x000260, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, Temp_struct_Variable_2) == 0x000268, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_Array_AddUnique_ReturnValue) == 0x000288, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetOwnedGameplayTags_self_CastInput_1) == 0x000290, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetOwnedGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_GetOwnedGameplayTags_TagContainer_1) == 0x0002A0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_GetOwnedGameplayTags_TagContainer_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestActive_1) == 0x0002C0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestActive_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, CallFunc_SendComplexCustomStatEvent_QuestCompleted_1) == 0x0002C1, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::CallFunc_SendComplexCustomStatEvent_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_Select_Default_2) == 0x0002C4, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_AsVault_Door_1) == 0x0002D0, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_AsVault_Door_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent, K2Node_DynamicCast_bSuccess_5) == 0x0002D8, "Member 'BGA_Athena_Lock_Parent_C_ExecuteUbergraph_BGA_Athena_Lock_Parent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.ParentActorDied
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_Lock_Parent_C_ParentActorDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_ParentActorDied) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_ParentActorDied");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_ParentActorDied) == 0x000050, "Wrong size on BGA_Athena_Lock_Parent_C_ParentActorDied");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, DamagedActor) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, Damage) == 0x000008, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, InstigatedBy) == 0x000010, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, DamageCauser) == 0x000018, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, HitLocation) == 0x000020, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, FHitComponent) == 0x000030, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, BoneName) == 0x000038, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_ParentActorDied, Momentum) == 0x000040, "Member 'BGA_Athena_Lock_Parent_C_ParentActorDied::Momentum' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.OnSecondInteract
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Parent_C_OnSecondInteract final
{
public:
	class AFortPawn*                              InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_OnSecondInteract) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_OnSecondInteract");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_OnSecondInteract) == 0x000008, "Wrong size on BGA_Athena_Lock_Parent_C_OnSecondInteract");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_OnSecondInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_OnSecondInteract::InteractingPawn' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.OnFirstInteract
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_Lock_Parent_C_OnFirstInteract final
{
public:
	class AFortPawn*                              InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_OnFirstInteract) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_OnFirstInteract");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_OnFirstInteract) == 0x000008, "Wrong size on BGA_Athena_Lock_Parent_C_OnFirstInteract");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_OnFirstInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_OnFirstInteract::InteractingPawn' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.SetLock
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_Lock_Parent_C_SetLock final
{
public:
	Enum_Athena_Lock                              LockState_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_SetLock) == 0x000001, "Wrong alignment on BGA_Athena_Lock_Parent_C_SetLock");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_SetLock) == 0x000001, "Wrong size on BGA_Athena_Lock_Parent_C_SetLock");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_SetLock, LockState_0) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_SetLock::LockState_0' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct BGA_Athena_Lock_Parent_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_BlueprintOnInteract");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_BlueprintOnInteract) == 0x000010, "Wrong size on BGA_Athena_Lock_Parent_C_BlueprintOnInteract");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'BGA_Athena_Lock_Parent_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.OnReady_19560710434050E125B3ADA0163CD609
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609) == 0x000008, "Wrong alignment on BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609");
static_assert(sizeof(BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609) == 0x000030, "Wrong size on BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609, GameState) == 0x000000, "Member 'BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609, Playlist) == 0x000008, "Member 'BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_Lock_Parent_C_OnReady_19560710434050E125B3ADA0163CD609::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_Lock_Parent.BGA_Athena_Lock_Parent_C.OnRep_LockState
// 0x0004 (0x0004 - 0x0000)
struct BGA_Athena_Lock_Parent_C_OnRep_LockState final
{
public:
