#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_DirectionalLaunch_UFO

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BGA_DirectionalLaunch_UFO.BGA_DirectionalLaunch_UFO_C.UserConstructionScript
// 0x00AC (0x00AC - 0x0000)
struct BGA_DirectionalLaunch_UFO_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_DirectionalLaunch_UFO_C_UserConstructionScript");
static_assert(sizeof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript) == 0x0000AC, "Wrong size on BGA_DirectionalLaunch_UFO_C_UserConstructionScript");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000000, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x00000C, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000010, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000014, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_DirectionalLaunch_UFO_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000024, "Member 'BGA_DirectionalLaunch_UFO_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

