#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_BubbleSmall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SidewaysEncounter_BubbleSmall.BGA_Athena_SidewaysEncounter_BubbleSmall_C
// 0x00D0 (0x0988 - 0x08B8)
class ABGA_Athena_SidewaysEncounter_BubbleSmall_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BuildBlockingVolume;                               // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   PlayspaceGameplayVolume;                           // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EncounterEdge;                                     // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BuildingDestroyScale;                              // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_DamageBuilding;                                 // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BubbleVisible;                                     // 0x08F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           T_Pawn;                                            // 0x08F4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_Vehicle;                                        // 0x0900(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          BubbleEverScaled;                                  // 0x0920(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* Core;                                              // 0x0928(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BubbleCurrentScale;                                // 0x0930(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                PlayersInsideBubble;                               // 0x0938(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_EncounterCompleted;                             // 0x0948(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_WaveCompleted;                                  // 0x0968(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall(int32 EntryPoint);
	void HandleReplayScrubStart();
	void EncounterBeaten();
	void EncounterStageCompleted();
	void ReceiveBeginPlay();
	void BndEvt__BuildBlockingVolume_K2Node_ComponentBoundEvent_4_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BuildBlockingVolume_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PawnExitBubble(const struct FVector& EnterLocation);
	void VehicleExitBubble(const struct FVector& EnterLocation);
	void VehicleEnterBubble(const struct FVector& EnterLocation);
	void PawnEnterBubble(const struct FVector& EnterLocation);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ThingsHitBubble(const struct FHitResult& Hit, class AActor* OtherActor);
	void BndEvt__EncounterEdge_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void DestroyBuildingsFromTimer();
	void Destroy_Buildings(float EndScale, float ScaleDuration);
	void GetSidewaysPlayspace(class ASmallSidewaysPlayspace_C** Playspace);
	void OnRep_BubbleVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SidewaysEncounter_BubbleSmall_C">();
	}
	static class ABGA_Athena_SidewaysEncounter_BubbleSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SidewaysEncounter_BubbleSmall_C>();
	}
};
static_assert(alignof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C) == 0x000008, "Wrong alignment on ABGA_Athena_SidewaysEncounter_BubbleSmall_C");
static_assert(sizeof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C) == 0x000988, "Wrong size on ABGA_Athena_SidewaysEncounter_BubbleSmall_C");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, UberGraphFrame) == 0x0008B8, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, BuildBlockingVolume) == 0x0008C0, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::BuildBlockingVolume' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, PlayspaceGameplayVolume) == 0x0008C8, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::PlayspaceGameplayVolume' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, EncounterEdge) == 0x0008D0, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::EncounterEdge' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, DefaultSceneRoot) == 0x0008D8, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, BuildingDestroyScale) == 0x0008E0, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::BuildingDestroyScale' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, GE_DamageBuilding) == 0x0008E8, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::GE_DamageBuilding' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, BubbleVisible) == 0x0008F0, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::BubbleVisible' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, T_Pawn) == 0x0008F4, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::T_Pawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, TC_Vehicle) == 0x000900, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::TC_Vehicle' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, BubbleEverScaled) == 0x000920, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::BubbleEverScaled' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, Core) == 0x000928, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::Core' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, BubbleCurrentScale) == 0x000930, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::BubbleCurrentScale' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, PlayersInsideBubble) == 0x000938, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::PlayersInsideBubble' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, TC_EncounterCompleted) == 0x000948, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::TC_EncounterCompleted' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_BubbleSmall_C, TC_WaveCompleted) == 0x000968, "Member 'ABGA_Athena_SidewaysEncounter_BubbleSmall_C::TC_WaveCompleted' has a wrong offset!");

}

