#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_EnvCoreLarge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge
// 0x01A8 (0x01A8 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULargeSidewaysPlayspaceEncounterComponent_C* CallFunc_GetSidewaysEncounterComponent_EncounterComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_GameplayCueTag;                 // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USoundBase* Music)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_CustomEvent_Music_1;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0078(0x0020)()
	class USoundBase*                             K2Node_CustomEvent_Music;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameStateComponent_RadiusTracker*  CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetAllFortPlayerControllers_ReturnValue;  // 0x00A8(0x0010)(ReferenceParm)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00E0(0x0020)(ConstParm)
	bool                                          CallFunc_InEditorOrPIE_ReturnValue;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadiusTrackingInitializer             CallFunc_MakeRadiusTrackingInitializer_ReturnValue; // 0x0130(0x0058)()
	int32                                         Temp_int_Variable;                                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRadiusTrackingGroupKey                CallFunc_AddActorTrackingInfo_ReturnValue;         // 0x018C(0x0004)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSplitScreen_ReturnValue;                // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& GameplayCueTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge) == 0x0001A8, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, EntryPoint) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_GetSidewaysEncounterComponent_EncounterComponent) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_GetSidewaysEncounterComponent_EncounterComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_GameplayCueTag) == 0x000020, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_GameplayCueTag' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_IsServer_ReturnValue) == 0x000038, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000050, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, Temp_object_Variable) == 0x000058, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_Music_1) == 0x000068, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_Music_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, Temp_object_Variable_1) == 0x000070, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, Temp_struct_Variable) == 0x000078, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_Music) == 0x000098, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_Music' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue) == 0x0000A0, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_GetGameStateRadiusTrackerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_GetAllFortPlayerControllers_ReturnValue) == 0x0000A8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_GetAllFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000B8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000BC, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_IsServer_ReturnValue_1) == 0x0000C8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_GameState) == 0x0000D0, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_Playlist) == 0x0000D8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CustomEvent_PlaylistContextTags) == 0x0000E0, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_InEditorOrPIE_ReturnValue) == 0x000100, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_InEditorOrPIE_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_GetGameStateAthena_ReturnValue) == 0x000108, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CreateDelegate_OutputDelegate_3) == 0x000110, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000121, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000122, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_BooleanOR_ReturnValue) == 0x000123, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_BooleanOR_ReturnValue_1) == 0x000124, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_MakeRadiusTrackingInitializer_ReturnValue) == 0x000130, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_MakeRadiusTrackingInitializer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, Temp_int_Variable) == 0x000188, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_AddActorTrackingInfo_ReturnValue) == 0x00018C, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_AddActorTrackingInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_Greater_IntInt_ReturnValue) == 0x000190, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, CallFunc_IsSplitScreen_ReturnValue) == 0x000191, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::CallFunc_IsSplitScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge, K2Node_CreateDelegate_OutputDelegate_4) == 0x000194, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.UpdateLoopingAudioEvent
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent final
{
public:
	class USoundBase*                             Music;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent) == 0x000008, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent, Music) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudioEvent::Music' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.UpdateLoopingAudio
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio final
{
public:
	class USoundBase*                             Music;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio) == 0x000008, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio, Music) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_UpdateLoopingAudio::Music' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.SpawnCosmeticEvent
// 0x0008 (0x0008 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent) == 0x000004, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent) == 0x000008, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent, GameplayCueTag) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SpawnCosmeticEvent::GameplayCueTag' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.OnReady_AC9C4A62476C29503034598E57F01351
// 0x0030 (0x0030 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351) == 0x000030, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351, GameState) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351::GameState' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351, Playlist) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351::Playlist' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351, PlaylistContextTags) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_OnReady_AC9C4A62476C29503034598E57F01351::PlaylistContextTags' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.ShouldDie
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            EventInstigator;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie) == 0x000020, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie, Damage) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie, EventInstigator) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie::EventInstigator' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie, DamageCauser) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie, ReturnValue) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_ShouldDie::ReturnValue' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.GetSidewaysPlayspace
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace final
{
public:
	class ALargeSidewaysPlayspace_C*              Playspace;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_BubbleLarge_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALargeSidewaysPlayspace_C*              CallFunc_GetSidewaysPlayspace_Playspace;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace) == 0x000020, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace, Playspace) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace::Playspace' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace, CallFunc_GetSidewaysPlayspace_Playspace) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysPlayspace::CallFunc_GetSidewaysPlayspace_Playspace' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.GetSidewaysEncounterComponent
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent final
{
public:
	class ULargeSidewaysPlayspaceEncounterComponent_C* EncounterComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALargeSidewaysPlayspace_C*              CallFunc_GetSidewaysPlayspace_Playspace;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULargeSidewaysPlayspaceEncounterComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent) == 0x000020, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent, EncounterComponent) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent::EncounterComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent, CallFunc_GetSidewaysPlayspace_Playspace) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent::CallFunc_GetSidewaysPlayspace_Playspace' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_GetSidewaysEncounterComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.EnsureVisualRadiusIsInSteppedIncrements
// 0x0080 (0x0080 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements final
{
public:
	float                                         VisualRadius;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VisualRadiusInSteppedIncrements_0;                 // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Float_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Float_ReturnValue_1;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Float_ReturnValue_2;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Float_ReturnValue_3;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements) == 0x000080, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, VisualRadius) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::VisualRadius' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, VisualRadiusInSteppedIncrements_0) == 0x000004, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::VisualRadiusInSteppedIncrements_0' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_BuildString_Float_ReturnValue) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_BuildString_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_BuildString_Float_ReturnValue_1) == 0x000028, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_BuildString_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_BuildString_Float_ReturnValue_2) == 0x000040, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_BuildString_Float_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_Clamp_ReturnValue) == 0x000050, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000054, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_BuildString_Int_ReturnValue) == 0x000058, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements, CallFunc_BuildString_Float_ReturnValue_3) == 0x000070, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_EnsureVisualRadiusIsInSteppedIncrements::CallFunc_BuildString_Float_ReturnValue_3' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.SetupBubble
// 0x0110 (0x0110 - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SidewaysEncounter_BubbleLarge_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble) == 0x000110, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Bubble_Large' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000018, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_GetValueAtLevel_ReturnValue) == 0x000020, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000024, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000028, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_BreakVector_X) == 0x000034, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_BreakVector_Y) == 0x000038, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_BreakVector_Z) == 0x00003C, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_FMax_ReturnValue) == 0x00005C, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000060, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000E8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000EC, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_FMax_ReturnValue_1) == 0x0000F0, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_FMax_ReturnValue_2) == 0x0000F4, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_MakeVector_ReturnValue) == 0x0000FC, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000108, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetupBubble::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C.SetSkirtMeshes
// 0x008C (0x008C - 0x0000)
struct BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes final
{
public:
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes) == 0x000004, "Wrong alignment on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes) == 0x00008C, "Wrong size on BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BGA_Athena_SidewaysEncounter_EnvCoreLarge_C_SetSkirtMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
