#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_DirectionalLaunch_UFO

#include "Basic.hpp"

#include "BGA_DirectionalLaunchParent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_DirectionalLaunch_UFO.BGA_DirectionalLaunch_UFO_C
// 0x0018 (0x0A68 - 0x0A50)
class ABGA_DirectionalLaunch_UFO_C final : public ABGA_DirectionalLaunchParent_C
{
public:
	class UAudioComponent*                        AmbientAudio;                                      // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshTemp;                                          // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FlattenRotationOnMesh;                             // 0x0A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_DirectionalLaunch_UFO_C">();
	}
	static class ABGA_DirectionalLaunch_UFO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_DirectionalLaunch_UFO_C>();
	}
};
static_assert(alignof(ABGA_DirectionalLaunch_UFO_C) == 0x000008, "Wrong alignment on ABGA_DirectionalLaunch_UFO_C");
static_assert(sizeof(ABGA_DirectionalLaunch_UFO_C) == 0x000A68, "Wrong size on ABGA_DirectionalLaunch_UFO_C");
static_assert(offsetof(ABGA_DirectionalLaunch_UFO_C, AmbientAudio) == 0x000A50, "Member 'ABGA_DirectionalLaunch_UFO_C::AmbientAudio' has a wrong offset!");
static_assert(offsetof(ABGA_DirectionalLaunch_UFO_C, MeshTemp) == 0x000A58, "Member 'ABGA_DirectionalLaunch_UFO_C::MeshTemp' has a wrong offset!");
static_assert(offsetof(ABGA_DirectionalLaunch_UFO_C, FlattenRotationOnMesh) == 0x000A60, "Member 'ABGA_DirectionalLaunch_UFO_C::FlattenRotationOnMesh' has a wrong offset!");

}

