#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_BubbleSmall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SidewaysEncounter_BubbleSmall.BGA_Athena_SidewaysEncounter_BubbleSmall_C.ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall
// 0x05F0 (0x05F0 - 0x0000)
struct BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0034(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D0(0x0018)()
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_EnterLocation_3;                // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_EnterLocation_2;                // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x025C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue_1;          // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_EnterLocation_1;                // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_EnterLocation;                  // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x03B8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48B[0x5];                                      // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2; // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B3[0x1];                                      // 0x04B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3; // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3[0x1];                                      // 0x04E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_4;       // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0530(0x0010)(ZeroConstructor, NoDestructor)
	class UFortReplayContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_5;       // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x058B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item_1;                         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A3[0x5];                                      // 0x05A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue_1;            // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive_1; // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted_1; // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2[0x6];                                      // 0x05C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_1; // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_2;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_EnvCoreSmall_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Env_Core_Small_2; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall) == 0x000008, "Wrong alignment on BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall");
static_assert(sizeof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall) == 0x0005F0, "Wrong size on BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, EntryPoint) == 0x000000, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_Damage) == 0x000004, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_DamageTags) == 0x000008, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_Momentum) == 0x000028, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_HitInfo) == 0x000034, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_InstigatedBy) == 0x0000C0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_DamageCauser) == 0x0000C8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_Event_EffectContext) == 0x0000D0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_Hit) == 0x0000E8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_OtherActor) == 0x000170, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_bBlockingHit) == 0x000178, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_bInitialOverlap) == 0x000179, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Time) == 0x00017C, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Distance) == 0x000180, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Location) == 0x000184, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ImpactPoint) == 0x000190, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Normal) == 0x00019C, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitItem) == 0x0001D8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ElementIndex) == 0x0001DC, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_FaceIndex) == 0x0001E0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_TraceStart) == 0x0001E4, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_TraceEnd) == 0x0001F0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_EnterLocation_3) == 0x0001FC, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_EnterLocation_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000208, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000218, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000220, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_EnterLocation_2) == 0x000228, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_EnterLocation_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, Temp_bool_Variable) == 0x000234, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_HitComponent) == 0x000238, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000240, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000248, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000250, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_Hit) == 0x00025C, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002E4, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002E5, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Time_1) == 0x0002E8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Distance_1) == 0x0002EC, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Location_1) == 0x0002F0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002FC, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_Normal_1) == 0x000308, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000314, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_PhysMat_1) == 0x000320, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitActor_1) == 0x000328, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitComponent_1) == 0x000330, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitBoneName_1) == 0x000338, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_HitItem_1) == 0x000340, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_ElementIndex_1) == 0x000344, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_FaceIndex_1) == 0x000348, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_TraceStart_1) == 0x00034C, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_BreakHitResult_TraceEnd_1) == 0x000358, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000364, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000370, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_SpawnFXAtLocation_ReturnValue_1) == 0x000378, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_SpawnFXAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_EnterLocation_1) == 0x000380, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_EnterLocation_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_CustomEvent_EnterLocation) == 0x00038C, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_CustomEvent_EnterLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000398, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0003A0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0003A8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0003B0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_bFromSweep) == 0x0003B4, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_SweepResult) == 0x0003B8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000440, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherActor) == 0x000448, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherComp) == 0x000450, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000458, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000460, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess) == 0x000470, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000478, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess_1) == 0x000488, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000489, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x00048A, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2) == 0x000490, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess_2) == 0x0004A0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0004A8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess_3) == 0x0004B0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0004B1, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_IsValid_ReturnValue) == 0x0004B2, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004B4, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3) == 0x0004C0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess_4) == 0x0004D0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0004D8, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall, K2Node_DynamicCast_bSuccess_5) == 0x0004E0, "Member 'BGA_Athena_SidewaysEncounter_BubbleSmall_C_ExecuteUbergraph_BGA_Athena_SidewaysEncounter_BubbleSmall::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
