#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SidewaysEncounter_EnvCoreLarge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SidewaysEncounter_EnvCoreLarge.BGA_Athena_SidewaysEncounter_EnvCoreLarge_C
// 0x0110 (0x09C8 - 0x08B8)
class ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SkirtInner;                                        // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SkirtOuter;                                        // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sideways_Core_Ambient;                          // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SideWays_SurfaceSmoke;                          // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Sideways_SmokePillars;                          // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SideWays_Volume_InWorld;                        // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EncounterStageVolume;                              // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StingerAudio;                                      // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LoopingAudio;                                      // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EncounterBubble;                                   // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CoreMesh;                                          // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         BubbleVisualRadius_HF;                             // 0x0920(0x0028)(Edit, BlueprintVisible, Net)
	struct FScalableFloat                         BubbleVisualHalfHeight_HF;                         // 0x0948(0x0028)(Edit, BlueprintVisible, Net)
	struct FVector                                BubbleVisualOffset;                                // 0x0970(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                BubbleMeshAssetDimensions;                         // 0x097C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VisualRadiusInSteppedIncrements;                   // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CircleAddTime;                                     // 0x098C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_MapCircleAdd;                                // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PIECircleCounter;                                  // 0x0998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapCircleColor;                                    // 0x099C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SkirtInnerPublic;                                  // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UStaticMesh*                            SkirtOuterPublic;                                  // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_SidewaysEncounter_EnvCoreLarge(int32 EntryPoint);
	void StartAddingMapCircle();
	void AddMapCircle();
	void UpdateLoopingAudioEvent(class USoundBase* Music);
	void UpdateLoopingAudio(class USoundBase* Music);
	void SpawnCosmeticEvent(const struct FGameplayTag& GameplayCueTag);
	void KillEvent();
	void ReceiveBeginPlay();
	void HideAndKill();
	void OnReady_AC9C4A62476C29503034598E57F01351(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void UserConstructionScript();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void GetSidewaysPlayspace(class ALargeSidewaysPlayspace_C** Playspace);
	void GetSidewaysEncounterComponent(class ULargeSidewaysPlayspaceEncounterComponent_C** EncounterComponent);
	void EnsureVisualRadiusIsInSteppedIncrements(float VisualRadius, float* VisualRadiusInSteppedIncrements_0);
	void SetupBubble();
	void SetSkirtMeshes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SidewaysEncounter_EnvCoreLarge_C">();
	}
	static class ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C>();
	}
};
static_assert(alignof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C) == 0x000008, "Wrong alignment on ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C");
static_assert(sizeof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C) == 0x0009C8, "Wrong size on ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, UberGraphFrame) == 0x0008B8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SkirtInner) == 0x0008C0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SkirtInner' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SkirtOuter) == 0x0008C8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SkirtOuter' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, NS_Sideways_Core_Ambient) == 0x0008D0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::NS_Sideways_Core_Ambient' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, NS_SideWays_SurfaceSmoke) == 0x0008D8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::NS_SideWays_SurfaceSmoke' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SM_Sideways_SmokePillars) == 0x0008E0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SM_Sideways_SmokePillars' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, NS_SideWays_Volume_InWorld) == 0x0008E8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::NS_SideWays_Volume_InWorld' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, EncounterStageVolume) == 0x0008F0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::EncounterStageVolume' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, StingerAudio) == 0x0008F8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::StingerAudio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, LoopingAudio) == 0x000900, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::LoopingAudio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, EncounterBubble) == 0x000908, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::EncounterBubble' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, CoreMesh) == 0x000910, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::CoreMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, Root) == 0x000918, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::Root' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, BubbleVisualRadius_HF) == 0x000920, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::BubbleVisualRadius_HF' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, BubbleVisualHalfHeight_HF) == 0x000948, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::BubbleVisualHalfHeight_HF' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, BubbleVisualOffset) == 0x000970, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::BubbleVisualOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, BubbleMeshAssetDimensions) == 0x00097C, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::BubbleMeshAssetDimensions' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, VisualRadiusInSteppedIncrements) == 0x000988, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::VisualRadiusInSteppedIncrements' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, CircleAddTime) == 0x00098C, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::CircleAddTime' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, Timer_MapCircleAdd) == 0x000990, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::Timer_MapCircleAdd' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, PIECircleCounter) == 0x000998, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::PIECircleCounter' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, MapCircleColor) == 0x00099C, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::MapCircleColor' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SplineMeshComponent) == 0x0009B0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SkirtInnerPublic) == 0x0009B8, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SkirtInnerPublic' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C, SkirtOuterPublic) == 0x0009C0, "Member 'ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C::SkirtOuterPublic' has a wrong offset!");

}

