#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioScripting_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioScripting_Parent.BP_AudioScripting_Parent_C
// 0x0110 (0x0330 - 0x0220)
class ABP_AudioScripting_Parent_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SequenceTime;                                      // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          EnableAudioAnalysis_Default;                       // 0x0235(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableAudioAnalysis_VO_A;                          // 0x0236(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableAudioAnalysis_VO_B;                          // 0x0237(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableAudioAnalysis_Master;                        // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_A;                                 // 0x0240(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_B;                                 // 0x0288(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortSubmixAnalyzerData                AnalyzerData_VO_Master;                            // 0x02D0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DisableMasterCompressor;                           // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USubmixEffectDynamicsProcessorPreset*   Compressor;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              CurrentMix;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AudioScripting_Parent(int32 EntryPoint);
	void SetCurrentMix(class USoundMix* SetMix);
	void SetDisableMasterCompressor(bool DisableMasterCompressor_0);
	void SetInitialized(bool Initialized_0);
	void SetSequenceTime(float SequenceTime_0);
	void OnInitializedChanged(bool Initialized_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioScripting_Parent_C">();
	}
	static class ABP_AudioScripting_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AudioScripting_Parent_C>();
	}
};
static_assert(alignof(ABP_AudioScripting_Parent_C) == 0x000008, "Wrong alignment on ABP_AudioScripting_Parent_C");
static_assert(sizeof(ABP_AudioScripting_Parent_C) == 0x000330, "Wrong size on ABP_AudioScripting_Parent_C");
static_assert(offsetof(ABP_AudioScripting_Parent_C, UberGraphFrame) == 0x000220, "Member 'ABP_AudioScripting_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_AudioScripting_Parent_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, SequenceTime) == 0x000230, "Member 'ABP_AudioScripting_Parent_C::SequenceTime' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, Initialized) == 0x000234, "Member 'ABP_AudioScripting_Parent_C::Initialized' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_Default) == 0x000235, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_Default' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_VO_A) == 0x000236, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_VO_B) == 0x000237, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, EnableAudioAnalysis_Master) == 0x000238, "Member 'ABP_AudioScripting_Parent_C::EnableAudioAnalysis_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_A) == 0x000240, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_A' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_B) == 0x000288, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_B' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, AnalyzerData_VO_Master) == 0x0002D0, "Member 'ABP_AudioScripting_Parent_C::AnalyzerData_VO_Master' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, DisableMasterCompressor) == 0x000318, "Member 'ABP_AudioScripting_Parent_C::DisableMasterCompressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, Compressor) == 0x000320, "Member 'ABP_AudioScripting_Parent_C::Compressor' has a wrong offset!");
static_assert(offsetof(ABP_AudioScripting_Parent_C, CurrentMix) == 0x000328, "Member 'ABP_AudioScripting_Parent_C::CurrentMix' has a wrong offset!");

}

