#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioScripting_Coconut

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AudioScripting_Coconut.BP_AudioScripting_Coconut_C.ExecuteUbergraph_BP_AudioScripting_Coconut
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x0038(0x0010)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame;            // 0x004C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQualifiedFrameTime                    CallFunc_GetDuration_ReturnValue;                  // 0x007C(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame_1;          // 0x008C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame_1;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut) == 0x000008, "Wrong alignment on BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut");
static_assert(sizeof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut) == 0x0000B0, "Wrong size on BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, EntryPoint) == 0x000000, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_GetSequencePlayer_ReturnValue) == 0x000030, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_GetCurrentTime_ReturnValue) == 0x000038, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_Frame) == 0x00004C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_Frame' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_FrameRate) == 0x000050, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_FrameRate' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_SubFrame) == 0x000058, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_SubFrame' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_Less_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, K2Node_CustomEvent_TimeSpanRatio) == 0x000068, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, K2Node_Event_EndPlayReason) == 0x00006C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsValid_ReturnValue_2) == 0x00006D, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsPlaying_ReturnValue) == 0x00006E, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsDedicatedServer_ReturnValue) == 0x00006F, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000070, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_GetDuration_ReturnValue) == 0x00007C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_Frame_1) == 0x00008C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_Frame_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_FrameRate_1) == 0x000090, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_FrameRate_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_BreakQualifiedFrameTime_SubFrame_1) == 0x000098, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_BreakQualifiedFrameTime_SubFrame_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00009C, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'BP_AudioScripting_Coconut_C_ExecuteUbergraph_BP_AudioScripting_Coconut::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_AudioScripting_Coconut.BP_AudioScripting_Coconut_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AudioScripting_Coconut_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Coconut_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AudioScripting_Coconut_C_ReceiveEndPlay");
static_assert(sizeof(BP_AudioScripting_Coconut_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AudioScripting_Coconut_C_ReceiveEndPlay");
static_assert(offsetof(BP_AudioScripting_Coconut_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AudioScripting_Coconut_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AudioScripting_Coconut.BP_AudioScripting_Coconut_C.HandleChangeAudioParameter
// 0x0004 (0x0004 - 0x0000)
struct BP_AudioScripting_Coconut_C_HandleChangeAudioParameter final
{
public:
	float                                         TimespanRatio_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AudioScripting_Coconut_C_HandleChangeAudioParameter) == 0x000004, "Wrong alignment on BP_AudioScripting_Coconut_C_HandleChangeAudioParameter");
static_assert(sizeof(BP_AudioScripting_Coconut_C_HandleChangeAudioParameter) == 0x000004, "Wrong size on BP_AudioScripting_Coconut_C_HandleChangeAudioParameter");
static_assert(offsetof(BP_AudioScripting_Coconut_C_HandleChangeAudioParameter, TimespanRatio_0) == 0x000000, "Member 'BP_AudioScripting_Coconut_C_HandleChangeAudioParameter::TimespanRatio_0' has a wrong offset!");

}

