#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoconutShark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CoconutShark.BP_CoconutShark_C.ExecuteUbergraph_BP_CoconutShark
// 0x00A0 (0x00A0 - 0x0000)
struct BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AApollo_Waterbody_Ocean_Parent_C*       K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation; // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal; // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition; // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfoCallable_WaterDepth;   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark) == 0x000008, "Wrong alignment on BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark");
static_assert(sizeof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark) == 0x0000A0, "Wrong size on BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, EntryPoint) == 0x000000, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000021, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_IsDedicatedServer_ReturnValue) == 0x000022, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_K2_SetTimer_ReturnValue) == 0x000030, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent) == 0x000038, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000061, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, Temp_bool_Has_Been_Initd_Variable) == 0x000062, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_IsValid_ReturnValue_2) == 0x000063, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation) == 0x000064, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal) == 0x000070, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition) == 0x00007C, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterDepth) == 0x000088, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx) == 0x00008C, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark, CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity) == 0x000090, "Member 'BP_CoconutShark_C_ExecuteUbergraph_BP_CoconutShark::CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity' has a wrong offset!");

// Function BP_CoconutShark.BP_CoconutShark_C.Update Shark Pos
// 0x00E0 (0x00E0 - 0x0000)
struct BP_CoconutShark_C_Update_Shark_Pos final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CoconutShark_C_Update_Shark_Pos) == 0x000010, "Wrong alignment on BP_CoconutShark_C_Update_Shark_Pos");
static_assert(sizeof(BP_CoconutShark_C_Update_Shark_Pos) == 0x0000E0, "Wrong size on BP_CoconutShark_C_Update_Shark_Pos");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_GetSplineLength_ReturnValue) == 0x000008, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_Fraction_ReturnValue) == 0x00000C, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_Update_Shark_Pos, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000050, "Member 'BP_CoconutShark_C_Update_Shark_Pos::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_CoconutShark.BP_CoconutShark_C.GetWaterSurfaceInfoCallable
// 0x0090 (0x0090 - 0x0000)
struct BP_CoconutShark_C_GetWaterSurfaceInfoCallable final
{
public:
	class AFortWaterBodyActor*                    WaterBody_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneComponent;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneLocation;                                // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneNormal;                                  // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfacePosition;                              // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDepth;                                        // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterBodyIdx;                                      // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterVelocity;                                     // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation;   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable) == 0x000008, "Wrong alignment on BP_CoconutShark_C_GetWaterSurfaceInfoCallable");
static_assert(sizeof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable) == 0x000090, "Wrong size on BP_CoconutShark_C_GetWaterSurfaceInfoCallable");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterBody_0) == 0x000000, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterBody_0' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, SceneComponent) == 0x000008, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::SceneComponent' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterPlaneLocation) == 0x000010, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterPlaneNormal) == 0x00001C, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterSurfacePosition) == 0x000028, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterDepth) == 0x000034, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterBodyIdx) == 0x000038, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, WaterVelocity) == 0x00003C, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::WaterVelocity' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation) == 0x000054, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal) == 0x000060, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition) == 0x00006C, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterDepth) == 0x000078, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx) == 0x00007C, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_CoconutShark_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterVelocity) == 0x000080, "Member 'BP_CoconutShark_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterVelocity' has a wrong offset!");

}

