#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Coconut_Floater

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Coconut_Floater.BP_Coconut_Floater_C.ExecuteUbergraph_BP_Coconut_Floater
// 0x0168 (0x0168 - 0x0000)
struct BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AApollo_Waterbody_Ocean_Parent_C*       K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Coconut_DebrisManager_C*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation; // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal; // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition; // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfoCallable_WaterDepth;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity; // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DebrisSpeed;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater) == 0x000008, "Wrong alignment on BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater");
static_assert(sizeof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater) == 0x000168, "Wrong size on BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, EntryPoint) == 0x000000, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_SetStaticMesh_ReturnValue) == 0x000010, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000018, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent) == 0x000030, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation) == 0x00005C, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal) == 0x000068, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition) == 0x000074, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterDepth) == 0x000080, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx) == 0x000084, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity) == 0x000088, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000094, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, K2Node_Event_DeltaSeconds) == 0x00011C, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_RandomFloatInRange_ReturnValue) == 0x000120, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_IsValid_ReturnValue_2) == 0x000124, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000128, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, K2Node_CustomEvent_DebrisSpeed) == 0x000134, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::K2Node_CustomEvent_DebrisSpeed' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000138, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00013C, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_IsDedicatedServer_ReturnValue) == 0x000148, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_BreakVector_X) == 0x00014C, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_BreakVector_Y) == 0x000150, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_BreakVector_Z) == 0x000154, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater, CallFunc_MakeVector_ReturnValue) == 0x000158, "Member 'BP_Coconut_Floater_C_ExecuteUbergraph_BP_Coconut_Floater::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Coconut_Floater.BP_Coconut_Floater_C.SetDebrisSpeed
// 0x0004 (0x0004 - 0x0000)
struct BP_Coconut_Floater_C_SetDebrisSpeed final
{
public:
	float                                         DebrisSpeed;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_Floater_C_SetDebrisSpeed) == 0x000004, "Wrong alignment on BP_Coconut_Floater_C_SetDebrisSpeed");
static_assert(sizeof(BP_Coconut_Floater_C_SetDebrisSpeed) == 0x000004, "Wrong size on BP_Coconut_Floater_C_SetDebrisSpeed");
static_assert(offsetof(BP_Coconut_Floater_C_SetDebrisSpeed, DebrisSpeed) == 0x000000, "Member 'BP_Coconut_Floater_C_SetDebrisSpeed::DebrisSpeed' has a wrong offset!");

// Function BP_Coconut_Floater.BP_Coconut_Floater_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Coconut_Floater_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_Floater_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Coconut_Floater_C_ReceiveTick");
static_assert(sizeof(BP_Coconut_Floater_C_ReceiveTick) == 0x000004, "Wrong size on BP_Coconut_Floater_C_ReceiveTick");
static_assert(offsetof(BP_Coconut_Floater_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Coconut_Floater_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Coconut_Floater.BP_Coconut_Floater_C.GetWaterSurfaceInfoCallable
// 0x0090 (0x0090 - 0x0000)
struct BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable final
{
public:
	class AFortWaterBodyActor*                    WaterBody_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneComponent;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneLocation;                                // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneNormal;                                  // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfacePosition;                              // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDepth;                                        // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterBodyIdx;                                      // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterVelocity;                                     // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation;   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable) == 0x000008, "Wrong alignment on BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable");
static_assert(sizeof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable) == 0x000090, "Wrong size on BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterBody_0) == 0x000000, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterBody_0' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, SceneComponent) == 0x000008, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::SceneComponent' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterPlaneLocation) == 0x000010, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterPlaneNormal) == 0x00001C, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterSurfacePosition) == 0x000028, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterDepth) == 0x000034, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterBodyIdx) == 0x000038, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, WaterVelocity) == 0x00003C, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::WaterVelocity' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation) == 0x000054, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal) == 0x000060, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition) == 0x00006C, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterDepth) == 0x000078, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx) == 0x00007C, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterVelocity) == 0x000080, "Member 'BP_Coconut_Floater_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterVelocity' has a wrong offset!");

}

