#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Coconut_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_Coconut_Master.BP_Coconut_Master_C.ExecuteUbergraph_BP_Coconut_Master
// 0x0528 (0x0528 - 0x0000)
struct BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_2;                            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_3;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewParam;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Speed;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_3;                    // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_3;                 // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_3;               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_3;                // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_TimeSpanRate;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DebrisSpeed;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Coconut_Floater_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x01B8(0x0010)(ReferenceParm)
	class ABP_Coconut_Floater_C*                  CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_4;                    // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_4;                 // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_4;               // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_4;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetDuration_ReturnValue;                  // 0x0218(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            CallFunc_Array_Get_Item_1;                         // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_5;                    // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_5;                 // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_5;               // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_5;                // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue_1;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_1; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_1; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_1; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_1; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_4;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Add_TimespanTimespan_ReturnValue;         // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_5;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetDuration_ReturnValue_1;                // 0x02FC(0x0010)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_Select_Default;                             // 0x0380(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_Array_Get_Item_2;                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            CallFunc_Array_Get_Item_3;                         // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_6;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetDuration_ReturnValue_2;                // 0x03E0(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_2; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0400(0x0028)()
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B[0x1];                                      // 0x044B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_4;                         // 0x0450(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_7;          // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams_1; // 0x0500(0x0028)()
};
static_assert(alignof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master) == 0x000008, "Wrong alignment on BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master");
static_assert(sizeof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master) == 0x000528, "Wrong size on BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, EntryPoint) == 0x000000, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_float_Variable) == 0x000004, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName_1) == 0x000040, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000050, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000058, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000060, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName) == 0x000078, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd) == 0x000088, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin) == 0x000090, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio) == 0x000098, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_float_Variable_1) == 0x0000AC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_struct_Variable) == 0x0000B0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_struct_Variable_1) == 0x0000B8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_string_Variable) == 0x0000C0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_Has_Been_Initd_Variable) == 0x0000D0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_IsClosed_Variable) == 0x0000D1, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Variable) == 0x0000D4, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Array_Index_Variable) == 0x0000E0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Array_Index_Variable_1) == 0x0000E4, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_string_Variable_1) == 0x0000E8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_IsClosed_Variable_1) == 0x0000F8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000F9, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Array_Index_Variable_2) == 0x0000FC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_IsClosed_Variable_2) == 0x000100, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_bool_Has_Been_Initd_Variable_2) == 0x000101, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Loop_Counter_Variable_1) == 0x000104, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Loop_Counter_Variable_2) == 0x000108, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_IntInt_ReturnValue_1) == 0x00010C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_IntInt_ReturnValue_2) == 0x000110, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Array_Index_Variable_3) == 0x000114, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_struct_Variable_2) == 0x000118, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_struct_Variable_3) == 0x000120, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_NewParam) == 0x000128, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue) == 0x000130, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_float_Variable_2) == 0x000138, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_Speed) == 0x00013C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Conv_FloatToString_ReturnValue) == 0x000140, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000160, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName_3) == 0x000168, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd_3) == 0x000178, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin_3) == 0x000180, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio_3) == 0x000188, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_3) == 0x00018C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRate) == 0x00019C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRate' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_DebrisSpeed) == 0x0001A0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_DebrisSpeed' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue_2) == 0x0001A8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001B8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_Index) == 0x0001D4, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName_4) == 0x0001D8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd_4) == 0x0001E8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin_4) == 0x0001F0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio_4) == 0x0001F8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Array_Index_Variable_4) == 0x0001FC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_4) == 0x000200, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue_3) == 0x000210, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetDuration_ReturnValue) == 0x000218, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue) == 0x000228, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00022C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000230, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000238, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000240, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000248, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000250, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_IsValid_ReturnValue) == 0x000254, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Array_Get_Item_1) == 0x000258, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Array_Length_ReturnValue_1) == 0x000268, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Less_IntInt_ReturnValue) == 0x00026C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Loop_Counter_Variable_3) == 0x000270, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000274, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Less_IntInt_ReturnValue_1) == 0x000275, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_IntInt_ReturnValue_3) == 0x000278, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_EventName_5) == 0x000280, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_EventName_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeUntilEnd_5) == 0x000290, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeUntilEnd_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSinceBegin_5) == 0x000298, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSinceBegin_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CustomEvent_TimeSpanRatio_5) == 0x0002A0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CustomEvent_TimeSpanRatio_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002A4, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002B4, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_WatchCalendarEvent_ReturnValue_1) == 0x0002B8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_WatchCalendarEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_bIsEventActive_1) == 0x0002C0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_bIsEventActive_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeSinceBegin_1) == 0x0002C8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeUntilEnd_1) == 0x0002D0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetCalendarEventInformation_TimeSpanRatio_1) == 0x0002D8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetCalendarEventInformation_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_IsValid_ReturnValue_1) == 0x0002DC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue_4) == 0x0002E0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_TimespanTimespan_ReturnValue) == 0x0002E8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetSequencePlayer_ReturnValue_5) == 0x0002F0, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetSequencePlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetTotalSeconds_ReturnValue) == 0x0002F8, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_GetDuration_ReturnValue_1) == 0x0002FC, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_GetDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, K2Node_CreateDelegate_OutputDelegate_6) == 0x00030C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1) == 0x00031C, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, Temp_int_Loop_Counter_Variable_4) == 0x000320, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000324, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000328, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000338, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_Add_IntInt_ReturnValue_4) == 0x000348, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000350, "Member 'BP_Coconut_Master_C_ExecuteUbergraph_BP_Coconut_Master::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
