#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Coconut_Island

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Coconut_Island.BP_Coconut_Island_C
// 0x0060 (0x0280 - 0x0220)
class ABP_Coconut_Island_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_LavaCliffRock_A1;                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LavaCliffRock_A;                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Guava_Artemis_IslandDetails_01;                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Guava_Island_Artemis_v2_LP_01;                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        scene_scale;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          rock_pillar_instance_array;                        // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         rock_scale;                                        // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         rock_zoffset;                                      // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UInstancedStaticMeshComponent*>  SmallInstancedRocks;                               // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FRandomStream                          RandomStream;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)

public:
	void SetRockInstances();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Coconut_Island_C">();
	}
	static class ABP_Coconut_Island_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Coconut_Island_C>();
	}
};
static_assert(alignof(ABP_Coconut_Island_C) == 0x000008, "Wrong alignment on ABP_Coconut_Island_C");
static_assert(sizeof(ABP_Coconut_Island_C) == 0x000280, "Wrong size on ABP_Coconut_Island_C");
static_assert(offsetof(ABP_Coconut_Island_C, SM_LavaCliffRock_A1) == 0x000220, "Member 'ABP_Coconut_Island_C::SM_LavaCliffRock_A1' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, SM_LavaCliffRock_A) == 0x000228, "Member 'ABP_Coconut_Island_C::SM_LavaCliffRock_A' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, SM_Guava_Artemis_IslandDetails_01) == 0x000230, "Member 'ABP_Coconut_Island_C::SM_Guava_Artemis_IslandDetails_01' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, Guava_Island_Artemis_v2_LP_01) == 0x000238, "Member 'ABP_Coconut_Island_C::Guava_Island_Artemis_v2_LP_01' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, scene_scale) == 0x000240, "Member 'ABP_Coconut_Island_C::scene_scale' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, Root) == 0x000248, "Member 'ABP_Coconut_Island_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, Scale) == 0x000250, "Member 'ABP_Coconut_Island_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, rock_pillar_instance_array) == 0x000258, "Member 'ABP_Coconut_Island_C::rock_pillar_instance_array' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, rock_scale) == 0x000260, "Member 'ABP_Coconut_Island_C::rock_scale' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, rock_zoffset) == 0x000264, "Member 'ABP_Coconut_Island_C::rock_zoffset' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, SmallInstancedRocks) == 0x000268, "Member 'ABP_Coconut_Island_C::SmallInstancedRocks' has a wrong offset!");
static_assert(offsetof(ABP_Coconut_Island_C, RandomStream) == 0x000278, "Member 'ABP_Coconut_Island_C::RandomStream' has a wrong offset!");

}

