#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CubeMovementGradient

#include "Basic.hpp"

#include "CorruptionSpreadStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CorruptionGameplayCodeRuntime_structs.hpp"


namespace SDK::Params
{

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.ExecuteUbergraph_BP_CubeMovementGradient
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscape*                             K2Node_DynamicCast_AsLandscape;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_InitialCalendarSyncCompleted* CallFunc_InitialCalendarSyncCompleted_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_1; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct;          // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_1;        // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Is_In_Corruption;               // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_2; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_2; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_2; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_2; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_3; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_3; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_3; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_3; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_2;        // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_3;        // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateFrontEnd*               K2Node_DynamicCast_AsFort_Player_State_Front_End;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_4;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_5;        // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_4; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_4; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_4; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_4; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_6;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive_5; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin_5; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd_5; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio_5; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCorruptionSpreadStruct                K2Node_MakeStruct_CorruptionSpreadStruct_7;        // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient");
static_assert(sizeof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient) == 0x0001B0, "Wrong size on BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, EntryPoint) == 0x000000, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, Temp_object_Variable) == 0x000008, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_DynamicCast_AsLandscape) == 0x000010, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_DynamicCast_AsLandscape' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_InitialCalendarSyncCompleted_ReturnValue) == 0x000030, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_InitialCalendarSyncCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000039, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000040, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000048, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000050, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive_1) == 0x000054, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin_1) == 0x000058, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd_1) == 0x000060, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio_1) == 0x000068, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct) == 0x00006C, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_1) == 0x000074, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_IsDedicatedServer_ReturnValue) == 0x00007C, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CustomEvent_Is_In_Corruption) == 0x00007D, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CustomEvent_Is_In_Corruption' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_Event_EndPlayReason) == 0x000090, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_SwitchEnum_CmpSuccess) == 0x000091, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive_2) == 0x000092, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin_2) == 0x000098, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd_2) == 0x0000A0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio_2) == 0x0000A8, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive_3) == 0x0000AC, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin_3) == 0x0000B0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd_3) == 0x0000B8, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio_3) == 0x0000C0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_2) == 0x0000C4, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_3) == 0x0000CC, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_DynamicCast_AsFort_Player_State_Front_End) == 0x0000F8, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_DynamicCast_AsFort_Player_State_Front_End' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CustomEvent_Loaded) == 0x000108, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000110, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_MatchReadyAsync_ReturnValue) == 0x000130, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_4) == 0x000138, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_5) == 0x000144, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_5' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00014C, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_HasAuthority_ReturnValue) == 0x00014D, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_CreateDelegate_OutputDelegate_4) == 0x000150, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive_4) == 0x000160, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin_4) == 0x000168, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd_4) == 0x000170, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio_4) == 0x000178, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio_4' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_HasAuthority_ReturnValue_1) == 0x00017C, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_6) == 0x000180, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_6' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_bIsEventActive_5) == 0x000188, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_bIsEventActive_5' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSinceBegin_5) == 0x000190, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSinceBegin_5' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeUntilEnd_5) == 0x000198, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeUntilEnd_5' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, CallFunc_GetCalendarEventInformation_TimeSpanRatio_5) == 0x0001A0, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::CallFunc_GetCalendarEventInformation_TimeSpanRatio_5' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient, K2Node_MakeStruct_CorruptionSpreadStruct_7) == 0x0001A4, "Member 'BP_CubeMovementGradient_C_ExecuteUbergraph_BP_CubeMovementGradient::K2Node_MakeStruct_CorruptionSpreadStruct_7' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CubeMovementGradient_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CubeMovementGradient_C_ReceiveEndPlay");
static_assert(sizeof(BP_CubeMovementGradient_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CubeMovementGradient_C_ReceiveEndPlay");
static_assert(offsetof(BP_CubeMovementGradient_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CubeMovementGradient_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.HandleCorruptionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CubeMovementGradient_C_HandleCorruptionStateChanged final
{
public:
	bool                                          Is_In_Corruption;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CubeMovementGradient_C_HandleCorruptionStateChanged) == 0x000001, "Wrong alignment on BP_CubeMovementGradient_C_HandleCorruptionStateChanged");
static_assert(sizeof(BP_CubeMovementGradient_C_HandleCorruptionStateChanged) == 0x000001, "Wrong size on BP_CubeMovementGradient_C_HandleCorruptionStateChanged");
static_assert(offsetof(BP_CubeMovementGradient_C_HandleCorruptionStateChanged, Is_In_Corruption) == 0x000000, "Member 'BP_CubeMovementGradient_C_HandleCorruptionStateChanged::Is_In_Corruption' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.OnLoaded_84C4C8F045559ADE82395CB75A5FA23F
// 0x0008 (0x0008 - 0x0000)
struct BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F");
static_assert(sizeof(BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F) == 0x000008, "Wrong size on BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F");
static_assert(offsetof(BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F, Loaded) == 0x000000, "Member 'BP_CubeMovementGradient_C_OnLoaded_84C4C8F045559ADE82395CB75A5FA23F::Loaded' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_CubeMovementGradient_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscape*                             K2Node_DynamicCast_AsLandscape;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CubeMovementGradient_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_UserConstructionScript");
static_assert(sizeof(BP_CubeMovementGradient_C_UserConstructionScript) == 0x000038, "Wrong size on BP_CubeMovementGradient_C_UserConstructionScript");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000000, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_GetCommandLine_ReturnValue) == 0x000008, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000020, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, K2Node_DynamicCast_AsLandscape) == 0x000028, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::K2Node_DynamicCast_AsLandscape' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_UserConstructionScript, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000033, "Member 'BP_CubeMovementGradient_C_UserConstructionScript::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.Draw Cube to RT
// 0x0078 (0x0078 - 0x0000)
struct BP_CubeMovementGradient_C_Draw_Cube_to_RT final
{
public:
	class UCanvas*                                Canvas_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         X;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y;                                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0048(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_Draw_Cube_to_RT) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_Draw_Cube_to_RT");
static_assert(sizeof(BP_CubeMovementGradient_C_Draw_Cube_to_RT) == 0x000078, "Wrong size on BP_CubeMovementGradient_C_Draw_Cube_to_RT");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, Canvas_0) == 0x000000, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::Canvas_0' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, X) == 0x000008, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::X' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, Y) == 0x00000C, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::Y' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, Color) == 0x000010, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::Color' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, Rotation) == 0x000020, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::Rotation' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, Size) == 0x000024, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::Size' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, RenderTarget) == 0x000028, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::RenderTarget' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000038, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000040, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000048, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000064, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_Draw_Cube_to_RT, CallFunc_MakeVector2D_ReturnValue_1) == 0x000070, "Member 'BP_CubeMovementGradient_C_Draw_Cube_to_RT::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.PosToTextureCoord
// 0x003C (0x003C - 0x0000)
struct BP_CubeMovementGradient_C_PosToTextureCoord final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_PosToTextureCoord) == 0x000004, "Wrong alignment on BP_CubeMovementGradient_C_PosToTextureCoord");
static_assert(sizeof(BP_CubeMovementGradient_C_PosToTextureCoord) == 0x00003C, "Wrong size on BP_CubeMovementGradient_C_PosToTextureCoord");
static_assert(offsetof(BP_CubeMovementGradient_C_PosToTextureCoord, Location) == 0x000000, "Member 'BP_CubeMovementGradient_C_PosToTextureCoord::Location' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_PosToTextureCoord, ReturnValue) == 0x00000C, "Member 'BP_CubeMovementGradient_C_PosToTextureCoord::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_PosToTextureCoord, CallFunc_Add_VectorVector_ReturnValue) == 0x000018, "Member 'BP_CubeMovementGradient_C_PosToTextureCoord::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_PosToTextureCoord, CallFunc_Divide_VectorVector_ReturnValue) == 0x000024, "Member 'BP_CubeMovementGradient_C_PosToTextureCoord::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_PosToTextureCoord, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000030, "Member 'BP_CubeMovementGradient_C_PosToTextureCoord::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.SetupLandscapeBounds (Landscape)
// 0x0060 (0x0060 - 0x0000)
struct BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_ final
{
public:
	class ALandscape*                             Landscape_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_");
static_assert(sizeof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_) == 0x000060, "Wrong size on BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, Landscape_0) == 0x000000, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::Landscape_0' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_GetActorBounds_Origin) == 0x00001C, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_GetActorBounds_BoxExtent) == 0x000028, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_Add_VectorVector_ReturnValue) == 0x000034, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000040, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds__Landscape_::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.SetupLandscapeBounds
// 0x0018 (0x0018 - 0x0000)
struct BP_CubeMovementGradient_C_SetupLandscapeBounds final
{
public:
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscape*                             K2Node_DynamicCast_AsLandscape;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CubeMovementGradient_C_SetupLandscapeBounds) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_SetupLandscapeBounds");
static_assert(sizeof(BP_CubeMovementGradient_C_SetupLandscapeBounds) == 0x000018, "Wrong size on BP_CubeMovementGradient_C_SetupLandscapeBounds");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000000, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds, K2Node_DynamicCast_AsLandscape) == 0x000008, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds::K2Node_DynamicCast_AsLandscape' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_SetupLandscapeBounds, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CubeMovementGradient_C_SetupLandscapeBounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.ReportLandscapeBounds
// 0x0070 (0x0070 - 0x0000)
struct BP_CubeMovementGradient_C_ReportLandscapeBounds final
{
public:
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ColorToString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ColorToString_ReturnValue_1;         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CubeMovementGradient_C_ReportLandscapeBounds) == 0x000008, "Wrong alignment on BP_CubeMovementGradient_C_ReportLandscapeBounds");
static_assert(sizeof(BP_CubeMovementGradient_C_ReportLandscapeBounds) == 0x000070, "Wrong size on BP_CubeMovementGradient_C_ReportLandscapeBounds");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000000, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_GetVectorParameterValue_ReturnValue_1) == 0x000010, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_Conv_ColorToString_ReturnValue) == 0x000020, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_Conv_ColorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_Conv_ColorToString_ReturnValue_1) == 0x000030, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_Conv_ColorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CubeMovementGradient_C_ReportLandscapeBounds, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'BP_CubeMovementGradient_C_ReportLandscapeBounds::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_CubeMovementGradient.BP_CubeMovementGradient_C.GetCubeTransformsAtTime
// 0x01E0 (0x01E0 - 0x0000)
struct BP_CubeMovementGradient_C_GetCubeTransformsAtTime final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Transforms;                                        // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FCubeMovement_CorruptionGenerationTravelerData> NewLocalVar_1;                                     // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTransform>                     transformss;                                       // 0x0028(0x0010)(Edit, BlueprintVisible)
	float                                         LocalTime;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
