#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Coconut_IdleGameplay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Coconut_IdleGameplay.BP_Coconut_IdleGameplay_C.ExecuteUbergraph_BP_Coconut_IdleGameplay
// 0x0120 (0x0120 - 0x0000)
struct BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AApollo_Waterbody_Ocean_Parent_C*       K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LocalPlayerMannequin_C*             K2Node_DynamicCast_AsBP_Local_Player_Mannequin;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation; // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition; // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfoCallable_WaterDepth;   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity; // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay) == 0x000008, "Wrong alignment on BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay");
static_assert(sizeof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay) == 0x000120, "Wrong size on BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, EntryPoint) == 0x000000, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent) == 0x000010, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_DynamicCast_AsApollo_Waterbody_Ocean_Parent' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_IsDedicatedServer_ReturnValue) == 0x00001A, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_DynamicCast_AsBP_Local_Player_Mannequin) == 0x000040, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_DynamicCast_AsBP_Local_Player_Mannequin' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation) == 0x00004C, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal) == 0x000058, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition) == 0x000064, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterDepth) == 0x000070, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx) == 0x000074, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity) == 0x000078, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_GetWaterSurfaceInfoCallable_WaterVelocity' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000094, "Member 'BP_Coconut_IdleGameplay_C_ExecuteUbergraph_BP_Coconut_IdleGameplay::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_Coconut_IdleGameplay.BP_Coconut_IdleGameplay_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_Coconut_IdleGameplay_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LocalPlayerMannequin_Lobby_C*       K2Node_DynamicCast_AsBP_Local_Player_Mannequin_Lobby; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Coconut_IdleGameplay_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Coconut_IdleGameplay_C_UserConstructionScript");
static_assert(sizeof(BP_Coconut_IdleGameplay_C_UserConstructionScript) == 0x000050, "Wrong size on BP_Coconut_IdleGameplay_C_UserConstructionScript");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, K2Node_DynamicCast_AsBP_Local_Player_Mannequin_Lobby) == 0x000040, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::K2Node_DynamicCast_AsBP_Local_Player_Mannequin_Lobby' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000049, "Member 'BP_Coconut_IdleGameplay_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_Coconut_IdleGameplay.BP_Coconut_IdleGameplay_C.GetWaterSurfaceInfoCallable
// 0x0090 (0x0090 - 0x0000)
struct BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable final
{
public:
	class AFortWaterBodyActor*                    WaterBody_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneComponent;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneLocation;                                // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterPlaneNormal;                                  // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfacePosition;                              // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDepth;                                        // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterBodyIdx;                                      // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterVelocity;                                     // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation;   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable) == 0x000008, "Wrong alignment on BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable");
static_assert(sizeof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable) == 0x000090, "Wrong size on BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterBody_0) == 0x000000, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterBody_0' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, SceneComponent) == 0x000008, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::SceneComponent' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterPlaneLocation) == 0x000010, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterPlaneNormal) == 0x00001C, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterSurfacePosition) == 0x000028, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterDepth) == 0x000034, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterBodyIdx) == 0x000038, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, WaterVelocity) == 0x00003C, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::WaterVelocity' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation) == 0x000054, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal) == 0x000060, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition) == 0x00006C, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterDepth) == 0x000078, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx) == 0x00007C, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable, CallFunc_GetWaterSurfaceInfo_WaterVelocity) == 0x000080, "Member 'BP_Coconut_IdleGameplay_C_GetWaterSurfaceInfoCallable::CallFunc_GetWaterSurfaceInfo_WaterVelocity' has a wrong offset!");

// Function BP_Coconut_IdleGameplay.BP_Coconut_IdleGameplay_C.UpdateMannequinAnimation
// 0x0058 (0x0058 - 0x0000)
struct BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns; // 0x0008(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomBodyType                           CallFunc_GetCharacterBodyType_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation) == 0x000008, "Wrong alignment on BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation");
static_assert(sizeof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation) == 0x000058, "Wrong size on BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, Temp_bool_Variable) == 0x000000, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns) == 0x000008, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, Temp_bool_Variable_1) == 0x000018, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_GetCharacterBodyType_ReturnValue) == 0x00002C, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_GetCharacterBodyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002E, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_GetGender_IsMale) == 0x00002F, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_GetGender_IsMale' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_GetGender_IsFemale) == 0x000030, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_GetGender_IsFemale' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, K2Node_Select_Default) == 0x000038, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, Temp_bool_Variable_2) == 0x000040, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, K2Node_Select_Default_1) == 0x000048, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation, K2Node_Select_Default_2) == 0x000050, "Member 'BP_Coconut_IdleGameplay_C_UpdateMannequinAnimation::K2Node_Select_Default_2' has a wrong offset!");

}

