#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_TimerManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.ExecuteUbergraph_BP_Generic_TimerManager
// 0x03C0 (0x03C0 - 0x0000)
struct BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x00D8(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x00F8(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue; // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_1;  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_2;  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeconds_ReturnValue;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue;                      // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_1;                    // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_1;         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_2;               // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_3;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_2;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_3;         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_2;                    // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Reverse_ReturnValue_3;                    // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_4;               // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_5;               // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_4;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_5;         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_6;               // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_7;               // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_6;         // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue_7;         // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCalendarEventInformation_bIsEventActive; // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeSinceBegin; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetCalendarEventInformation_TimeUntilEnd; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCalendarEventInformation_TimeSpanRatio; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue_3;  // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x038C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Server_Seconds;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(sizeof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager) == 0x0003C0, "Wrong size on BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, EntryPoint) == 0x000000, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName_1) == 0x000008, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000018, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000020, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000028, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName) == 0x000040, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd) == 0x000050, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin) == 0x000058, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio) == 0x000060, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_float_Variable) == 0x000074, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable) == 0x000078, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_1) == 0x000080, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_string_Variable) == 0x000088, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MatchReadyAsync_ReturnValue) == 0x0000A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_GameState) == 0x0000C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_Playlist) == 0x0000D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_PlaylistContextTags) == 0x0000D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_struct_Variable_2) == 0x0000F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable) == 0x000118, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_object_Variable_1) == 0x000120, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x000128, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue) == 0x000131, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable) == 0x000132, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_Has_Been_Initd_Variable_1) == 0x000133, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x000134, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue) == 0x000148, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000150, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x000154, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000164, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue) == 0x000168, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable) == 0x00016C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue) == 0x000170, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue) == 0x000174, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_IntInt_ReturnValue) == 0x000178, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00017C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_6) == 0x000180, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FClamp_ReturnValue) == 0x000190, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000198, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_1) == 0x0001A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_1) == 0x0001B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue) == 0x0001B4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_2) == 0x0001C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_2) == 0x0001C8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_2) == 0x0001CC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FTrunc_ReturnValue_1) == 0x0001D4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001DC, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Max_ReturnValue_1) == 0x0001E0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_MakeTimespan_ReturnValue) == 0x0001E8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSeconds_ReturnValue) == 0x0001F0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetMinutes_ReturnValue) == 0x0001F4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue) == 0x0001F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000208, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue) == 0x000218, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_1) == 0x000228, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue) == 0x000238, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_1) == 0x000248, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue) == 0x000258, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_1) == 0x00025C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_2) == 0x000260, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_3) == 0x000270, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_2) == 0x000280, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_3) == 0x000284, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetHours_ReturnValue) == 0x000288, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetDays_ReturnValue) == 0x00028C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000290, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0002A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_2) == 0x0002B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Reverse_ReturnValue_3) == 0x0002C0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Reverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_4) == 0x0002D0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_5) == 0x0002E0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_4) == 0x0002F0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_5) == 0x0002F4, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_6) == 0x0002F8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetSubstring_ReturnValue_7) == 0x000308, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetSubstring_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_6) == 0x000318, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Conv_StringToFloat_ReturnValue_7) == 0x00031C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Conv_StringToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, Temp_bool_IsClosed_Variable_1) == 0x000320, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetGameState_ReturnValue_3) == 0x000328, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetGameState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_bIsEventActive) == 0x000330, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_bIsEventActive' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSinceBegin) == 0x000338, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeUntilEnd) == 0x000340, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetCalendarEventInformation_TimeSpanRatio) == 0x000348, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetCalendarEventInformation_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetServerWorldTimeSeconds_ReturnValue_3) == 0x00034C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetServerWorldTimeSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x000350, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000354, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_WatchCalendarEvent_ReturnValue) == 0x000358, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_IsValid_ReturnValue_3) == 0x000360, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_EventName_2) == 0x000368, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000378, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000380, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000388, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CreateDelegate_OutputDelegate_7) == 0x00038C, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0003A0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, K2Node_CustomEvent_Server_Seconds) == 0x0003A8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::K2Node_CustomEvent_Server_Seconds' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_FromSeconds_ReturnValue) == 0x0003B0, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0003B8, "Member 'BP_Generic_TimerManager_C_ExecuteUbergraph_BP_Generic_TimerManager::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.DebugCountdown
// 0x0004 (0x0004 - 0x0000)
struct BP_Generic_TimerManager_C_DebugCountdown final
{
public:
	float                                         Server_Seconds;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_DebugCountdown) == 0x000004, "Wrong alignment on BP_Generic_TimerManager_C_DebugCountdown");
static_assert(sizeof(BP_Generic_TimerManager_C_DebugCountdown) == 0x000004, "Wrong size on BP_Generic_TimerManager_C_DebugCountdown");
static_assert(offsetof(BP_Generic_TimerManager_C_DebugCountdown, Server_Seconds) == 0x000000, "Member 'BP_Generic_TimerManager_C_DebugCountdown::Server_Seconds' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnReady_B337321A443C013690B7869DF30E5BCC
// 0x0030 (0x0030 - 0x0000)
struct BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC");
static_assert(sizeof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC) == 0x000030, "Wrong size on BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, GameState) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::GameState' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, Playlist) == 0x000008, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::Playlist' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC, PlaylistContextTags) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnReady_B337321A443C013690B7869DF30E5BCC::PlaylistContextTags' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventActive_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C");
static_assert(sizeof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C) == 0x000028, "Wrong size on BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C, TimespanRatio) == 0x000020, "Member 'BP_Generic_TimerManager_C_OnEventActive_60E8057840996C096DE192A0F298D20C::TimespanRatio' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventUpdated_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C) == 0x000008, "Wrong alignment on BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C");
static_assert(sizeof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C) == 0x000028, "Wrong size on BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, EventName) == 0x000000, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::EventName' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimeUntilEnd) == 0x000010, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimeSinceBegin) == 0x000018, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C, TimespanRatio) == 0x000020, "Member 'BP_Generic_TimerManager_C_OnEventUpdated_60E8057840996C096DE192A0F298D20C::TimespanRatio' has a wrong offset!");

// Function BP_Generic_TimerManager.BP_Generic_TimerManager_C.OnEventEnded_60E8057840996C096DE192A0F298D20C
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_TimerManager_C_OnEventEnded_60E8057840996C096DE192A0F298D20C final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
