#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_G_Countdown

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_G_Countdown.BP_G_Countdown_C.ExecuteUbergraph_BP_G_Countdown
// 0x03B0 (0x03B0 - 0x0000)
struct BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_2;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd_1;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin_1;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio_1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeUntilEnd;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              K2Node_CustomEvent_TimeSinceBegin;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSpanRatio;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              Temp_struct_Variable_1;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            Temp_object_Variable;                              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SecondsRemaining)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0160(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0168(0x0020)(ConstParm)
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0188(0x0020)()
	class UFortPlaylist*                          Temp_object_Variable_1;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   Temp_object_Variable_2;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CalendarEventWatcher*  CallFunc_WatchCalendarEvent_ReturnValue;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Fade;                           // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x01DC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0xE];                                      // 0x0272(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x02C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0348(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353[0x5];                                      // 0x0353(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Generic_TimerManager_C*             K2Node_DynamicCast_AsBP_Generic_Timer_Manager;     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SecondsRemaining)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x036C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SecondsRemaining;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0386(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_387[0x1];                                      // 0x0387(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Generic_TimerManager_C*             K2Node_DynamicCast_AsBP_Generic_Timer_Manager_1;   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown) == 0x000010, "Wrong alignment on BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown");
static_assert(sizeof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown) == 0x0003B0, "Wrong size on BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, EntryPoint) == 0x000000, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeUntilEnd_2) == 0x000018, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeUntilEnd_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSinceBegin_2) == 0x000020, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSinceBegin_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSpanRatio_2) == 0x000028, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSpanRatio_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_EventName_1) == 0x000040, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeUntilEnd_1) == 0x000050, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeUntilEnd_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSinceBegin_1) == 0x000058, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSinceBegin_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSpanRatio_1) == 0x000060, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSpanRatio_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_EventName) == 0x000078, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeUntilEnd) == 0x000088, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSinceBegin) == 0x000090, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_TimeSpanRatio) == 0x000098, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_TimeSpanRatio' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_float_Variable) == 0x0000AC, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_struct_Variable) == 0x0000B0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_struct_Variable_1) == 0x0000B8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_string_Variable) == 0x0000C0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_SwitchEnum_CmpSuccess) == 0x000100, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_UserWidget) == 0x000108, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_3) == 0x000110, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_object_Variable) == 0x000120, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_CreateWidgetAsync_ReturnValue) == 0x000128, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_CreateWidgetAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_4) == 0x000134, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_5) == 0x000144, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_GameState) == 0x000158, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_Playlist) == 0x000160, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_PlaylistContextTags) == 0x000168, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_struct_Variable_2) == 0x000188, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_object_Variable_1) == 0x0001A8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_HasTag_ReturnValue) == 0x0001B0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_object_Variable_2) == 0x0001B8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0001C0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue_2) == 0x0001C8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_WatchCalendarEvent_ReturnValue) == 0x0001D0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_WatchCalendarEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue_3) == 0x0001D8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_Fade) == 0x0001D9, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_Fade' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0001DC, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_MatchReadyAsync_ReturnValue) == 0x000268, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000270, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue_4) == 0x000271, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_MakeTransform_ReturnValue_1) == 0x000280, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002B0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_K2_SetRelativeTransform_SweepHitResult_1) == 0x0002C0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_K2_SetRelativeTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000348, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsDedicatedServer_ReturnValue) == 0x000350, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, Temp_bool_Variable) == 0x000351, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_Not_PreBool_ReturnValue) == 0x000352, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000358, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_DynamicCast_AsBP_Generic_Timer_Manager) == 0x000360, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_DynamicCast_AsBP_Generic_Timer_Manager' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_DynamicCast_bSuccess) == 0x000368, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_7) == 0x00036C, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_IsValid_ReturnValue_5) == 0x00037C, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CustomEvent_SecondsRemaining) == 0x000380, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CustomEvent_SecondsRemaining' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000384, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_Not_PreBool_ReturnValue_1) == 0x000385, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_BooleanAND_ReturnValue) == 0x000386, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_CreateDelegate_OutputDelegate_8) == 0x000388, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000398, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_DynamicCast_AsBP_Generic_Timer_Manager_1) == 0x0003A0, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_DynamicCast_AsBP_Generic_Timer_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, K2Node_DynamicCast_bSuccess_1) == 0x0003A8, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003A9, "Member 'BP_G_Countdown_C_ExecuteUbergraph_BP_G_Countdown::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.Seconds Updated
// 0x0004 (0x0004 - 0x0000)
struct BP_G_Countdown_C_Seconds_Updated final
{
public:
	int32                                         SecondsRemaining_0;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_Seconds_Updated) == 0x000004, "Wrong alignment on BP_G_Countdown_C_Seconds_Updated");
static_assert(sizeof(BP_G_Countdown_C_Seconds_Updated) == 0x000004, "Wrong size on BP_G_Countdown_C_Seconds_Updated");
static_assert(offsetof(BP_G_Countdown_C_Seconds_Updated, SecondsRemaining_0) == 0x000000, "Member 'BP_G_Countdown_C_Seconds_Updated::SecondsRemaining_0' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.FadeOut
// 0x0001 (0x0001 - 0x0000)
struct BP_G_Countdown_C_FadeOut final
{
public:
	bool                                          Fade;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_FadeOut) == 0x000001, "Wrong alignment on BP_G_Countdown_C_FadeOut");
static_assert(sizeof(BP_G_Countdown_C_FadeOut) == 0x000001, "Wrong size on BP_G_Countdown_C_FadeOut");
static_assert(offsetof(BP_G_Countdown_C_FadeOut, Fade) == 0x000000, "Member 'BP_G_Countdown_C_FadeOut::Fade' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnReady_5182C2DA46C2D6066130E4BF6F6D5685
// 0x0030 (0x0030 - 0x0000)
struct BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685 final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685");
static_assert(sizeof(BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685) == 0x000030, "Wrong size on BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685");
static_assert(offsetof(BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685, GameState) == 0x000000, "Member 'BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685::GameState' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685, Playlist) == 0x000008, "Member 'BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685::Playlist' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685, PlaylistContextTags) == 0x000010, "Member 'BP_G_Countdown_C_OnReady_5182C2DA46C2D6066130E4BF6F6D5685::PlaylistContextTags' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278
// 0x0008 (0x0008 - 0x0000)
struct BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278 final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278");
static_assert(sizeof(BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278) == 0x000008, "Wrong size on BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278");
static_assert(offsetof(BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278, UserWidget) == 0x000000, "Member 'BP_G_Countdown_C_OnComplete_DC499D2542DDC4A4D0BFD4BF670FD278::UserWidget' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136
// 0x0028 (0x0028 - 0x0000)
struct BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(sizeof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000028, "Wrong size on BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(offsetof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136, EventName) == 0x000000, "Member 'BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136::EventName' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136, TimeUntilEnd) == 0x000010, "Member 'BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136, TimeSinceBegin) == 0x000018, "Member 'BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136, TimespanRatio) == 0x000020, "Member 'BP_G_Countdown_C_OnEventActive_0D8CA66F46B8FF9A8F4C398887B07136::TimespanRatio' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136
// 0x0028 (0x0028 - 0x0000)
struct BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(sizeof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000028, "Wrong size on BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(offsetof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136, EventName) == 0x000000, "Member 'BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136::EventName' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136, TimeUntilEnd) == 0x000010, "Member 'BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136, TimeSinceBegin) == 0x000018, "Member 'BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136, TimespanRatio) == 0x000020, "Member 'BP_G_Countdown_C_OnEventUpdated_0D8CA66F46B8FF9A8F4C398887B07136::TimespanRatio' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136
// 0x0028 (0x0028 - 0x0000)
struct BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136 final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              TimeUntilEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              TimeSinceBegin;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TimespanRatio;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(sizeof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136) == 0x000028, "Wrong size on BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136");
static_assert(offsetof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136, EventName) == 0x000000, "Member 'BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136::EventName' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136, TimeUntilEnd) == 0x000010, "Member 'BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136::TimeUntilEnd' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136, TimeSinceBegin) == 0x000018, "Member 'BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136::TimeSinceBegin' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136, TimespanRatio) == 0x000020, "Member 'BP_G_Countdown_C_OnEventEnded_0D8CA66F46B8FF9A8F4C398887B07136::TimespanRatio' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnRep_Stage
// 0x0028 (0x0028 - 0x0000)
struct BP_G_Countdown_C_OnRep_Stage final
{
public:
	TDelegate<void(int32 SecondsRemaining)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Generic_TimerManager_C*             K2Node_DynamicCast_AsBP_Generic_Timer_Manager;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_OnRep_Stage) == 0x000008, "Wrong alignment on BP_G_Countdown_C_OnRep_Stage");
static_assert(sizeof(BP_G_Countdown_C_OnRep_Stage) == 0x000028, "Wrong size on BP_G_Countdown_C_OnRep_Stage");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_G_Countdown_C_OnRep_Stage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000010, "Member 'BP_G_Countdown_C_OnRep_Stage::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, K2Node_DynamicCast_AsBP_Generic_Timer_Manager) == 0x000018, "Member 'BP_G_Countdown_C_OnRep_Stage::K2Node_DynamicCast_AsBP_Generic_Timer_Manager' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_G_Countdown_C_OnRep_Stage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_G_Countdown_C_OnRep_Stage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_Stage, K2Node_SwitchInteger_CmpSuccess) == 0x000022, "Member 'BP_G_Countdown_C_OnRep_Stage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnRep_PlayAudio
// 0x0001 (0x0001 - 0x0000)
struct BP_G_Countdown_C_OnRep_PlayAudio final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_OnRep_PlayAudio) == 0x000001, "Wrong alignment on BP_G_Countdown_C_OnRep_PlayAudio");
static_assert(sizeof(BP_G_Countdown_C_OnRep_PlayAudio) == 0x000001, "Wrong size on BP_G_Countdown_C_OnRep_PlayAudio");
static_assert(offsetof(BP_G_Countdown_C_OnRep_PlayAudio, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_G_Countdown_C_OnRep_PlayAudio::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.Play Audio Internal
// 0x0020 (0x0020 - 0x0000)
struct BP_G_Countdown_C_Play_Audio_Internal final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_Countdown_C_Play_Audio_Internal) == 0x000008, "Wrong alignment on BP_G_Countdown_C_Play_Audio_Internal");
static_assert(sizeof(BP_G_Countdown_C_Play_Audio_Internal) == 0x000020, "Wrong size on BP_G_Countdown_C_Play_Audio_Internal");
static_assert(offsetof(BP_G_Countdown_C_Play_Audio_Internal, StartTime) == 0x000000, "Member 'BP_G_Countdown_C_Play_Audio_Internal::StartTime' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_Play_Audio_Internal, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_G_Countdown_C_Play_Audio_Internal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_Play_Audio_Internal, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_G_Countdown_C_Play_Audio_Internal::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_Play_Audio_Internal, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000018, "Member 'BP_G_Countdown_C_Play_Audio_Internal::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.StopAudioInternal
// 0x0001 (0x0001 - 0x0000)
struct BP_G_Countdown_C_StopAudioInternal final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_StopAudioInternal) == 0x000001, "Wrong alignment on BP_G_Countdown_C_StopAudioInternal");
static_assert(sizeof(BP_G_Countdown_C_StopAudioInternal) == 0x000001, "Wrong size on BP_G_Countdown_C_StopAudioInternal");
static_assert(offsetof(BP_G_Countdown_C_StopAudioInternal, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_G_Countdown_C_StopAudioInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_G_Countdown.BP_G_Countdown_C.OnRep_MoveTimer
// 0x008C (0x008C - 0x0000)
struct BP_G_Countdown_C_OnRep_MoveTimer final
{
public:
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_G_Countdown_C_OnRep_MoveTimer) == 0x000004, "Wrong alignment on BP_G_Countdown_C_OnRep_MoveTimer");
static_assert(sizeof(BP_G_Countdown_C_OnRep_MoveTimer) == 0x00008C, "Wrong size on BP_G_Countdown_C_OnRep_MoveTimer");
static_assert(offsetof(BP_G_Countdown_C_OnRep_MoveTimer, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000000, "Member 'BP_G_Countdown_C_OnRep_MoveTimer::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_G_Countdown_C_OnRep_MoveTimer, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000088, "Member 'BP_G_Countdown_C_OnRep_MoveTimer::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

