#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerMannequin

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LocalPlayerMannequin.BP_LocalPlayerMannequin_C.ExecuteUbergraph_BP_LocalPlayerMannequin
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CacheLocalPlayerCosmetics_bFoundCosmeticsToCache; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin) == 0x000004, "Wrong alignment on BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin");
static_assert(sizeof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin) == 0x000008, "Wrong size on BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin");
static_assert(offsetof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin, EntryPoint) == 0x000000, "Member 'BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin, CallFunc_CacheLocalPlayerCosmetics_bFoundCosmeticsToCache) == 0x000005, "Member 'BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin::CallFunc_CacheLocalPlayerCosmetics_bFoundCosmeticsToCache' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin, CallFunc_IsDedicatedServer_ReturnValue) == 0x000006, "Member 'BP_LocalPlayerMannequin_C_ExecuteUbergraph_BP_LocalPlayerMannequin::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_LocalPlayerMannequin.BP_LocalPlayerMannequin_C.CacheLocalPlayerCosmetics
// 0x0030 (0x0030 - 0x0000)
struct BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics final
{
public:
	bool                                          bFoundCosmeticsToCache;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics) == 0x000008, "Wrong alignment on BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics");
static_assert(sizeof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics) == 0x000030, "Wrong size on BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, bFoundCosmeticsToCache) == 0x000000, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::bFoundCosmeticsToCache' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000020, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_LocalPlayerMannequin_C_CacheLocalPlayerCosmetics::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

