#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerMannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LocalPlayerMannequin.BP_LocalPlayerMannequin_C
// 0x0030 (0x0598 - 0x0568)
class ABP_LocalPlayerMannequin_C : public AFortPlayerMannequin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaCharacterItemDefinition*         CachedCID;                                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMcpVariantChannelInfo>         CachedVariantChannels;                             // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnCosmeticsReinitialized;                          // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_LocalPlayerMannequin(int32 EntryPoint);
	void HandleReInitializeComplete();
	void UpdateMannequinWithCachedCosmetics();
	void ReceiveBeginPlay();
	void CacheLocalPlayerCosmetics(bool* bFoundCosmeticsToCache);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LocalPlayerMannequin_C">();
	}
	static class ABP_LocalPlayerMannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LocalPlayerMannequin_C>();
	}
};
static_assert(alignof(ABP_LocalPlayerMannequin_C) == 0x000008, "Wrong alignment on ABP_LocalPlayerMannequin_C");
static_assert(sizeof(ABP_LocalPlayerMannequin_C) == 0x000598, "Wrong size on ABP_LocalPlayerMannequin_C");
static_assert(offsetof(ABP_LocalPlayerMannequin_C, UberGraphFrame) == 0x000568, "Member 'ABP_LocalPlayerMannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerMannequin_C, CachedCID) == 0x000570, "Member 'ABP_LocalPlayerMannequin_C::CachedCID' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerMannequin_C, CachedVariantChannels) == 0x000578, "Member 'ABP_LocalPlayerMannequin_C::CachedVariantChannels' has a wrong offset!");
static_assert(offsetof(ABP_LocalPlayerMannequin_C, OnCosmeticsReinitialized) == 0x000588, "Member 'ABP_LocalPlayerMannequin_C::OnCosmeticsReinitialized' has a wrong offset!");

}

