#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkewedTabButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkewedTabButton.BP_SkewedTabButton_C
// 0x0038 (0x0C78 - 0x0C40)
class UBP_SkewedTabButton_C final : public UAthenaSkewedTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 No_Count_1;                                        // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           RGB1_Text_Color;                                   // 0x0C68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkewedTabButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BP_OnDeselected();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkewedTabButton_C">();
	}
	static class UBP_SkewedTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkewedTabButton_C>();
	}
};
static_assert(alignof(UBP_SkewedTabButton_C) == 0x000008, "Wrong alignment on UBP_SkewedTabButton_C");
static_assert(sizeof(UBP_SkewedTabButton_C) == 0x000C78, "Wrong size on UBP_SkewedTabButton_C");
static_assert(offsetof(UBP_SkewedTabButton_C, UberGraphFrame) == 0x000C40, "Member 'UBP_SkewedTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Unhovered) == 0x000C48, "Member 'UBP_SkewedTabButton_C::Unhovered' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Hovered) == 0x000C50, "Member 'UBP_SkewedTabButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, Selected) == 0x000C58, "Member 'UBP_SkewedTabButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, No_Count_1) == 0x000C60, "Member 'UBP_SkewedTabButton_C::No_Count_1' has a wrong offset!");
static_assert(offsetof(UBP_SkewedTabButton_C, RGB1_Text_Color) == 0x000C68, "Member 'UBP_SkewedTabButton_C::RGB1_Text_Color' has a wrong offset!");

}

