#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Valet_AudioController_Parent

#include "Basic.hpp"

#include "ValetRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Valet_AudioController_Parent.BP_Valet_AudioController_Parent_C.ExecuteUbergraph_BP_Valet_AudioController_Parent
// 0x04C8 (0x04C8 - 0x0000)
struct BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDagwoodVehicle*                    K2Node_Event_Vehicle;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_ComponentBoundEvent_AudioComponent;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ParameterName;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OneshotIndex;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVehicleSurfaceType_Surface_ID;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Start;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enter;                                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_1;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_4;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UpShift;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUpshift)>                K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Is_Entering_Water;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalculateRPMWobbleRange_ReturnValue;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Bone_Name_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue_1;   // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Bone_Name;                            // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_Value;                         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Impact_Point;                         // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_2;                 // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_1;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult_1;                  // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude_1;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Awake;                                // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasDriver_self_CastInput;                 // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDriver_ReturnValue;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue_2;             // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_SurfaceTypeVehicleIsOn;         // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPhysicalSurface SurfaceTypeVehicleIsOn)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LocalPlayerInVehicleBP_Result;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Fade_Amount;                          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             K2Node_DynamicCast_AsSound_Wave_3;                 // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTireInfo                              K2Node_Event_AppliedTireMod;                       // 0x0300(0x01A0)(ConstParm)
	bool                                          Temp_bool_Variable_1;                              // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRPMRange_OutMinRPM;                    // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRPMRange_OutMaxRPM;                    // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent) == 0x000008, "Wrong alignment on BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent");
static_assert(sizeof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent) == 0x0004C8, "Wrong size on BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, EntryPoint) == 0x000000, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X) == 0x000004, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000015, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000016, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_bool_Variable) == 0x000028, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000029, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_4) == 0x00002A, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000030, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000038, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000039, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable) == 0x000040, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave) == 0x000048, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_5) == 0x000051, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000058, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded_2) == 0x000060, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000068, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000069, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Vehicle) == 0x000070, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_AudioComponent) == 0x000078, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_AudioComponent' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_ParameterName) == 0x000080, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_ParameterName' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_ComponentBoundEvent_OneshotIndex) == 0x000088, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_ComponentBoundEvent_OneshotIndex' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_6) == 0x00008C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_SwitchName_CmpSuccess) == 0x00008D, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x000090, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetVehicleSurfaceType_Surface_ID) == 0x000098, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetVehicleSurfaceType_Surface_ID' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Start) == 0x00009C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Enter) == 0x00009D, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Enter' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000A0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsPlaying_ReturnValue) == 0x0000A4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsPlaying_ReturnValue_1) == 0x0000A5, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x0000A6, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable_1) == 0x0000A8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave_1) == 0x0000B0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_7) == 0x0000B9, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_K2_GetRootComponent_ReturnValue_4) == 0x0000C0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_K2_GetRootComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_UpShift) == 0x0000C8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_UpShift' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000DC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X_1) == 0x0000EC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y_1) == 0x0000F0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Is_Entering_Water) == 0x0000F4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Is_Entering_Water' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_8) == 0x0000F5, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x0000F8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_CalculateRPMWobbleRange_ReturnValue) == 0x000100, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_CalculateRPMWobbleRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetFloatValue_ReturnValue) == 0x000108, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_FMin_ReturnValue) == 0x00010C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_FMax_ReturnValue) == 0x000110, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_MapRangeClamped_ReturnValue) == 0x000114, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X_2) == 0x000118, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y_2) == 0x00011C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000120, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_X_3) == 0x000124, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_BreakVector2D_Y_3) == 0x000128, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000130, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000134, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Bone_Name_1) == 0x000138, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Bone_Name_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_9) == 0x000140, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSkeletalMeshComponent_ReturnValue_1) == 0x000148, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSocketLocation_ReturnValue) == 0x000150, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Bone_Name) == 0x00015C, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Bone_Name' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000164, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Damage_Value) == 0x000170, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Damage_Value' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000178, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000180, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CustomEvent_Loaded_3) == 0x000188, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_10) == 0x000190, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000198, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001A0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0001B0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001BC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_11) == 0x0001C0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001C1, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0001D4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x0001D8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_12) == 0x0001E1, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0001E4, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, CallFunc_IsValid_ReturnValue_13) == 0x0001E8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_ImpactPoint) == 0x0001EC, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_Event_Impact_Point) == 0x0001F8, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_Event_Impact_Point' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000204, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, Temp_object_Variable_2) == 0x000218, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent, K2Node_DynamicCast_AsSound_Wave_2) == 0x000220, "Member 'BP_Valet_AudioController_Parent_C_ExecuteUbergraph_BP_Valet_AudioController_Parent::K2Node_DynamicCast_AsSound_Wave_2' has a wrong offset!");
