#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZippyTroutTrap_Floor

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.ExecuteUbergraph_BP_ZippyTroutTrap_Floor
// 0x0600 (0x0600 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00A0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0130(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x02F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0370(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40B[0x1];                                      // 0x040B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0448(0x00C0)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50B[0x5];                                      // 0x050B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Socket_Name;                    // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0530(0x0010)(ReferenceParm)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Vector;                         // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_1;                          // 0x0560(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_2;                          // 0x0580(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue_1;               // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Temp_object_Variable;                              // 0x05D8(0x0010)(ConstParm, ReferenceParm)
	TArray<class AFortPlayerController*>          Temp_object_Variable_1;                            // 0x05E8(0x0010)(ConstParm, ReferenceParm)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor) == 0x000010, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor) == 0x000600, "Wrong size on BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, EntryPoint) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000004, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000090, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000094, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000A0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_X) == 0x000120, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_Y) == 0x000124, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_Z) == 0x000128, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_2) == 0x000130, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001B0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001B4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_MakeVector_ReturnValue) == 0x0001B8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_MakeVector_ReturnValue_1) == 0x0001C4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0001D0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x0001DC, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001F0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_5) == 0x0002F0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_6) == 0x000370, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_1) == 0x0003F0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array) == 0x0003F8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000408, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000409, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_bool_Has_Been_Initd_Variable) == 0x00040A, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00040C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000418, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000420, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00042C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000438, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_GameplayCueEvent_EventType) == 0x000444, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_GameplayCueEvent_Parameters) == 0x000448, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_SwitchEnum_CmpSuccess) == 0x000508, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_2) == 0x000509, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_3) == 0x00050A, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000510, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000518, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_bool_IsClosed_Variable) == 0x000524, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_CustomEvent_Socket_Name) == 0x000528, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_CustomEvent_Socket_Name' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetAllSocketNames_ReturnValue) == 0x000530, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000540, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Add_FloatFloat_ReturnValue) == 0x000544, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_CustomEvent_Vector) == 0x000548, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_CustomEvent_Vector' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000554, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array_1) == 0x000560, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetActorTeam_ReturnValue) == 0x000570, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000574, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array_2) == 0x000580, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetActorTeam_ReturnValue_1) == 0x000590, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetActorTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_float_Variable) == 0x000594, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000598, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0005A0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_4) == 0x0005A8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetCameraLocation_ReturnValue) == 0x0005AC, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0005B8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_VSize_ReturnValue) == 0x0005C4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0005C8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0005D0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_object_Variable) == 0x0005D8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_object_Variable_1) == 0x0005E8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0005F8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.Jiggle
// 0x000C (0x000C - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_Jiggle final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_Jiggle) == 0x000004, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_Jiggle");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_Jiggle) == 0x00000C, "Wrong size on BP_ZippyTroutTrap_Floor_C_Jiggle");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_Jiggle, Vector) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_Jiggle::Vector' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.MuzzleFire
// 0x0008 (0x0008 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_MuzzleFire final
{
public:
	class FName                                   Socket_Name;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_MuzzleFire) == 0x000004, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_MuzzleFire");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_MuzzleFire) == 0x000008, "Wrong size on BP_ZippyTroutTrap_Floor_C_MuzzleFire");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_MuzzleFire, Socket_Name) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_MuzzleFire::Socket_Name' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C8, "Wrong size on BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C. ChangeToFriendlyMaterial
// 0x0030 (0x0030 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial) == 0x000008, "Wrong alignment on BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial) == 0x000030, "Wrong size on BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000008, "Member 'BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
