#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_LandingPageButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.ExecuteUbergraph_BPS18_LandingPageButton
// 0x0058 (0x0058 - 0x0000)
struct BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwnsSubsciption;                     // 0x0038(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_Texture;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsLocked;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsDelayed;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton) == 0x000008, "Wrong alignment on BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton");
static_assert(sizeof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton) == 0x000058, "Wrong size on BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, EntryPoint) == 0x000000, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, Temp_byte_Variable) == 0x000004, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, Temp_byte_Variable_1) == 0x000005, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_Event_IsDesignTime) == 0x000006, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, Temp_bool_Variable) == 0x000007, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_Event_bOwnsSubsciption) == 0x000038, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_Event_bOwnsSubsciption' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_Event_Texture) == 0x000040, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000048, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_CustomEvent_IsLocked) == 0x000050, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_CustomEvent_IsLocked' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_CustomEvent_IsDelayed) == 0x000051, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_CustomEvent_IsDelayed' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, CallFunc_BooleanOR_ReturnValue) == 0x000052, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton, K2Node_Select_Default) == 0x000053, "Member 'BPS18_LandingPageButton_C_ExecuteUbergraph_BPS18_LandingPageButton::K2Node_Select_Default' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.SetPageDelayed
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPageButton_C_SetPageDelayed final
{
public:
	bool                                          IsDelayed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS18_LandingPageButton_C_SetPageDelayed) == 0x000001, "Wrong alignment on BPS18_LandingPageButton_C_SetPageDelayed");
static_assert(sizeof(BPS18_LandingPageButton_C_SetPageDelayed) == 0x000001, "Wrong size on BPS18_LandingPageButton_C_SetPageDelayed");
static_assert(offsetof(BPS18_LandingPageButton_C_SetPageDelayed, IsDelayed) == 0x000000, "Member 'BPS18_LandingPageButton_C_SetPageDelayed::IsDelayed' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.SetPageLocked
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPageButton_C_SetPageLocked final
{
public:
	bool                                          IsLocked_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS18_LandingPageButton_C_SetPageLocked) == 0x000001, "Wrong alignment on BPS18_LandingPageButton_C_SetPageLocked");
static_assert(sizeof(BPS18_LandingPageButton_C_SetPageLocked) == 0x000001, "Wrong size on BPS18_LandingPageButton_C_SetPageLocked");
static_assert(offsetof(BPS18_LandingPageButton_C_SetPageLocked, IsLocked_0) == 0x000000, "Member 'BPS18_LandingPageButton_C_SetPageLocked::IsLocked_0' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.OnSubscriptionTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded) == 0x000008, "Wrong alignment on BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded");
static_assert(sizeof(BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded) == 0x000008, "Wrong size on BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded");
static_assert(offsetof(BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded, Texture) == 0x000000, "Member 'BPS18_LandingPageButton_C_OnSubscriptionTextureLoaded::Texture' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.OnSubscriptionOwnershipUpdated
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated final
{
public:
	bool                                          bOwnsSubsciption;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated) == 0x000001, "Wrong alignment on BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated");
static_assert(sizeof(BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated) == 0x000001, "Wrong size on BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated");
static_assert(offsetof(BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated, bOwnsSubsciption) == 0x000000, "Member 'BPS18_LandingPageButton_C_OnSubscriptionOwnershipUpdated::bOwnsSubsciption' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS18_LandingPageButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS18_LandingPageButton_C_PreConstruct) == 0x000001, "Wrong alignment on BPS18_LandingPageButton_C_PreConstruct");
static_assert(sizeof(BPS18_LandingPageButton_C_PreConstruct) == 0x000001, "Wrong size on BPS18_LandingPageButton_C_PreConstruct");
static_assert(offsetof(BPS18_LandingPageButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS18_LandingPageButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPS18_LandingPageButton.BPS18_LandingPageButton_C.Play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LandingPageButton_C_Play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LandingPageButton_C_Play_intro) == 0x000008, "Wrong alignment on BPS18_LandingPageButton_C_Play_intro");
static_assert(sizeof(BPS18_LandingPageButton_C_Play_intro) == 0x000008, "Wrong size on BPS18_LandingPageButton_C_Play_intro");
static_assert(offsetof(BPS18_LandingPageButton_C_Play_intro, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'BPS18_LandingPageButton_C_Play_intro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

