#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_AboutModal_Pip

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPS18_AboutModal_Pip.BPS18_AboutModal_Pip_C.ExecuteUbergraph_BPS18_AboutModal_Pip
// 0x0018 (0x0018 - 0x0000)
struct BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip) == 0x000008, "Wrong alignment on BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip");
static_assert(sizeof(BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip) == 0x000018, "Wrong size on BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip");
static_assert(offsetof(BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip, EntryPoint) == 0x000000, "Member 'BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'BPS18_AboutModal_Pip_C_ExecuteUbergraph_BPS18_AboutModal_Pip::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function BPS18_AboutModal_Pip.BPS18_AboutModal_Pip_C.Is focused
// 0x0018 (0x0018 - 0x0000)
struct BPS18_AboutModal_Pip_C_Is_focused final
{
public:
	bool                                          Is_focused_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_AboutModal_Pip_C_Is_focused) == 0x000008, "Wrong alignment on BPS18_AboutModal_Pip_C_Is_focused");
static_assert(sizeof(BPS18_AboutModal_Pip_C_Is_focused) == 0x000018, "Wrong size on BPS18_AboutModal_Pip_C_Is_focused");
static_assert(offsetof(BPS18_AboutModal_Pip_C_Is_focused, Is_focused_0) == 0x000000, "Member 'BPS18_AboutModal_Pip_C_Is_focused::Is_focused_0' has a wrong offset!");
static_assert(offsetof(BPS18_AboutModal_Pip_C_Is_focused, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'BPS18_AboutModal_Pip_C_Is_focused::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_AboutModal_Pip_C_Is_focused, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'BPS18_AboutModal_Pip_C_Is_focused::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

