#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_HoldableCloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_HoldableCloseButton.BPS18_HoldableCloseButton_C
// 0x0088 (0x0CD8 - 0x0C50)
class UBPS18_HoldableCloseButton_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GamepadProgress;                             // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_input;                                     // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_50;                                    // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_KBM;                                       // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextButton_Text;                                   // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0CA8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Min_Desired_Width;                              // 0x0CC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Min_Desired_Height;                             // 0x0CC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hold_Completed;                                    // 0x0CC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BPS18_HoldableCloseButton(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void BP_OnPressed();
	void BP_OnHoldReset();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldCompleted();
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void UpdateTextAndStyle(ECommonInputType Input_Type);
	void Update_style(bool Using_Gamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_HoldableCloseButton_C">();
	}
	static class UBPS18_HoldableCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_HoldableCloseButton_C>();
	}
};
static_assert(alignof(UBPS18_HoldableCloseButton_C) == 0x000008, "Wrong alignment on UBPS18_HoldableCloseButton_C");
static_assert(sizeof(UBPS18_HoldableCloseButton_C) == 0x000CD8, "Wrong size on UBPS18_HoldableCloseButton_C");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, UberGraphFrame) == 0x000C50, "Member 'UBPS18_HoldableCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, Hover) == 0x000C58, "Member 'UBPS18_HoldableCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, HoldCompleted) == 0x000C60, "Member 'UBPS18_HoldableCloseButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, HoldProgress) == 0x000C68, "Member 'UBPS18_HoldableCloseButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, Image_Background) == 0x000C70, "Member 'UBPS18_HoldableCloseButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, Image_GamepadProgress) == 0x000C78, "Member 'UBPS18_HoldableCloseButton_C::Image_GamepadProgress' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, Overlay_input) == 0x000C80, "Member 'UBPS18_HoldableCloseButton_C::Overlay_input' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, ProgressBar_50) == 0x000C88, "Member 'UBPS18_HoldableCloseButton_C::ProgressBar_50' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, SizeBox_Height) == 0x000C90, "Member 'UBPS18_HoldableCloseButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, SizeBox_KBM) == 0x000C98, "Member 'UBPS18_HoldableCloseButton_C::SizeBox_KBM' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, TextButton_Text) == 0x000CA0, "Member 'UBPS18_HoldableCloseButton_C::TextButton_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, In_Text) == 0x000CA8, "Member 'UBPS18_HoldableCloseButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, In_Min_Desired_Width) == 0x000CC0, "Member 'UBPS18_HoldableCloseButton_C::In_Min_Desired_Width' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, In_Min_Desired_Height) == 0x000CC4, "Member 'UBPS18_HoldableCloseButton_C::In_Min_Desired_Height' has a wrong offset!");
static_assert(offsetof(UBPS18_HoldableCloseButton_C, Hold_Completed) == 0x000CC8, "Member 'UBPS18_HoldableCloseButton_C::Hold_Completed' has a wrong offset!");

}

