#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_GetAllButton

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_GetAllButton.BPS18_GetAllButton_C
// 0x0058 (0x0C28 - 0x0BD0)
class UBPS18_GetAllButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText;                                          // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   MainText_hover;                                    // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_23;                                        // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_input;                                     // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Page_Complete;                                     // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPS18_GetAllButton(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Set_Text_Data(bool Page_Complete_0, int32 Starting_Page, int32 Ending_Page, int32 Cost);
	void UpdateTextAndStyle(ECommonInputType Input_Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_GetAllButton_C">();
	}
	static class UBPS18_GetAllButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_GetAllButton_C>();
	}
};
static_assert(alignof(UBPS18_GetAllButton_C) == 0x000008, "Wrong alignment on UBPS18_GetAllButton_C");
static_assert(sizeof(UBPS18_GetAllButton_C) == 0x000C28, "Wrong size on UBPS18_GetAllButton_C");
static_assert(offsetof(UBPS18_GetAllButton_C, UberGraphFrame) == 0x000BD0, "Member 'UBPS18_GetAllButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Hover) == 0x000BD8, "Member 'UBPS18_GetAllButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Image) == 0x000BE0, "Member 'UBPS18_GetAllButton_C::Image' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Image_34) == 0x000BE8, "Member 'UBPS18_GetAllButton_C::Image_34' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Image_Hover) == 0x000BF0, "Member 'UBPS18_GetAllButton_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, MainText) == 0x000BF8, "Member 'UBPS18_GetAllButton_C::MainText' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, MainText_hover) == 0x000C00, "Member 'UBPS18_GetAllButton_C::MainText_hover' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Overlay_23) == 0x000C08, "Member 'UBPS18_GetAllButton_C::Overlay_23' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Overlay_input) == 0x000C10, "Member 'UBPS18_GetAllButton_C::Overlay_input' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, SizeBox_0) == 0x000C18, "Member 'UBPS18_GetAllButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS18_GetAllButton_C, Page_Complete) == 0x000C20, "Member 'UBPS18_GetAllButton_C::Page_Complete' has a wrong offset!");

}

