#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_LandingPage_SmallButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_LandingPage_SmallButton.BPS18_LandingPage_SmallButton_C
// 0x00E8 (0x0D50 - 0x0C68)
class UBPS18_LandingPage_SmallButton_C final : public UBattlePassLandingPageButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       burst;                                             // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_large;                                    // 0x0C80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_LR;                                 // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_TB;                                 // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shine;                                       // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_BP;                                        // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0CC8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            In_Color_and_Opacity;                              // 0x0CE0(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInterface*                     Material;                                          // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Show_BP_icon;                                      // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   In_SubText;                                        // 0x0D18(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Empty;                                             // 0x0D30(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Title_Font_Size;                                   // 0x0D48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS18_LandingPage_SmallButton(int32 EntryPoint);
	void OnInitialized();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void Play_intro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_LandingPage_SmallButton_C">();
	}
	static class UBPS18_LandingPage_SmallButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_LandingPage_SmallButton_C>();
	}
};
static_assert(alignof(UBPS18_LandingPage_SmallButton_C) == 0x000008, "Wrong alignment on UBPS18_LandingPage_SmallButton_C");
static_assert(sizeof(UBPS18_LandingPage_SmallButton_C) == 0x000D50, "Wrong size on UBPS18_LandingPage_SmallButton_C");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, UberGraphFrame) == 0x000C68, "Member 'UBPS18_LandingPage_SmallButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Intro) == 0x000C70, "Member 'UBPS18_LandingPage_SmallButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, burst) == 0x000C78, "Member 'UBPS18_LandingPage_SmallButton_C::burst' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Selected_large) == 0x000C80, "Member 'UBPS18_LandingPage_SmallButton_C::Selected_large' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Image_57) == 0x000C88, "Member 'UBPS18_LandingPage_SmallButton_C::Image_57' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Image_material) == 0x000C90, "Member 'UBPS18_LandingPage_SmallButton_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Image_selected_LR) == 0x000C98, "Member 'UBPS18_LandingPage_SmallButton_C::Image_selected_LR' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Image_selected_TB) == 0x000CA0, "Member 'UBPS18_LandingPage_SmallButton_C::Image_selected_TB' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Image_Shine) == 0x000CA8, "Member 'UBPS18_LandingPage_SmallButton_C::Image_Shine' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, SizeBox_BP) == 0x000CB0, "Member 'UBPS18_LandingPage_SmallButton_C::SizeBox_BP' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Text_Subtitle) == 0x000CB8, "Member 'UBPS18_LandingPage_SmallButton_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Text_Title) == 0x000CC0, "Member 'UBPS18_LandingPage_SmallButton_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, In_Text) == 0x000CC8, "Member 'UBPS18_LandingPage_SmallButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, In_Color_and_Opacity) == 0x000CE0, "Member 'UBPS18_LandingPage_SmallButton_C::In_Color_and_Opacity' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Material) == 0x000D08, "Member 'UBPS18_LandingPage_SmallButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Show_BP_icon) == 0x000D10, "Member 'UBPS18_LandingPage_SmallButton_C::Show_BP_icon' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, In_SubText) == 0x000D18, "Member 'UBPS18_LandingPage_SmallButton_C::In_SubText' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Empty) == 0x000D30, "Member 'UBPS18_LandingPage_SmallButton_C::Empty' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPage_SmallButton_C, Title_Font_Size) == 0x000D48, "Member 'UBPS18_LandingPage_SmallButton_C::Title_Font_Size' has a wrong offset!");

}

