#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_TutorialTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BattlePassS18UI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_TutorialTooltip.BPS18_TutorialTooltip_C
// 0x00F8 (0x0390 - 0x0298)
class UBPS18_TutorialTooltip_C final : public UFortBattlePassTutorialTooltipS18
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       burstLoop;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxcontent;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            In_Brush;                                          // 0x02E0(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	EHorizontalAlignment                          In_Horizontal_Alignment;                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            In_Vertical_Alignment;                             // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       In_Transform;                                      // 0x036C(0x001C)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          Show_Icon;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Right;                                             // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS18_TutorialTooltip(int32 EntryPoint);
	void HideTooltip();
	void ShowTooltip();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_TutorialTooltip_C">();
	}
	static class UBPS18_TutorialTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_TutorialTooltip_C>();
	}
};
static_assert(alignof(UBPS18_TutorialTooltip_C) == 0x000008, "Wrong alignment on UBPS18_TutorialTooltip_C");
static_assert(sizeof(UBPS18_TutorialTooltip_C) == 0x000390, "Wrong size on UBPS18_TutorialTooltip_C");
static_assert(offsetof(UBPS18_TutorialTooltip_C, UberGraphFrame) == 0x000298, "Member 'UBPS18_TutorialTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, burstLoop) == 0x0002A0, "Member 'UBPS18_TutorialTooltip_C::burstLoop' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, Show) == 0x0002A8, "Member 'UBPS18_TutorialTooltip_C::Show' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, HorizontalBoxcontent) == 0x0002B0, "Member 'UBPS18_TutorialTooltip_C::HorizontalBoxcontent' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, Icon) == 0x0002B8, "Member 'UBPS18_TutorialTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, Image_Arrow) == 0x0002C0, "Member 'UBPS18_TutorialTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, In_Text) == 0x0002C8, "Member 'UBPS18_TutorialTooltip_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, In_Brush) == 0x0002E0, "Member 'UBPS18_TutorialTooltip_C::In_Brush' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, In_Horizontal_Alignment) == 0x000368, "Member 'UBPS18_TutorialTooltip_C::In_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, In_Vertical_Alignment) == 0x000369, "Member 'UBPS18_TutorialTooltip_C::In_Vertical_Alignment' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, In_Transform) == 0x00036C, "Member 'UBPS18_TutorialTooltip_C::In_Transform' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, Show_Icon) == 0x000388, "Member 'UBPS18_TutorialTooltip_C::Show_Icon' has a wrong offset!");
static_assert(offsetof(UBPS18_TutorialTooltip_C, Right) == 0x00038C, "Member 'UBPS18_TutorialTooltip_C::Right' has a wrong offset!");

}

