#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_ContextualButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_ContextualButton.BPS18_ContextualButton_C
// 0x00E0 (0x0D30 - 0x0C50)
class UBPS18_ContextualButton_C final : public UFortHoldableButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Button_text;                                       // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Progress;                                    // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Icon;                                       // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    UnbindedInputActionWidget;                         // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0CB0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         In_Width_Override;                                 // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x0CD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_CD9[0x7];                                      // 0x0CD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HoldProgressDMI;                                   // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_SubText;                                        // 0x0CE8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Show_BP_icon;                                      // 0x0D00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D01[0x3];                                      // 0x0D01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x0D04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         In_Height_Override;                                // 0x0D08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_D0C[0x4];                                      // 0x0D0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        FillingSoundAudioComponent;                        // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillingSoundOverride;                              // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillCompleteSoundOverride;                         // 0x0D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Font_Material;                                     // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS18_ContextualButton(int32 EntryPoint);
	void StopFillSound();
	void FillComplete();
	void PlayFillSound();
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnPressed();
	void BP_OnHoldReset();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldCompleted();
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_ContextualButton_C">();
	}
	static class UBPS18_ContextualButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_ContextualButton_C>();
	}
};
static_assert(alignof(UBPS18_ContextualButton_C) == 0x000008, "Wrong alignment on UBPS18_ContextualButton_C");
static_assert(sizeof(UBPS18_ContextualButton_C) == 0x000D30, "Wrong size on UBPS18_ContextualButton_C");
static_assert(offsetof(UBPS18_ContextualButton_C, UberGraphFrame) == 0x000C50, "Member 'UBPS18_ContextualButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, HoldCompleted) == 0x000C58, "Member 'UBPS18_ContextualButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, HoldProgress) == 0x000C60, "Member 'UBPS18_ContextualButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Hover) == 0x000C68, "Member 'UBPS18_ContextualButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Button_text) == 0x000C70, "Member 'UBPS18_ContextualButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Image_Icon) == 0x000C78, "Member 'UBPS18_ContextualButton_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Image_material) == 0x000C80, "Member 'UBPS18_ContextualButton_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Image_Progress) == 0x000C88, "Member 'UBPS18_ContextualButton_C::Image_Progress' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, SizeBox_0) == 0x000C90, "Member 'UBPS18_ContextualButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Spacer_Icon) == 0x000C98, "Member 'UBPS18_ContextualButton_C::Spacer_Icon' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Text_Subtitle) == 0x000CA0, "Member 'UBPS18_ContextualButton_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, UnbindedInputActionWidget) == 0x000CA8, "Member 'UBPS18_ContextualButton_C::UnbindedInputActionWidget' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, In_Text) == 0x000CB0, "Member 'UBPS18_ContextualButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, In_Width_Override) == 0x000CC8, "Member 'UBPS18_ContextualButton_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Material) == 0x000CD0, "Member 'UBPS18_ContextualButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Justification) == 0x000CD8, "Member 'UBPS18_ContextualButton_C::Justification' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, HoldProgressDMI) == 0x000CE0, "Member 'UBPS18_ContextualButton_C::HoldProgressDMI' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, In_SubText) == 0x000CE8, "Member 'UBPS18_ContextualButton_C::In_SubText' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Show_BP_icon) == 0x000D00, "Member 'UBPS18_ContextualButton_C::Show_BP_icon' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Size) == 0x000D04, "Member 'UBPS18_ContextualButton_C::Size' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, In_Height_Override) == 0x000D08, "Member 'UBPS18_ContextualButton_C::In_Height_Override' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, FillingSoundAudioComponent) == 0x000D10, "Member 'UBPS18_ContextualButton_C::FillingSoundAudioComponent' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, FillingSoundOverride) == 0x000D18, "Member 'UBPS18_ContextualButton_C::FillingSoundOverride' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, FillCompleteSoundOverride) == 0x000D20, "Member 'UBPS18_ContextualButton_C::FillCompleteSoundOverride' has a wrong offset!");
static_assert(offsetof(UBPS18_ContextualButton_C, Font_Material) == 0x000D28, "Member 'UBPS18_ContextualButton_C::Font_Material' has a wrong offset!");

}

