#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_LandingPageButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "BattlePassBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS18_LandingPageButton.BPS18_LandingPageButton_C
// 0x00D8 (0x0D40 - 0x0C68)
class UBPS18_LandingPageButton_C final : public UBattlePassLandingPageButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       burst;                                             // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0C80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                ExtraSpace;                                        // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock_Purple;                                 // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_LR;                                 // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_selected_TB;                                 // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Title;                                    // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_locked;                                   // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x0CD0(0x0018)(Edit, BlueprintVisible)
	ETextJustify                                  Justification;                                     // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_CE9[0x7];                                      // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              In_Size;                                           // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Extra_Space;                                       // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLocked;                                          // 0x0D04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D05[0x3];                                      // 0x0D05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Empty_text;                                        // 0x0D08(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TimeGated;                                         // 0x0D20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D21[0x7];                                      // 0x0D21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_SubscriptionOwned;                            // 0x0D28(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BPS18_LandingPageButton(int32 EntryPoint);
	void UpdateStatusIcons();
	void SetPageDelayed(bool IsDelayed);
	void SetPageLocked(bool IsLocked_0);
	void OnSubscriptionTextureLoaded(class UTexture2D* Texture);
	void OnSubscriptionOwnershipUpdated(const bool bOwnsSubsciption);
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnInitialized();
	void Play_intro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS18_LandingPageButton_C">();
	}
	static class UBPS18_LandingPageButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS18_LandingPageButton_C>();
	}
};
static_assert(alignof(UBPS18_LandingPageButton_C) == 0x000008, "Wrong alignment on UBPS18_LandingPageButton_C");
static_assert(sizeof(UBPS18_LandingPageButton_C) == 0x000D40, "Wrong size on UBPS18_LandingPageButton_C");
static_assert(offsetof(UBPS18_LandingPageButton_C, UberGraphFrame) == 0x000C68, "Member 'UBPS18_LandingPageButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, burst) == 0x000C70, "Member 'UBPS18_LandingPageButton_C::burst' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Intro) == 0x000C78, "Member 'UBPS18_LandingPageButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Selected) == 0x000C80, "Member 'UBPS18_LandingPageButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, ExtraSpace) == 0x000C88, "Member 'UBPS18_LandingPageButton_C::ExtraSpace' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image) == 0x000C90, "Member 'UBPS18_LandingPageButton_C::Image' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image_32) == 0x000C98, "Member 'UBPS18_LandingPageButton_C::Image_32' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image_Background) == 0x000CA0, "Member 'UBPS18_LandingPageButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image_Lock_Purple) == 0x000CA8, "Member 'UBPS18_LandingPageButton_C::Image_Lock_Purple' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image_selected_LR) == 0x000CB0, "Member 'UBPS18_LandingPageButton_C::Image_selected_LR' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Image_selected_TB) == 0x000CB8, "Member 'UBPS18_LandingPageButton_C::Image_selected_TB' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, RichText_Title) == 0x000CC0, "Member 'UBPS18_LandingPageButton_C::RichText_Title' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Switcher_locked) == 0x000CC8, "Member 'UBPS18_LandingPageButton_C::Switcher_locked' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Title_Text) == 0x000CD0, "Member 'UBPS18_LandingPageButton_C::Title_Text' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Justification) == 0x000CE8, "Member 'UBPS18_LandingPageButton_C::Justification' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Material) == 0x000CF0, "Member 'UBPS18_LandingPageButton_C::Material' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, In_Size) == 0x000CF8, "Member 'UBPS18_LandingPageButton_C::In_Size' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Extra_Space) == 0x000D00, "Member 'UBPS18_LandingPageButton_C::Extra_Space' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, IsLocked) == 0x000D04, "Member 'UBPS18_LandingPageButton_C::IsLocked' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Empty_text) == 0x000D08, "Member 'UBPS18_LandingPageButton_C::Empty_text' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, TimeGated) == 0x000D20, "Member 'UBPS18_LandingPageButton_C::TimeGated' has a wrong offset!");
static_assert(offsetof(UBPS18_LandingPageButton_C, Text_SubscriptionOwned) == 0x000D28, "Member 'UBPS18_LandingPageButton_C::Text_SubscriptionOwned' has a wrong offset!");

}

