#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_LobbySeasonalResources

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPS18_LobbySeasonalResources.BPS18_LobbySeasonalResources_C.ExecuteUbergraph_BPS18_LobbySeasonalResources
// 0x0020 (0x0020 - 0x0000)
struct BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Rewards;                              // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Rewards_1;                            // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources) == 0x000008, "Wrong alignment on BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources");
static_assert(sizeof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources) == 0x000020, "Wrong size on BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources, EntryPoint) == 0x000000, "Member 'BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources, K2Node_Event_Rewards) == 0x000010, "Member 'BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources::K2Node_Event_Rewards' has a wrong offset!");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources, K2Node_Event_Rewards_1) == 0x000014, "Member 'BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources::K2Node_Event_Rewards_1' has a wrong offset!");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'BPS18_LobbySeasonalResources_C_ExecuteUbergraph_BPS18_LobbySeasonalResources::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function BPS18_LobbySeasonalResources.BPS18_LobbySeasonalResources_C.BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_MobileButton_19_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS18_LobbySeasonalResources.BPS18_LobbySeasonalResources_C.BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS18_LobbySeasonalResources_C_BndEvt__MoreInfo_Ressources_Button_67_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS18_LobbySeasonalResources.BPS18_LobbySeasonalResources_C.OnBattleStarRewardsSet
// 0x0004 (0x0004 - 0x0000)
struct BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet final
{
public:
	int32                                         Rewards;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet) == 0x000004, "Wrong alignment on BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet");
static_assert(sizeof(BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet) == 0x000004, "Wrong size on BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet, Rewards) == 0x000000, "Member 'BPS18_LobbySeasonalResources_C_OnBattleStarRewardsSet::Rewards' has a wrong offset!");

// Function BPS18_LobbySeasonalResources.BPS18_LobbySeasonalResources_C.OnStylePointsRewardsSet
// 0x0004 (0x0004 - 0x0000)
struct BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet final
{
public:
	int32                                         Rewards;                                           // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet) == 0x000004, "Wrong alignment on BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet");
static_assert(sizeof(BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet) == 0x000004, "Wrong size on BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet");
static_assert(offsetof(BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet, Rewards) == 0x000000, "Member 'BPS18_LobbySeasonalResources_C_OnStylePointsRewardsSet::Rewards' has a wrong offset!");

}

