#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS18_BuyResourcesBundleCheckBox

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS18_BuyResourcesBundleCheckBox.BPS18_BuyResourcesBundleCheckBox_C.ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox
// 0x0038 (0x0038 - 0x0000)
struct BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsChecked;                        // 0x001A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox) == 0x000008, "Wrong alignment on BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox");
static_assert(sizeof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox) == 0x000038, "Wrong size on BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, EntryPoint) == 0x000000, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, Temp_bool_Variable) == 0x000004, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, Temp_byte_Variable) == 0x000018, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, Temp_byte_Variable_1) == 0x000019, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, K2Node_Event_bNewIsChecked) == 0x00001A, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::K2Node_Event_bNewIsChecked' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, K2Node_Select_Default) == 0x00001B, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000030, "Member 'BPS18_BuyResourcesBundleCheckBox_C_ExecuteUbergraph_BPS18_BuyResourcesBundleCheckBox::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function BPS18_BuyResourcesBundleCheckBox.BPS18_BuyResourcesBundleCheckBox_C.OnStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged final
{
public:
	bool                                          bNewIsChecked;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged) == 0x000001, "Wrong alignment on BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged");
static_assert(sizeof(BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged) == 0x000001, "Wrong size on BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged");
static_assert(offsetof(BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged, bNewIsChecked) == 0x000000, "Member 'BPS18_BuyResourcesBundleCheckBox_C_OnStateChanged::bNewIsChecked' has a wrong offset!");

}

