#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_SpookyMist

#include "Basic.hpp"

#include "CBGA_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBGA_SpookyMist.CBGA_SpookyMist_C
// 0x0040 (0x0AD0 - 0x0A90)
class ACBGA_SpookyMist_C final : public ACBGA_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CBGA_SpookyMist_C;                  // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PickupBeam;                                        // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientLooping;                                    // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Mist;                                              // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DropObjectTags;                                    // 0x0AB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CBGA_SpookyMist(int32 EntryPoint);
	void BlueprintOnBeginInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CBGA_SpookyMist_C">();
	}
	static class ACBGA_SpookyMist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_SpookyMist_C>();
	}
};
static_assert(alignof(ACBGA_SpookyMist_C) == 0x000010, "Wrong alignment on ACBGA_SpookyMist_C");
static_assert(sizeof(ACBGA_SpookyMist_C) == 0x000AD0, "Wrong size on ACBGA_SpookyMist_C");
static_assert(offsetof(ACBGA_SpookyMist_C, UberGraphFrame_CBGA_SpookyMist_C) == 0x000A88, "Member 'ACBGA_SpookyMist_C::UberGraphFrame_CBGA_SpookyMist_C' has a wrong offset!");
static_assert(offsetof(ACBGA_SpookyMist_C, PickupBeam) == 0x000A90, "Member 'ACBGA_SpookyMist_C::PickupBeam' has a wrong offset!");
static_assert(offsetof(ACBGA_SpookyMist_C, AmbientLooping) == 0x000A98, "Member 'ACBGA_SpookyMist_C::AmbientLooping' has a wrong offset!");
static_assert(offsetof(ACBGA_SpookyMist_C, Mist) == 0x000AA0, "Member 'ACBGA_SpookyMist_C::Mist' has a wrong offset!");
static_assert(offsetof(ACBGA_SpookyMist_C, Capsule) == 0x000AA8, "Member 'ACBGA_SpookyMist_C::Capsule' has a wrong offset!");
static_assert(offsetof(ACBGA_SpookyMist_C, DropObjectTags) == 0x000AB0, "Member 'ACBGA_SpookyMist_C::DropObjectTags' has a wrong offset!");

}

