#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircleArrowButton_ItemShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CircleArrowButton_ItemShop.CircleArrowButton_ItemShop_C
// 0x0048 (0x0C68 - 0x0C20)
class UCircleArrowButton_ItemShop_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Click;                                             // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderSwapDirection;                               // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTranslateToAlign;                            // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Flip;                                              // 0x0C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InputActionOnSide;                                 // 0x0C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CircleArrowButton_ItemShop(int32 EntryPoint);
	void Construct();
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void UpdateArrowColor(const struct FLinearColor& Color, const struct FLinearColor& HoverColor);
	void SetMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CircleArrowButton_ItemShop_C">();
	}
	static class UCircleArrowButton_ItemShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircleArrowButton_ItemShop_C>();
	}
};
static_assert(alignof(UCircleArrowButton_ItemShop_C) == 0x000008, "Wrong alignment on UCircleArrowButton_ItemShop_C");
static_assert(sizeof(UCircleArrowButton_ItemShop_C) == 0x000C68, "Wrong size on UCircleArrowButton_ItemShop_C");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, UberGraphFrame) == 0x000C20, "Member 'UCircleArrowButton_ItemShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Click) == 0x000C28, "Member 'UCircleArrowButton_ItemShop_C::Click' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Hover) == 0x000C30, "Member 'UCircleArrowButton_ItemShop_C::Hover' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Backing) == 0x000C38, "Member 'UCircleArrowButton_ItemShop_C::Backing' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, BorderSwapDirection) == 0x000C40, "Member 'UCircleArrowButton_ItemShop_C::BorderSwapDirection' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, BorderTranslateToAlign) == 0x000C48, "Member 'UCircleArrowButton_ItemShop_C::BorderTranslateToAlign' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Image_Arrow) == 0x000C50, "Member 'UCircleArrowButton_ItemShop_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Shadow) == 0x000C58, "Member 'UCircleArrowButton_ItemShop_C::Shadow' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, Flip) == 0x000C60, "Member 'UCircleArrowButton_ItemShop_C::Flip' has a wrong offset!");
static_assert(offsetof(UCircleArrowButton_ItemShop_C, InputActionOnSide) == 0x000C61, "Member 'UCircleArrowButton_ItemShop_C::InputActionOnSide' has a wrong offset!");

}

