#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloseButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CloseButton.CloseButton_C
// 0x0080 (0x0CA8 - 0x0C28)
class UCloseButton_C final : public UBacchusCloseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhover;                                           // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0C70(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0C8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x0C90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CloseButton(int32 EntryPoint);
	void Construct();
	void BP_OnHovered();
	void HandleSize();
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CloseButton_C">();
	}
	static class UCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCloseButton_C>();
	}
};
static_assert(alignof(UCloseButton_C) == 0x000008, "Wrong alignment on UCloseButton_C");
static_assert(sizeof(UCloseButton_C) == 0x000CA8, "Wrong size on UCloseButton_C");
static_assert(offsetof(UCloseButton_C, UberGraphFrame) == 0x000C28, "Member 'UCloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Unhover) == 0x000C30, "Member 'UCloseButton_C::Unhover' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Pressed) == 0x000C38, "Member 'UCloseButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Hover) == 0x000C40, "Member 'UCloseButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Border_Container) == 0x000C48, "Member 'UCloseButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, ButtonBacking) == 0x000C50, "Member 'UCloseButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, CloseIcon) == 0x000C58, "Member 'UCloseButton_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, SizeBox_Control) == 0x000C60, "Member 'UCloseButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Text_ButtonAction) == 0x000C68, "Member 'UCloseButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Button_Description) == 0x000C70, "Member 'UCloseButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSizeOveride) == 0x000C88, "Member 'UCloseButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSize) == 0x000C8C, "Member 'UCloseButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Padding_Overide) == 0x000C90, "Member 'UCloseButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, PaddingOveride) == 0x000CA0, "Member 'UCloseButton_C::PaddingOveride' has a wrong offset!");

}

