#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryLobbyMatchmakingPlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay
// 0x0280 (0x0280 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingViolatorStyle                 K2Node_Event_NewViolatorStyle;                     // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCrossplayPromptContext*            CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCMSContext*                            CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsNewPlaylistInformationAvailable_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMatchmakingViolatorStyle                 Temp_byte_Variable_4;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCrossplayPromptContext*            CallFunc_GetContext_ReturnValue_2;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_PlayButtonText;                       // 0x0070(0x0018)(ConstParm)
	class FText                                   K2Node_Event_CancelButtonText;                     // 0x0088(0x0018)(ConstParm)
	struct FPlaylistFrontEndData                  K2Node_Event_NewPlaylist;                          // 0x00A0(0x0028)(ConstParm)
	class FText                                   K2Node_Event_PlaylistCMSOverrideName;              // 0x00C8(0x0018)(ConstParm)
	EFortLobbyType                                K2Node_Event_LobbyType;                            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              K2Node_Event_Playlist;                             // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCrossplayEnabled;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaylistLimitedPoolMatchmakingEnabled_ReturnValue; // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShow;                                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreModalsActive_ReturnValue;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0110(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction; // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatcmakingInteraction_HasInteraction;  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_1; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x0168(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class II_FrontendBackplateMatchmakingInteraction_C> K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_2; // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue_1;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocalPlayerPartyLeader_1;          // 0x01BB(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActivityBrowserLobbyTileButton_C*      K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserLobbyTileButton_C*      K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button_1; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocalPlayerPartyLeader;            // 0x01E1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserSoloButton_C*           K2Node_DynamicCast_AsActivity_Browser_Solo_Button; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserSoloButton_C*           K2Node_DynamicCast_AsActivity_Browser_Solo_Button_1; // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSquadFillEnabled_ReturnValue;           // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserMatchOptionButton_C*    K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPrivateMatchEnabled_ReturnValue;        // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivityBrowserMatchOptionButton_C*    K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button_1; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_Pick_Matchmaking_Succeeded_Sound_SelectedMatchmakingSucceededSound; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsCrossplayEnabled)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay) == 0x000008, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay) == 0x000280, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, EntryPoint) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_NewViolatorStyle) == 0x000004, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_NewViolatorStyle' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_bool_Variable) == 0x000005, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable) == 0x000006, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_1) == 0x000007, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_bool_Variable_1) == 0x000008, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_2) == 0x000009, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_3) == 0x00000A, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsNewPlaylistInformationAvailable_ReturnValue) == 0x000030, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsNewPlaylistInformationAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_4) == 0x000031, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_object_Variable) == 0x000038, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_object_Variable_1) == 0x000040, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_bool_Variable_2) == 0x000048, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_5) == 0x000049, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_6) == 0x00004A, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_bool_Variable_3) == 0x00004B, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default) == 0x000050, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_int_Array_Index_Variable) == 0x000058, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetContext_ReturnValue_2) == 0x000068, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_PlayButtonText) == 0x000070, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_PlayButtonText' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_CancelButtonText) == 0x000088, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_CancelButtonText' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_NewPlaylist) == 0x0000A0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_NewPlaylist' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_PlaylistCMSOverrideName) == 0x0000C8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_PlaylistCMSOverrideName' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_LobbyType) == 0x0000E0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_LobbyType' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_bSuccess) == 0x0000E1, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_Playlist) == 0x0000E8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_Playlist' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_CustomEvent_IsCrossplayEnabled) == 0x0000F0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_CustomEvent_IsCrossplayEnabled' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Not_PreBool_ReturnValue) == 0x0000F1, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsValid_ReturnValue) == 0x0000F2, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsPlaylistLimitedPoolMatchmakingEnabled_ReturnValue) == 0x0000F3, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsPlaylistLimitedPoolMatchmakingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_BooleanAND_ReturnValue) == 0x0000F4, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_bShow) == 0x0000F5, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000F8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_PlayAnimationForward_ReturnValue) == 0x000100, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000108, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_AreModalsActive_ReturnValue) == 0x000109, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_AreModalsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000110, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_int_Array_Index_Variable_1) == 0x000120, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Array_Get_Item) == 0x000128, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction) == 0x000138, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_HasMatcmakingInteraction_HasInteraction) == 0x000149, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_HasMatcmakingInteraction_HasInteraction' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_1) == 0x000150, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsValid_ReturnValue_1) == 0x000161, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetAllActorsWithInterface_OutActors_1) == 0x000168, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetAllActorsWithInterface_OutActors_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Array_Get_Item_1) == 0x000178, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Array_Length_ReturnValue_1) == 0x000180, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_2) == 0x000188, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsI_Frontend_Backplate_Matchmaking_Interaction_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Less_IntInt_ReturnValue_1) == 0x000199, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsValid_ReturnValue_2) == 0x00019A, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0001A0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsInZone_ReturnValue) == 0x0001A8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0001B0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsInZone_ReturnValue_1) == 0x0001B9, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsInZone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001BA, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_bIsLocalPlayerPartyLeader_1) == 0x0001BB, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_bIsLocalPlayerPartyLeader_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_ComponentBoundEvent_Button) == 0x0001C0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button) == 0x0001C8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_3) == 0x0001D0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button_1) == 0x0001D8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Lobby_Tile_Button_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_4) == 0x0001E0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Event_bIsLocalPlayerPartyLeader) == 0x0001E1, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Event_bIsLocalPlayerPartyLeader' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Solo_Button) == 0x0001E8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Solo_Button' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_5) == 0x0001F0, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Solo_Button_1) == 0x0001F8, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Solo_Button_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_6) == 0x000200, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default_1) == 0x000201, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default_2) == 0x000202, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsSquadFillEnabled_ReturnValue) == 0x000203, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsSquadFillEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button) == 0x000208, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_7) == 0x000210, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsPrivateMatchEnabled_ReturnValue) == 0x000211, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsPrivateMatchEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Not_PreBool_ReturnValue_3) == 0x000212, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button_1) == 0x000218, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_AsActivity_Browser_Match_Option_Button_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_DynamicCast_bSuccess_8) == 0x000220, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Pick_Matchmaking_Succeeded_Sound_SelectedMatchmakingSucceededSound) == 0x000228, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Pick_Matchmaking_Succeeded_Sound_SelectedMatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_CreateSound2D_ReturnValue) == 0x000230, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000238, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_7) == 0x000248, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_PlayAnimation_ReturnValue) == 0x000250, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000258, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000260, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000268, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_8) == 0x000269, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default_3) == 0x000270, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_IsValid_ReturnValue_3) == 0x000278, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_bool_Variable_4) == 0x000279, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default_4) == 0x00027A, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_9) == 0x00027B, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, Temp_byte_Variable_10) == 0x00027C, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00027D, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay, K2Node_Select_Default_5) == 0x00027E, "Member 'DiscoveryLobbyMatchmakingPlay_C_ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay::K2Node_Select_Default_5' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.OnViolatorStyleRefreshed
// 0x0001 (0x0001 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed final
{
public:
	EFortMatchmakingViolatorStyle                 NewViolatorStyle;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed) == 0x000001, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed) == 0x000001, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed, NewViolatorStyle) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_OnViolatorStyleRefreshed::NewViolatorStyle' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.OnPrivateMatchButtonEnabledStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated final
{
public:
	bool                                          bIsLocalPlayerPartyLeader;                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated) == 0x000001, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated) == 0x000001, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated, bIsLocalPlayerPartyLeader) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_OnPrivateMatchButtonEnabledStateUpdated::bIsLocalPlayerPartyLeader' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_BndEvt__Button_Play_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.OnSquadFillButtonEnabledStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated final
{
public:
	bool                                          bIsLocalPlayerPartyLeader;                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated) == 0x000001, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated) == 0x000001, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated, bIsLocalPlayerPartyLeader) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_OnSquadFillButtonEnabledStateUpdated::bIsLocalPlayerPartyLeader' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.ShouldShowMatchmakingDetails
// 0x0001 (0x0001 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails) == 0x000001, "Wrong alignment on DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails");
static_assert(sizeof(DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails) == 0x000001, "Wrong size on DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails");
static_assert(offsetof(DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails, bShow) == 0x000000, "Member 'DiscoveryLobbyMatchmakingPlay_C_ShouldShowMatchmakingDetails::bShow' has a wrong offset!");

// Function DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C.OnCrossplayPreferencesChanged
// 0x0001 (0x0001 - 0x0000)
struct DiscoveryLobbyMatchmakingPlay_C_OnCrossplayPreferencesChanged final
{
public:
	bool                                          IsCrossplayEnabled;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
