#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicHUD.DynamicHUDManager.AddScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicHUDManager_AddScene final
{
public:
	const class UDynamicHUDScene*                 Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicHUDManager_AddScene) == 0x000008, "Wrong alignment on DynamicHUDManager_AddScene");
static_assert(sizeof(DynamicHUDManager_AddScene) == 0x000010, "Wrong size on DynamicHUDManager_AddScene");
static_assert(offsetof(DynamicHUDManager_AddScene, Scene) == 0x000000, "Member 'DynamicHUDManager_AddScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicHUDManager_AddScene, OptionalContext) == 0x000008, "Member 'DynamicHUDManager_AddScene::OptionalContext' has a wrong offset!");

// Function DynamicHUD.DynamicHUDManager.AddScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicHUDManager_AddScenes final
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicHUDManager_AddScenes) == 0x000008, "Wrong alignment on DynamicHUDManager_AddScenes");
static_assert(sizeof(DynamicHUDManager_AddScenes) == 0x000018, "Wrong size on DynamicHUDManager_AddScenes");
static_assert(offsetof(DynamicHUDManager_AddScenes, Scenes) == 0x000000, "Member 'DynamicHUDManager_AddScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicHUDManager_AddScenes, OptionalContext) == 0x000010, "Member 'DynamicHUDManager_AddScenes::OptionalContext' has a wrong offset!");

// Function DynamicHUD.DynamicHUDManager.RemoveScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicHUDManager_RemoveScene final
{
public:
	const class UDynamicHUDScene*                 Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicHUDManager_RemoveScene) == 0x000008, "Wrong alignment on DynamicHUDManager_RemoveScene");
static_assert(sizeof(DynamicHUDManager_RemoveScene) == 0x000010, "Wrong size on DynamicHUDManager_RemoveScene");
static_assert(offsetof(DynamicHUDManager_RemoveScene, Scene) == 0x000000, "Member 'DynamicHUDManager_RemoveScene::Scene' has a wrong offset!");
static_assert(offsetof(DynamicHUDManager_RemoveScene, OptionalContext) == 0x000008, "Member 'DynamicHUDManager_RemoveScene::OptionalContext' has a wrong offset!");

// Function DynamicHUD.DynamicHUDManager.RemoveScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicHUDManager_RemoveScenes final
{
public:
	TArray<class UDynamicHUDScene*>               Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicHUDManager_RemoveScenes) == 0x000008, "Wrong alignment on DynamicHUDManager_RemoveScenes");
static_assert(sizeof(DynamicHUDManager_RemoveScenes) == 0x000018, "Wrong size on DynamicHUDManager_RemoveScenes");
static_assert(offsetof(DynamicHUDManager_RemoveScenes, Scenes) == 0x000000, "Member 'DynamicHUDManager_RemoveScenes::Scenes' has a wrong offset!");
static_assert(offsetof(DynamicHUDManager_RemoveScenes, OptionalContext) == 0x000010, "Member 'DynamicHUDManager_RemoveScenes::OptionalContext' has a wrong offset!");

}

