#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicHUD

#include "Basic.hpp"


namespace SDK
{

// Enum DynamicHUD.EDynamicHUDComparison
// NumValues: 0x0004
enum class EDynamicHUDComparison : uint8
{
	Equal                                    = 0,
	LessOrEqual                              = 1,
	GreaterOrEqual                           = 2,
	EDynamicHUDComparison_MAX                = 3,
};

// Enum DynamicHUD.EDynamicHUDOperator
// NumValues: 0x0003
enum class EDynamicHUDOperator : uint8
{
	Addition                                 = 0,
	Substraction                             = 1,
	EDynamicHUDOperator_MAX                  = 2,
};

// Enum DynamicHUD.EDynamicHUDSide
// NumValues: 0x0005
enum class EDynamicHUDSide : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	EDynamicHUDSide_MAX                      = 4,
};

// Enum DynamicHUD.EDynamicHUDAnchor
// NumValues: 0x000A
enum class EDynamicHUDAnchor : uint32
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	CenterLeft                               = 3,
	CenterCenter                             = 4,
	CenterRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
	EDynamicHUDAnchor_MAX                    = 9,
};

// Enum DynamicHUD.EDynamicHUDStrength
// NumValues: 0x0005
enum class EDynamicHUDStrength : uint8
{
	Weak                                     = 0,
	Medium                                   = 1,
	Strong                                   = 2,
	Required                                 = 3,
	EDynamicHUDStrength_MAX                  = 4,
};

// Enum DynamicHUD.EDynamicHUDZOrder
// NumValues: 0x0005
enum class EDynamicHUDZOrder : uint32
{
	Back                                     = 500,
	Middle                                   = 1000,
	Front                                    = 1500,
	Custom                                   = 2000,
	EDynamicHUDZOrder_MAX                    = 2001,
};

// ScriptStruct DynamicHUD.DynamicHUDConstraintWidgetFallback
// 0x0030 (0x0030 - 0x0000)
struct FDynamicHUDConstraintWidgetFallback final
{
public:
	TSoftClassPtr<class UClass>                   TargetWidget;                                      // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetUniqueID;                                    // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicHUDConstraintWidgetFallback) == 0x000008, "Wrong alignment on FDynamicHUDConstraintWidgetFallback");
static_assert(sizeof(FDynamicHUDConstraintWidgetFallback) == 0x000030, "Wrong size on FDynamicHUDConstraintWidgetFallback");
static_assert(offsetof(FDynamicHUDConstraintWidgetFallback, TargetWidget) == 0x000000, "Member 'FDynamicHUDConstraintWidgetFallback::TargetWidget' has a wrong offset!");
static_assert(offsetof(FDynamicHUDConstraintWidgetFallback, TargetUniqueID) == 0x000028, "Member 'FDynamicHUDConstraintWidgetFallback::TargetUniqueID' has a wrong offset!");

// ScriptStruct DynamicHUD.DirectorData
// 0x0038 (0x0038 - 0x0000)
struct FDirectorData final
{
public:
	TSoftClassPtr<class UClass>                   DirectorClass;                                     // 0x0000(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instance;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDirectorData) == 0x000008, "Wrong alignment on FDirectorData");
static_assert(sizeof(FDirectorData) == 0x000038, "Wrong size on FDirectorData");
static_assert(offsetof(FDirectorData, DirectorClass) == 0x000000, "Member 'FDirectorData::DirectorClass' has a wrong offset!");
static_assert(offsetof(FDirectorData, Instance) == 0x000028, "Member 'FDirectorData::Instance' has a wrong offset!");

// ScriptStruct DynamicHUD.ContextData
// 0x0010 (0x0010 - 0x0000)
struct FContextData final
{
public:
	TArray<TWeakObjectPtr<class UObject>>         Contexts;                                          // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FContextData) == 0x000008, "Wrong alignment on FContextData");
static_assert(sizeof(FContextData) == 0x000010, "Wrong size on FContextData");
static_assert(offsetof(FContextData, Contexts) == 0x000000, "Member 'FContextData::Contexts' has a wrong offset!");

// ScriptStruct DynamicHUD.DynamicHUDUnallowed
// 0x0038 (0x0038 - 0x0000)
struct FDynamicHUDUnallowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUniqueID;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UniqueId;                                          // 0x002C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAll;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDynamicHUDUnallowed) == 0x000008, "Wrong alignment on FDynamicHUDUnallowed");
static_assert(sizeof(FDynamicHUDUnallowed) == 0x000038, "Wrong size on FDynamicHUDUnallowed");
static_assert(offsetof(FDynamicHUDUnallowed, Widget) == 0x000000, "Member 'FDynamicHUDUnallowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicHUDUnallowed, bUseUniqueID) == 0x000028, "Member 'FDynamicHUDUnallowed::bUseUniqueID' has a wrong offset!");
static_assert(offsetof(FDynamicHUDUnallowed, UniqueId) == 0x00002C, "Member 'FDynamicHUDUnallowed::UniqueId' has a wrong offset!");
static_assert(offsetof(FDynamicHUDUnallowed, bIncludeAll) == 0x000034, "Member 'FDynamicHUDUnallowed::bIncludeAll' has a wrong offset!");

// ScriptStruct DynamicHUD.DynamicHUDAllowed
// 0x0048 (0x0048 - 0x0000)
struct FDynamicHUDAllowed final
{
public:
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDynamicHUDZOrder                             ZOrder;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomZOrder;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnique;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UniqueId;                                          // 0x0034(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSafeZone;                                      // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicHUDConstraintBase*              LayoutConstraint;                                  // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDynamicHUDAllowed) == 0x000008, "Wrong alignment on FDynamicHUDAllowed");
static_assert(sizeof(FDynamicHUDAllowed) == 0x000048, "Wrong size on FDynamicHUDAllowed");
static_assert(offsetof(FDynamicHUDAllowed, Widget) == 0x000000, "Member 'FDynamicHUDAllowed::Widget' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, ZOrder) == 0x000028, "Member 'FDynamicHUDAllowed::ZOrder' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, CustomZOrder) == 0x00002C, "Member 'FDynamicHUDAllowed::CustomZOrder' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, bIsUnique) == 0x000030, "Member 'FDynamicHUDAllowed::bIsUnique' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, UniqueId) == 0x000034, "Member 'FDynamicHUDAllowed::UniqueId' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, bUseSafeZone) == 0x00003C, "Member 'FDynamicHUDAllowed::bUseSafeZone' has a wrong offset!");
static_assert(offsetof(FDynamicHUDAllowed, LayoutConstraint) == 0x000040, "Member 'FDynamicHUDAllowed::LayoutConstraint' has a wrong offset!");

}

