#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyPawn_Parent_Deimos

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EnemyPawn_Parent_Deimos.EnemyPawn_Parent_Deimos_C
// 0x0330 (0x2A60 - 0x2730)
class AEnemyPawn_Parent_Deimos_C : public AFortAIPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundLibraryComponent*                 SoundLibrary;                                      // 0x2738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      WeaponCapsuleCollision;                            // 0x2740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Elemental_Layer_Audio_Loop;                        // 0x2748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94; // 0x2750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94; // 0x2754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94; // 0x2758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2759[0x7];                                     // 0x2759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Enemy_Spawn_Out_TL;                                // 0x2760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D; // 0x2768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D; // 0x276C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D; // 0x2770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2771[0x7];                                     // 0x2771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EnemySpawnInTL;                                    // 0x2778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SpawnParticlesTransform;                           // 0x2780(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        SpawnParticles;                                    // 0x27B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterElementalParticles;                       // 0x27B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowHeadshot;                                     // 0x27C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C1[0x7];                                     // 0x27C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_RangedWeapon;                                   // 0x27C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               HeadshotParticleSystemComp;                        // 0x27E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Additive_Hit_React_Montage;                        // 0x27F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Death_Normal_Sound;                                // 0x27F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Elemental_Audio_Layer_Sound;                       // 0x2800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Headshot_FX_Socket;                                // 0x2808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USkeletalMeshComponent*, class UFXSkeletonMeshComponent_C*> AwakenFXSkeletalMeshes;                            // 0x2810(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, class UFXStaticMeshComponent_C*> AwakenFXStaticMeshes;                              // 0x2860(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         AwokenMaxDistance;                                 // 0x28B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AwakenDuration;                                    // 0x28B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DestroyAwakenFXTimer;                              // 0x28B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class USkeletalMeshComponent*, class UFXSkeletonMeshComponent_C*> BuildingHitFXSkeletalMeshes;                       // 0x28C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, class UFXStaticMeshComponent_C*> BuildingHitFXStaticMeshes;                         // 0x2910(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         BuildingHitDuration;                               // 0x2960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2964[0x4];                                     // 0x2964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DestroyBuildingHitFXTimer;                         // 0x2968(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFXSkeletonMeshComponent_C*             TempFXSkeletalMesh;                                // 0x2970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         RegisteredSkeletalMeshesForEffects;                // 0x2978(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           RegisteredStaticMeshesForEffects;                  // 0x2988(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          HasGlowColorsAssigned;                             // 0x2998(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SpawnInTimelineCompletedSuccessfully;              // 0x2999(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299A[0x6];                                     // 0x299A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CharacterSpawnInSafetyCheckHandle;                 // 0x29A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Previous_MID;                                      // 0x29A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        CharacterAmbientParticlesTemplate;                 // 0x29B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CharacterAmbientParticles;                         // 0x29C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DuplicateCharacterMesh;                            // 0x29C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DuplicateCharacterMID;                             // 0x29D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Auxillary_Objects;                                 // 0x29D8(0x0010)(Edit, BlueprintVisible)
	TArray<class UObject*>                        Duplicate_Auxillary_Objects;                       // 0x29E8(0x0010)(Edit, BlueprintVisible)
	class UParticleSystemComponent*               MinibossPSComponent;                               // 0x29F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterParticlesMaxDrawDistance;                 // 0x2A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A04[0x4];                                     // 0x2A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              Original_Phys_Material;                            // 0x2A08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       Previous_MID_AuxObjs;                              // 0x2A18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Restoring_Array_Index;                             // 0x2A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHeadShotFX;                                     // 0x2A2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2D[0x3];                                     // 0x2A2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Death_Dematerialize_Sound;                         // 0x2A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HeadShot_Sound;                                    // 0x2A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditiveHitReactRetriggerDelay;                    // 0x2A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_SidewaysSpawnFx;                                // 0x2A44(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4C[0x4];                                     // 0x2A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleSoundLibraryContext*             SoundLibraryContext;                               // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_OnSpawnFX;                                      // 0x2A58(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EnemyPawn_Parent_Deimos(int32 EntryPoint);
	void OnBuildingHitPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, const struct FGameplayEffectContextHandle& EffectContext, bool bPlayerPlaced);
	void DestroyBuildingHitEffect();
	void AdditiveHitReactDelay();
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnStartedEncounterSpawn();
	void OnFinishedEncounterSpawn();
	void DebugEnemySpawnIn();
	void DespawnEnemy(const struct FVector& RiftLocationWS);
	void PostSpawnIn();
	void SpawnInSafetyCheck();
	void ManualEnemySpawnIn(const struct FVector& RiftLocationWS);
	void ManualDespawnEnemy(const struct FVector& RiftLocationWS);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnWaterDeepNavMeshEnter();
	void OnBeginDeepWaterInteraction(const struct FVector& WaterSurfaceLocation, float WaterDepth);
	void ReceiveBeginPlay();
	void TriggerDeathFX();
	void OnEndDance();
	void OnBeginDance();
	void EnemySpawnInTL__Spawn__EventFunc();
	void EnemySpawnInTL__UpdateFunc();
	void EnemySpawnInTL__FinishedFunc();
	void Enemy_Spawn_Out_TL__UpdateFunc();
	void Enemy_Spawn_Out_TL__FinishedFunc();
	void UserConstructionScript();
	void SetVectorParameterOnAllCharacterMIDs(class FName Parameter_Name, const struct FVector& Vector_Value, bool Propagate_to_Auxiliary_Meshes);
	void SetScalarParameterOnAllCharacterMIDs(class FName Parameter_Name, float Scalar_Value, bool AlsoModifyOriginalMIDs);
	void PlayAdditiveHitReacts(const struct FVector& Hit_Direction, class UAnimMontage* Anim_Montage);
	void SpawnParticleSystemOnCharacterMesh(class UParticleSystem* ParticleSystemTemplate, class UParticleSystemComponent* ParticleSystemComponentReferenceVar, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, TArray<struct FParticleSysParam>& InstanceParameters, bool AutoActivate, bool AutoDestroy, bool AbsoluteLocation, bool AbsoluteRotation, bool AbsoluteScale, class UParticleSystemComponent** PSComponentReference);
	void CharacterSpawnInSafetyCheck();
	void ApplyBuildingHitEffectToSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void ApplyBuildingHitEffectToStaticMesh(class UStaticMeshComponent* Mesh_0);
	void RegisterEffectSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void RegisterEffectStaticMesh(class UStaticMeshComponent* Mesh_0);
	void ApplyAwakenEffectToSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void ApplyAwakenEffectToStaticMesh(class UStaticMeshComponent* Mesh_0);
	void DeregisterEffectStaticMesh(class UStaticMeshComponent* Mesh_0);
	void DeregisterEffectSkeletalMesh(class USkeletalMeshComponent* Mesh_0);
	void PlaySoundLibraryAudio(const struct FGameplayTag& Event_Name);
	void Orphaned(bool* IsOrphaned, class AFortPawn** AttachedPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnemyPawn_Parent_Deimos_C">();
	}
	static class AEnemyPawn_Parent_Deimos_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnemyPawn_Parent_Deimos_C>();
	}
};
static_assert(alignof(AEnemyPawn_Parent_Deimos_C) == 0x000010, "Wrong alignment on AEnemyPawn_Parent_Deimos_C");
static_assert(sizeof(AEnemyPawn_Parent_Deimos_C) == 0x002A60, "Wrong size on AEnemyPawn_Parent_Deimos_C");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, UberGraphFrame) == 0x002730, "Member 'AEnemyPawn_Parent_Deimos_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SoundLibrary) == 0x002738, "Member 'AEnemyPawn_Parent_Deimos_C::SoundLibrary' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, WeaponCapsuleCollision) == 0x002740, "Member 'AEnemyPawn_Parent_Deimos_C::WeaponCapsuleCollision' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Elemental_Layer_Audio_Loop) == 0x002748, "Member 'AEnemyPawn_Parent_Deimos_C::Elemental_Layer_Audio_Loop' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94) == 0x002750, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL_ColorFadeOutTrack_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94) == 0x002754, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL_FadeInTrack_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94) == 0x002758, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL__Direction_37A083E44F5772C5FFF36680D2AD7D94' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Enemy_Spawn_Out_TL) == 0x002760, "Member 'AEnemyPawn_Parent_Deimos_C::Enemy_Spawn_Out_TL' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D) == 0x002768, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL_ColorFadeOutTrack_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D) == 0x00276C, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL_FadeInTrack_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D) == 0x002770, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL__Direction_515E6B424789F427A1B9ACAD857FFF5D' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, EnemySpawnInTL) == 0x002778, "Member 'AEnemyPawn_Parent_Deimos_C::EnemySpawnInTL' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnParticlesTransform) == 0x002780, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnParticlesTransform' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnParticles) == 0x0027B0, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterElementalParticles) == 0x0027B8, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterElementalParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AllowHeadshot) == 0x0027C0, "Member 'AEnemyPawn_Parent_Deimos_C::AllowHeadshot' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, TC_RangedWeapon) == 0x0027C8, "Member 'AEnemyPawn_Parent_Deimos_C::TC_RangedWeapon' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HeadshotParticleSystemComp) == 0x0027E8, "Member 'AEnemyPawn_Parent_Deimos_C::HeadshotParticleSystemComp' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Additive_Hit_React_Montage) == 0x0027F0, "Member 'AEnemyPawn_Parent_Deimos_C::Additive_Hit_React_Montage' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Death_Normal_Sound) == 0x0027F8, "Member 'AEnemyPawn_Parent_Deimos_C::Death_Normal_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Elemental_Audio_Layer_Sound) == 0x002800, "Member 'AEnemyPawn_Parent_Deimos_C::Elemental_Audio_Layer_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Headshot_FX_Socket) == 0x002808, "Member 'AEnemyPawn_Parent_Deimos_C::Headshot_FX_Socket' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenFXSkeletalMeshes) == 0x002810, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenFXSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenFXStaticMeshes) == 0x002860, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenFXStaticMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwokenMaxDistance) == 0x0028B0, "Member 'AEnemyPawn_Parent_Deimos_C::AwokenMaxDistance' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AwakenDuration) == 0x0028B4, "Member 'AEnemyPawn_Parent_Deimos_C::AwakenDuration' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DestroyAwakenFXTimer) == 0x0028B8, "Member 'AEnemyPawn_Parent_Deimos_C::DestroyAwakenFXTimer' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitFXSkeletalMeshes) == 0x0028C0, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitFXSkeletalMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitFXStaticMeshes) == 0x002910, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitFXStaticMeshes' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, BuildingHitDuration) == 0x002960, "Member 'AEnemyPawn_Parent_Deimos_C::BuildingHitDuration' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DestroyBuildingHitFXTimer) == 0x002968, "Member 'AEnemyPawn_Parent_Deimos_C::DestroyBuildingHitFXTimer' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, TempFXSkeletalMesh) == 0x002970, "Member 'AEnemyPawn_Parent_Deimos_C::TempFXSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, RegisteredSkeletalMeshesForEffects) == 0x002978, "Member 'AEnemyPawn_Parent_Deimos_C::RegisteredSkeletalMeshesForEffects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, RegisteredStaticMeshesForEffects) == 0x002988, "Member 'AEnemyPawn_Parent_Deimos_C::RegisteredStaticMeshesForEffects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HasGlowColorsAssigned) == 0x002998, "Member 'AEnemyPawn_Parent_Deimos_C::HasGlowColorsAssigned' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SpawnInTimelineCompletedSuccessfully) == 0x002999, "Member 'AEnemyPawn_Parent_Deimos_C::SpawnInTimelineCompletedSuccessfully' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterSpawnInSafetyCheckHandle) == 0x0029A0, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterSpawnInSafetyCheckHandle' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Previous_MID) == 0x0029A8, "Member 'AEnemyPawn_Parent_Deimos_C::Previous_MID' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterAmbientParticlesTemplate) == 0x0029B8, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterAmbientParticlesTemplate' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterAmbientParticles) == 0x0029C0, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterAmbientParticles' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DuplicateCharacterMesh) == 0x0029C8, "Member 'AEnemyPawn_Parent_Deimos_C::DuplicateCharacterMesh' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, DuplicateCharacterMID) == 0x0029D0, "Member 'AEnemyPawn_Parent_Deimos_C::DuplicateCharacterMID' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Auxillary_Objects) == 0x0029D8, "Member 'AEnemyPawn_Parent_Deimos_C::Auxillary_Objects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Duplicate_Auxillary_Objects) == 0x0029E8, "Member 'AEnemyPawn_Parent_Deimos_C::Duplicate_Auxillary_Objects' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, MinibossPSComponent) == 0x0029F8, "Member 'AEnemyPawn_Parent_Deimos_C::MinibossPSComponent' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, CharacterParticlesMaxDrawDistance) == 0x002A00, "Member 'AEnemyPawn_Parent_Deimos_C::CharacterParticlesMaxDrawDistance' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Original_Phys_Material) == 0x002A08, "Member 'AEnemyPawn_Parent_Deimos_C::Original_Phys_Material' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Previous_MID_AuxObjs) == 0x002A18, "Member 'AEnemyPawn_Parent_Deimos_C::Previous_MID_AuxObjs' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Restoring_Array_Index) == 0x002A28, "Member 'AEnemyPawn_Parent_Deimos_C::Restoring_Array_Index' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, UseHeadShotFX) == 0x002A2C, "Member 'AEnemyPawn_Parent_Deimos_C::UseHeadShotFX' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, Death_Dematerialize_Sound) == 0x002A30, "Member 'AEnemyPawn_Parent_Deimos_C::Death_Dematerialize_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, HeadShot_Sound) == 0x002A38, "Member 'AEnemyPawn_Parent_Deimos_C::HeadShot_Sound' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, AdditiveHitReactRetriggerDelay) == 0x002A40, "Member 'AEnemyPawn_Parent_Deimos_C::AdditiveHitReactRetriggerDelay' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, GC_SidewaysSpawnFx) == 0x002A44, "Member 'AEnemyPawn_Parent_Deimos_C::GC_SidewaysSpawnFx' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, SoundLibraryContext) == 0x002A50, "Member 'AEnemyPawn_Parent_Deimos_C::SoundLibraryContext' has a wrong offset!");
static_assert(offsetof(AEnemyPawn_Parent_Deimos_C, GC_OnSpawnFX) == 0x002A58, "Member 'AEnemyPawn_Parent_Deimos_C::GC_OnSpawnFX' has a wrong offset!");

}

