#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnvQueryContext_Querier_RandomPointOnUnitCircle_2D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EnvQueryContext_Querier_RandomPointOnUnitCircle_2D.EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C.ProvideSingleLocation
// 0x0068 (0x0068 - 0x0000)
struct EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation");
static_assert(sizeof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation) == 0x000068, "Wrong size on EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_RandomUnitVector_ReturnValue) == 0x00001C, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_BreakVector_X) == 0x000034, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_BreakVector_Y) == 0x000038, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_BreakVector_Z) == 0x00003C, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_Normal_ReturnValue) == 0x00004C, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'EnvQueryContext_Querier_RandomPointOnUnitCircle_2D_C_ProvideSingleLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

