#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C
// 0x3050 (0x3570 - 0x0520)
class UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C final : public UCustomCharacterPartAnimInstance_RamirezHead
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0528(0x0030)()
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0560(0x0790)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0CF0(0x0118)()
	uint8                                         Pad_E08[0x8];                                      // 0x0E08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0E10(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x1250(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x1270(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1290(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x16D0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1B10(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1F50(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1F70(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x20C8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x20F0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2190(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x21B8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x22C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x22E0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2300(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x23A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x23C8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x23F0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2548(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2570(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2610(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2630(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2658(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2678(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2698(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x26B8(0x0020)()
	uint8                                         Pad_26D8[0x8];                                     // 0x26D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x26E0(0x0440)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2B20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2C28(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2D30(0x00A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2DD0(0x0790)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x3560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GetPlayerListUsesCustomCharacterParts;             // 0x3568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C">();
	}
	static class UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C");
static_assert(sizeof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C) == 0x003570, "Wrong size on UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, UberGraphFrame) == 0x000520, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_Root) == 0x000528, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000560, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SubInput) == 0x000CF0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x000E10, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_4) == 0x001250, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_4) == 0x001270, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001290, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0016D0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001B10, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_3) == 0x001F50, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001F70, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_5) == 0x0020C8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x0020F0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x002190, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0021B8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0022C0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x0022E0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x002300, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x0023A0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x0023C8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0023F0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002548, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x002570, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x002610, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002630, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x002658, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002678, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002698, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0026B8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0026E0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002B20, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002C28, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002D30, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_RigidBody) == 0x002DD0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, MeshToCopy) == 0x003560, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::MeshToCopy' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, GetPlayerListUsesCustomCharacterParts) == 0x003568, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::GetPlayerListUsesCustomCharacterParts' has a wrong offset!");

}

