#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortTagRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortTagRotator.FortTagRotator_C
// 0x0068 (0x0320 - 0x02B8)
class UFortTagRotator_C final : public UAthenaItemShopTagRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OutroWidget;                                       // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroWidget;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 burst;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               FullInfo;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_164;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Preview;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              StatusSwitcher;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortTagRotator(int32 EntryPoint);
	void OnFinishedInteracting();
	void OnStartedInteracting();
	void OnTagExit();
	void OnTagEnter();
	void OnActiveStatusChanged(bool bIsActive);
	void Finished_C09DEE524374D1A2B95AB0A491D53E54();
	void Finished_381BCDD3417E42DA4102FEBE87FFA1EF();
	void HandleIntroAnim();
	void HandleOutroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortTagRotator_C">();
	}
	static class UFortTagRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTagRotator_C>();
	}
};
static_assert(alignof(UFortTagRotator_C) == 0x000008, "Wrong alignment on UFortTagRotator_C");
static_assert(sizeof(UFortTagRotator_C) == 0x000320, "Wrong size on UFortTagRotator_C");
static_assert(offsetof(UFortTagRotator_C, UberGraphFrame) == 0x0002B8, "Member 'UFortTagRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, OutroWidget) == 0x0002C0, "Member 'UFortTagRotator_C::OutroWidget' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, IntroWidget) == 0x0002C8, "Member 'UFortTagRotator_C::IntroWidget' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, In) == 0x0002D0, "Member 'UFortTagRotator_C::In' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Out) == 0x0002D8, "Member 'UFortTagRotator_C::Out' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Backing) == 0x0002E0, "Member 'UFortTagRotator_C::Backing' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, burst) == 0x0002E8, "Member 'UFortTagRotator_C::burst' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, FullInfo) == 0x0002F0, "Member 'UFortTagRotator_C::FullInfo' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Image) == 0x0002F8, "Member 'UFortTagRotator_C::Image' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Image_164) == 0x000300, "Member 'UFortTagRotator_C::Image_164' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Preview) == 0x000308, "Member 'UFortTagRotator_C::Preview' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, Shadow) == 0x000310, "Member 'UFortTagRotator_C::Shadow' has a wrong offset!");
static_assert(offsetof(UFortTagRotator_C, StatusSwitcher) == 0x000318, "Member 'UFortTagRotator_C::StatusSwitcher' has a wrong offset!");

}

