#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSelectableRadialEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortSelectableRadialEntry.FortSelectableRadialEntry_C
// 0x0030 (0x0CA0 - 0x0C70)
class UFortSelectableRadialEntry_C final : public UFortRadialPickerEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultSelectedColor;                              // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultUnselectedColor;                            // 0x0C90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_UpdateSelectionColor(bool Selected_0);
	void BP_OnSelected();
	void BP_OnDeselected();
	void OnAvailabilityChanged(bool bIsAvailable);
	void ExecuteUbergraph_FortSelectableRadialEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortSelectableRadialEntry_C">();
	}
	static class UFortSelectableRadialEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSelectableRadialEntry_C>();
	}
};
static_assert(alignof(UFortSelectableRadialEntry_C) == 0x000008, "Wrong alignment on UFortSelectableRadialEntry_C");
static_assert(sizeof(UFortSelectableRadialEntry_C) == 0x000CA0, "Wrong size on UFortSelectableRadialEntry_C");
static_assert(offsetof(UFortSelectableRadialEntry_C, UberGraphFrame) == 0x000C70, "Member 'UFortSelectableRadialEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortSelectableRadialEntry_C, Selected) == 0x000C78, "Member 'UFortSelectableRadialEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UFortSelectableRadialEntry_C, DefaultSelectedColor) == 0x000C80, "Member 'UFortSelectableRadialEntry_C::DefaultSelectedColor' has a wrong offset!");
static_assert(offsetof(UFortSelectableRadialEntry_C, DefaultUnselectedColor) == 0x000C90, "Member 'UFortSelectableRadialEntry_C::DefaultUnselectedColor' has a wrong offset!");

}

