#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortAIPawnSidewaysComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SidewaysCodeRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FortAIPawnSidewaysComponent.FortAIPawnSidewaysComponent_C.ExecuteUbergraph_FortAIPawnSidewaysComponent
// 0x0098 (0x0098 - 0x0000)
struct FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASidewaysPlayspace*                     K2Node_Event_NewSidewaysPlayspace;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                K2Node_Event_OldState;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                K2Node_Event_NewState;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0030(0x0020)()
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent) == 0x000008, "Wrong alignment on FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent");
static_assert(sizeof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent) == 0x000098, "Wrong size on FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, EntryPoint) == 0x000000, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_Event_NewSidewaysPlayspace) == 0x000018, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_Event_NewSidewaysPlayspace' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_Event_OldState) == 0x000020, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_Event_NewState) == 0x000021, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000023, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000028, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000030, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_DynamicCast_AsFort_AIPawn) == 0x000050, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000060, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue) == 0x000070, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000078, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000080, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000090, "Member 'FortAIPawnSidewaysComponent_C_ExecuteUbergraph_FortAIPawnSidewaysComponent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function FortAIPawnSidewaysComponent.FortAIPawnSidewaysComponent_C.HandleSidewaysStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged final
{
public:
	class ASidewaysPlayspace*                     NewSidewaysPlayspace;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged) == 0x000008, "Wrong alignment on FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged");
static_assert(sizeof(FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged) == 0x000010, "Wrong size on FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged, NewSidewaysPlayspace) == 0x000000, "Member 'FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged::NewSidewaysPlayspace' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged, OldState) == 0x000008, "Member 'FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged, NewState) == 0x000009, "Member 'FortAIPawnSidewaysComponent_C_HandleSidewaysStateChanged::NewState' has a wrong offset!");

}

