#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortWaterBodyBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FluidForceImpulseTimedEffects_structs.hpp"
#include "FluidForceImpulse_structs.hpp"


namespace SDK::Params
{

// Function FortWaterBodyBP.FortWaterBodyBP_C.ExecuteUbergraph_FortWaterBodyBP
// 0x01B8 (0x01B8 - 0x0000)
struct FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFluidForceImpulseTimedEffects         K2Node_MakeStruct_FluidForceImpulseTimedEffects;   // 0x0008(0x0028)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0034(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_FluidSim_FN_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FluidSim_FN_C*                      CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFluidForceImpulse                     K2Node_MakeStruct_FluidForceImpulse;               // 0x0160(0x0050)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP) == 0x000008, "Wrong alignment on FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP");
static_assert(sizeof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP) == 0x0001B8, "Wrong size on FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, EntryPoint) == 0x000000, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, K2Node_MakeStruct_FluidForceImpulseTimedEffects) == 0x000008, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::K2Node_MakeStruct_FluidForceImpulseTimedEffects' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000030, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, K2Node_Event_Hit) == 0x000034, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C0, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D0, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000D1, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_Time) == 0x0000D4, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_Distance) == 0x0000D8, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_Location) == 0x0000DC, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E8, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_Normal) == 0x0000F4, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_ImpactNormal) == 0x000100, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_PhysMat) == 0x000110, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_HitActor) == 0x000118, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_HitComponent) == 0x000120, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_HitBoneName) == 0x000128, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_HitItem) == 0x000130, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_ElementIndex) == 0x000134, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_FaceIndex) == 0x000138, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_TraceStart) == 0x00013C, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_BreakHitResult_TraceEnd) == 0x000148, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_Array_Get_Item) == 0x000158, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, K2Node_MakeStruct_FluidForceImpulse) == 0x000160, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::K2Node_MakeStruct_FluidForceImpulse' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'FortWaterBodyBP_C_ExecuteUbergraph_FortWaterBodyBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function FortWaterBodyBP.FortWaterBodyBP_C.OnReceivedBulletImpact
// 0x0088 (0x0088 - 0x0000)
struct FortWaterBodyBP_C_OnReceivedBulletImpact final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FortWaterBodyBP_C_OnReceivedBulletImpact) == 0x000004, "Wrong alignment on FortWaterBodyBP_C_OnReceivedBulletImpact");
static_assert(sizeof(FortWaterBodyBP_C_OnReceivedBulletImpact) == 0x000088, "Wrong size on FortWaterBodyBP_C_OnReceivedBulletImpact");
static_assert(offsetof(FortWaterBodyBP_C_OnReceivedBulletImpact, Hit) == 0x000000, "Member 'FortWaterBodyBP_C_OnReceivedBulletImpact::Hit' has a wrong offset!");

}

