#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortTagRotator

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortTagRotator.FortTagRotator_C.ExecuteUbergraph_FortTagRotator
// 0x0078 (0x0078 - 0x0000)
struct FortTagRotator_C_ExecuteUbergraph_FortTagRotator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsActive;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          K2Node_Select_Default;                             // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator) == 0x000008, "Wrong alignment on FortTagRotator_C_ExecuteUbergraph_FortTagRotator");
static_assert(sizeof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator) == 0x000078, "Wrong size on FortTagRotator_C_ExecuteUbergraph_FortTagRotator");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, EntryPoint) == 0x000000, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, K2Node_Event_bIsActive) == 0x000030, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::K2Node_Event_bIsActive' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, Temp_bool_Variable) == 0x000031, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, K2Node_Select_Default) == 0x000038, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000040, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000048, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000058, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000060, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortTagRotator_C_ExecuteUbergraph_FortTagRotator, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000070, "Member 'FortTagRotator_C_ExecuteUbergraph_FortTagRotator::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function FortTagRotator.FortTagRotator_C.OnActiveStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortTagRotator_C_OnActiveStatusChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FortTagRotator_C_OnActiveStatusChanged) == 0x000001, "Wrong alignment on FortTagRotator_C_OnActiveStatusChanged");
static_assert(sizeof(FortTagRotator_C_OnActiveStatusChanged) == 0x000001, "Wrong size on FortTagRotator_C_OnActiveStatusChanged");
static_assert(offsetof(FortTagRotator_C_OnActiveStatusChanged, bIsActive) == 0x000000, "Member 'FortTagRotator_C_OnActiveStatusChanged::bIsActive' has a wrong offset!");

// Function FortTagRotator.FortTagRotator_C.HandleIntroAnim
// 0x0008 (0x0008 - 0x0000)
struct FortTagRotator_C_HandleIntroAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortTagRotator_C_HandleIntroAnim) == 0x000008, "Wrong alignment on FortTagRotator_C_HandleIntroAnim");
static_assert(sizeof(FortTagRotator_C_HandleIntroAnim) == 0x000008, "Wrong size on FortTagRotator_C_HandleIntroAnim");
static_assert(offsetof(FortTagRotator_C_HandleIntroAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'FortTagRotator_C_HandleIntroAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function FortTagRotator.FortTagRotator_C.HandleOutroAnim
// 0x0008 (0x0008 - 0x0000)
struct FortTagRotator_C_HandleOutroAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortTagRotator_C_HandleOutroAnim) == 0x000008, "Wrong alignment on FortTagRotator_C_HandleOutroAnim");
static_assert(sizeof(FortTagRotator_C_HandleOutroAnim) == 0x000008, "Wrong size on FortTagRotator_C_HandleOutroAnim");
static_assert(offsetof(FortTagRotator_C_HandleOutroAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'FortTagRotator_C_HandleOutroAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

