#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Player_Ragdoll

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.ExecuteUbergraph_GA_Athena_Player_Ragdoll
// 0x0178 (0x0178 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_11;                   // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_10;                   // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_9;                    // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_8;                    // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_7;                    // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_6;                    // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x010C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x013C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue_1;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll) == 0x000008, "Wrong alignment on GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll) == 0x000178, "Wrong size on GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, EntryPoint) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_11) == 0x000004, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_10) == 0x00001C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_9) == 0x000034, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_8) == 0x00004C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_7) == 0x000064, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_6) == 0x00007C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_5) == 0x000084, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, Temp_struct_Variable) == 0x000094, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x0000A0, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_5) == 0x0000AC, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_4) == 0x0000C4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000CC, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_3) == 0x0000DC, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_2) == 0x0000F4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000FC, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_1) == 0x00010C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_10) == 0x000114, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag) == 0x000124, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_11) == 0x00012C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, Temp_struct_Variable_1) == 0x00013C, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_PlayMontageAndWaitNotify_ReturnValue_1) == 0x000148, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_PlayMontageAndWaitNotify_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_12) == 0x000154, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000168, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_Event_bWasCancelled) == 0x000171, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Player_Ragdoll_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Player_Ragdoll_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCompleted_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCancelled_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCompleted_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnBlendOut_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnInterrupted_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCancelled_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyBegin_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyEnd_461EDAFF4994509313085790267AF56D
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D) == 0x000008, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

}

