#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpookyMist_GlitchPassive

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_SpookyMist_GlitchPassive.GA_SpookyMist_GlitchPassive_C.ExecuteUbergraph_GA_SpookyMist_GlitchPassive
// 0x0040 (0x0040 - 0x0000)
struct GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive) == 0x000008, "Wrong alignment on GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive");
static_assert(sizeof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive) == 0x000040, "Wrong size on GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, EntryPoint) == 0x000000, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000010, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x000019, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000020, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000028, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000029, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00002A, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective) == 0x00002B, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController) == 0x00002C, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002F, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_GetQuestManager_ReturnValue) == 0x000030, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_BooleanAND_ReturnValue_1) == 0x000038, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000039, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x00003A, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_BooleanAND_ReturnValue_2) == 0x00003B, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'GA_SpookyMist_GlitchPassive_C_ExecuteUbergraph_GA_SpookyMist_GlitchPassive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_SpookyMist_GlitchPassive.GA_SpookyMist_GlitchPassive_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility");
static_assert(sizeof(GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility");
static_assert(offsetof(GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SpookyMist_GlitchPassive_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

