#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_ValetMod_OffRoadTire_Apply

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_ValetMod_OffRoadTire_Apply.GCN_ValetMod_OffRoadTire_Apply_C.OnBurst
// 0x0118 (0x0118 - 0x0000)
struct GCN_ValetMod_OffRoadTire_Apply_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValet_BigRig_Vehicle_C*                K2Node_DynamicCast_AsValet_Big_Rig_Vehicle;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst) == 0x000008, "Wrong alignment on GCN_ValetMod_OffRoadTire_Apply_C_OnBurst");
static_assert(sizeof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst) == 0x000118, "Wrong size on GCN_ValetMod_OffRoadTire_Apply_C_OnBurst");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, ParticleComponents) == 0x0000C8, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, AudioComponents) == 0x0000D8, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, BurstDecalInstance) == 0x0000F0, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, K2Node_DynamicCast_AsValet_Big_Rig_Vehicle) == 0x000108, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::K2Node_DynamicCast_AsValet_Big_Rig_Vehicle' has a wrong offset!");
static_assert(offsetof(GCN_ValetMod_OffRoadTire_Apply_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCN_ValetMod_OffRoadTire_Apply_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

