#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_DirectionalLaunch_Generic_Launch

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_DirectionalLaunch_Generic_Launch.GCN_Athena_DirectionalLaunch_Generic_Launch_C.OnBurstGeneric
// 0x0148 (0x0148 - 0x0000)
struct GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetDriver_self_CastInput;                 // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetDriver_ReturnValue;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric");
static_assert(sizeof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric) == 0x000148, "Wrong size on GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, ParticleComponents) == 0x0000C8, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, AudioComponents) == 0x0000D8, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, BurstDecalInstance) == 0x0000F0, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, K2Node_DynamicCast_AsFort_Athena_Vehicle) == 0x0000F8, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::K2Node_DynamicCast_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000104, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_GetDriver_self_CastInput) == 0x000110, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_GetDriver_self_CastInput' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_GetDriver_ReturnValue) == 0x000120, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_IsLocallyControlled_ReturnValue) == 0x000128, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, K2Node_DynamicCast_AsFort_Pawn) == 0x000138, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000141, "Member 'GCN_Athena_DirectionalLaunch_Generic_Launch_C_OnBurstGeneric::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");

}

