#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Sideways_InsideSideways

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_Sideways_InsideSideways.GCNL_Athena_Sideways_InsideSideways_C.ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways
// 0x0240 (0x0240 - 0x0000)
struct GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveCameraModifier_ReturnValue;         // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0120(0x00C0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x01E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x01F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSplitScreen_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveCameraModifier_ReturnValue_1;       // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveCameraModifier_ReturnValue_2;       // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSplitScreen_ReturnValue_1;              // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways) == 0x000008, "Wrong alignment on GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways");
static_assert(sizeof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways) == 0x000240, "Wrong size on GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, EntryPoint) == 0x000000, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x0000F0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue) == 0x0000F8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_DynamicCast_AsPlayer_Controller) == 0x000108, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000111, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_RemoveCameraModifier_ReturnValue) == 0x000113, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_RemoveCameraModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_IsValid_ReturnValue_1) == 0x000114, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_MyTarget_1) == 0x000118, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_Parameters_1) == 0x000120, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_ParticleComponents_1) == 0x0001E0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_AudioComponents_1) == 0x0001F0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_BurstCameraShakeInstance) == 0x000200, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_Event_BurstDecalInstance) == 0x000208, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_GetOwner_ReturnValue_1) == 0x000210, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x000218, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1) == 0x000228, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_GetFirstLocalFortPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_IsSplitScreen_ReturnValue) == 0x000230, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_IsSplitScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000231, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000232, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_RemoveCameraModifier_ReturnValue_1) == 0x000233, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_RemoveCameraModifier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_RemoveCameraModifier_ReturnValue_2) == 0x000234, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_RemoveCameraModifier_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_IsSplitScreen_ReturnValue_1) == 0x000235, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_IsSplitScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000236, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways, CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue_1) == 0x000238, "Member 'GCNL_Athena_Sideways_InsideSideways_C_ExecuteUbergraph_GCNL_Athena_Sideways_InsideSideways::CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue_1' has a wrong offset!");

// Function GCNL_Athena_Sideways_InsideSideways.GCNL_Athena_Sideways_InsideSideways_C.OnLoopingStart
// 0x00E8 (0x00E8 - 0x0000)
struct GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart) == 0x0000E8, "Wrong size on GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_Sideways_InsideSideways.GCNL_Athena_Sideways_InsideSideways_C.OnRemoval
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_Sideways_InsideSideways_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Athena_Sideways_InsideSideways_C_OnRemoval");
static_assert(sizeof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval) == 0x0000F8, "Wrong size on GCNL_Athena_Sideways_InsideSideways_C_OnRemoval");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Sideways_InsideSideways_C_OnRemoval, BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_Sideways_InsideSideways_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

}

