#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GiftingScreen.GiftingScreen_C
// 0x0088 (0x0800 - 0x0778)
class UGiftingScreen_C final : public UFortGiftingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReportSent;                                        // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Summary;                                    // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_TabGiftWrap;                                // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_ReasonField;                          // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Price;                                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_StackingEntry;                                  // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_Buttons;                                  // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MainPanelContent;                         // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_TabContent;                               // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_ChosenItem;                                   // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_MainContent;                                  // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_SendingSpinner;                               // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleMoreInfoClicked(bool* bPassThrough);
	void Construct();
	void OnOfferSet(class UFortStoreFrontOfferInfo* NewOfferInfo);
	void OnBeginGiftingSubmission();
	void OnEndGiftingSubmission(bool bSuccess);
	void BP_OnActivated();
	void ShowGetVBucksButton();
	void ShowContinueButton();
	void ShowSendButton();
	void ActiveFriendSelectTab();
	void ActiveWrapGriftTab();
	void ExecuteUbergraph_GiftingScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GiftingScreen_C">();
	}
	static class UGiftingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGiftingScreen_C>();
	}
};
static_assert(alignof(UGiftingScreen_C) == 0x000008, "Wrong alignment on UGiftingScreen_C");
static_assert(sizeof(UGiftingScreen_C) == 0x000800, "Wrong size on UGiftingScreen_C");
static_assert(offsetof(UGiftingScreen_C, UberGraphFrame) == 0x000778, "Member 'UGiftingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, ReportSent) == 0x000780, "Member 'UGiftingScreen_C::ReportSent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Intro) == 0x000788, "Member 'UGiftingScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Border_Summary) == 0x000790, "Member 'UGiftingScreen_C::Border_Summary' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Button_TabGiftWrap) == 0x000798, "Member 'UGiftingScreen_C::Button_TabGiftWrap' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, CircularThrobber_0) == 0x0007A0, "Member 'UGiftingScreen_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, EditableText_ReasonField) == 0x0007A8, "Member 'UGiftingScreen_C::EditableText_ReasonField' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, HBox_Price) == 0x0007B0, "Member 'UGiftingScreen_C::HBox_Price' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Image_4) == 0x0007B8, "Member 'UGiftingScreen_C::Image_4' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SafeZone_0) == 0x0007C0, "Member 'UGiftingScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SB_StackingEntry) == 0x0007C8, "Member 'UGiftingScreen_C::SB_StackingEntry' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_Buttons) == 0x0007D0, "Member 'UGiftingScreen_C::Switcher_Buttons' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_MainPanelContent) == 0x0007D8, "Member 'UGiftingScreen_C::Switcher_MainPanelContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_TabContent) == 0x0007E0, "Member 'UGiftingScreen_C::Switcher_TabContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_ChosenItem) == 0x0007E8, "Member 'UGiftingScreen_C::VBox_ChosenItem' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_MainContent) == 0x0007F0, "Member 'UGiftingScreen_C::VBox_MainContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_SendingSpinner) == 0x0007F8, "Member 'UGiftingScreen_C::VBox_SendingSpinner' has a wrong offset!");

}

