#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GuavaRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GuavaRuntime.BuildingGameplayActorGuavaEnemy.IsCriticalHit
// 0x008C (0x008C - 0x0000)
struct BuildingGameplayActorGuavaEnemy_IsCriticalHit final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BuildingGameplayActorGuavaEnemy_IsCriticalHit) == 0x000004, "Wrong alignment on BuildingGameplayActorGuavaEnemy_IsCriticalHit");
static_assert(sizeof(BuildingGameplayActorGuavaEnemy_IsCriticalHit) == 0x00008C, "Wrong size on BuildingGameplayActorGuavaEnemy_IsCriticalHit");
static_assert(offsetof(BuildingGameplayActorGuavaEnemy_IsCriticalHit, HitResult) == 0x000000, "Member 'BuildingGameplayActorGuavaEnemy_IsCriticalHit::HitResult' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorGuavaEnemy_IsCriticalHit, ReturnValue) == 0x000088, "Member 'BuildingGameplayActorGuavaEnemy_IsCriticalHit::ReturnValue' has a wrong offset!");

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCapsuleComponent
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent final
{
public:
	class UCapsuleComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent) == 0x000008, "Wrong alignment on BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent");
static_assert(sizeof(BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent) == 0x000008, "Wrong size on BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent, ReturnValue) == 0x000000, "Member 'BuildingGameplayActorGuavaCaretaker_GetCapsuleComponent::ReturnValue' has a wrong offset!");

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCurrentPathDistance
// 0x0004 (0x0004 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance) == 0x000004, "Wrong alignment on BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance");
static_assert(sizeof(BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance) == 0x000004, "Wrong size on BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance, ReturnValue) == 0x000000, "Member 'BuildingGameplayActorGuavaCaretaker_GetCurrentPathDistance::ReturnValue' has a wrong offset!");

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetCurrentSpeed
// 0x0004 (0x0004 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed) == 0x000004, "Wrong alignment on BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed");
static_assert(sizeof(BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed) == 0x000004, "Wrong size on BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed, ReturnValue) == 0x000000, "Member 'BuildingGameplayActorGuavaCaretaker_GetCurrentSpeed::ReturnValue' has a wrong offset!");

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent) == 0x000008, "Wrong alignment on BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent");
static_assert(sizeof(BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent) == 0x000008, "Wrong size on BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent, ReturnValue) == 0x000000, "Member 'BuildingGameplayActorGuavaCaretaker_GetSkeletalMeshComponent::ReturnValue' has a wrong offset!");

// Function GuavaRuntime.BuildingGameplayActorGuavaCaretaker.GetWalkPlayRateAndSpeedWarpingValues
// 0x0008 (0x0008 - 0x0000)
struct BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues final
{
public:
	float                                         OutWalkPlayRateValue;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutWalkSpeedWarpingValue;                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues) == 0x000004, "Wrong alignment on BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues");
static_assert(sizeof(BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues) == 0x000008, "Wrong size on BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues, OutWalkPlayRateValue) == 0x000000, "Member 'BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues::OutWalkPlayRateValue' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues, OutWalkSpeedWarpingValue) == 0x000004, "Member 'BuildingGameplayActorGuavaCaretaker_GetWalkPlayRateAndSpeedWarpingValues::OutWalkSpeedWarpingValue' has a wrong offset!");

}

