#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTower_Tapas_Axe_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C
// 0x13E0 (0x1900 - 0x0520)
class UHighTower_Tapas_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance_HightowerTapasAxe
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0528(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0548(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0720(0x0030)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x0750(0x0260)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x09B0(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AB8(0x00A0)()
	uint8                                         Pad_B58[0x8];                                      // 0x0B58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0B60(0x0790)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x12F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1310(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1330(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1488(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x14B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x14D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x14F8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1520(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1628(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1648(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1668(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16B0(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1808(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x18D0(0x0028)()

public:
	void ExecuteUbergraph_HighTower_Tapas_Axe_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HighTower_Tapas_Axe_AnimBP_C">();
	}
	static class UHighTower_Tapas_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTower_Tapas_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UHighTower_Tapas_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(sizeof(UHighTower_Tapas_Axe_AnimBP_C) == 0x001900, "Wrong size on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, UberGraphFrame) == 0x000520, "Member 'UHighTower_Tapas_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000528, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000548, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Root) == 0x000720, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Trail) == 0x000750, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0009B0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000AB8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_RigidBody) == 0x000B60, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x0012F0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001310, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001330, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x001488, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0014B0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x0014D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0014F8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001520, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001628, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001648, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Slot) == 0x001668, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0016B0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x001808, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0018D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

