#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopTile

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemShopTile.ItemShopTile_C.ExecuteUbergraph_ItemShopTile
// 0x02C0 (0x02C0 - 0x0000)
struct ItemShopTile_C_ExecuteUbergraph_ItemShopTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingLargeLayout_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopTileSize                             Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	EItemShopTileSize                             Temp_byte_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopTileSize                             Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_OfferImage;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopCurrency                             K2Node_Event_Currency;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortColorPalette                      K2Node_Event_ColorPalette;                         // 0x008C(0x0050)(ConstParm, NoDestructor)
	EItemShopTileSize                             K2Node_Event_TileSize_1;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViolatorIntensity                            K2Node_Event_ViolatorIntensity;                    // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ViolatorText;                         // 0x00E0(0x0018)(ConstParm)
	float                                         K2Node_Select_Default;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_8;                             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopTileSize                             K2Node_Event_TileSize;                             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemThumbnailRenderer*             K2Node_Event_ThumbnailRendererPtr;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortItemCaptureActor*                  K2Node_Event_CaptureActor;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CaptureItem_C*                      K2Node_DynamicCast_AsBP_Capture_Item;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_9;                             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopTileSize                             Temp_byte_Variable_5;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViolatorIntensity                            Temp_byte_Variable_6;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       K2Node_Select_Default_3;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemShopCurrency                             Temp_byte_Variable_7;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EViolatorIntensity                            Temp_byte_Variable_8;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsActiveState;                       // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               K2Node_Select_Default_4;                           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTagRotator_C*                      K2Node_DynamicCast_AsFort_Tag_Rotator;             // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInPeekState;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxCharacterCountBeforeScaling_ReturnValue; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_6;                           // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_6;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileFrontend_bIsMobileFrontend;       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_7;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileFrontend_bIsMobileFrontend_1;     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_8;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_9;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_10;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileFrontend_bIsMobileFrontend_2;     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_7;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_11;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingLargeLayout_ReturnValue_1;         // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingLargeLayout_ReturnValue_2;         // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingLargeLayout_ReturnValue_3;         // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile) == 0x000008, "Wrong alignment on ItemShopTile_C_ExecuteUbergraph_ItemShopTile");
static_assert(sizeof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile) == 0x0002C0, "Wrong size on ItemShopTile_C_ExecuteUbergraph_ItemShopTile");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, EntryPoint) == 0x000000, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsUsingLargeLayout_ReturnValue) == 0x000004, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsUsingLargeLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable) == 0x000008, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable) == 0x00000C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_1) == 0x000010, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_2) == 0x000014, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_3) == 0x000018, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_4) == 0x00001C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_5) == 0x000020, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_1) == 0x000034, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_int_Variable) == 0x000038, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_2) == 0x00003C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_struct_Variable) == 0x000040, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_struct_Variable_1) == 0x000048, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_struct_Variable_2) == 0x000050, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_struct_Variable_3) == 0x000058, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_struct_Variable_4) == 0x000060, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_bool_Variable) == 0x000068, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_3) == 0x000069, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_4) == 0x00006A, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_OfferImage) == 0x000070, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_OfferImage' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000080, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_Currency) == 0x000088, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_Currency' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_ColorPalette) == 0x00008C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_ColorPalette' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_TileSize_1) == 0x0000DC, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_TileSize_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_ViolatorIntensity) == 0x0000DD, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_ViolatorIntensity' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_ViolatorText) == 0x0000E0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_ViolatorText' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default) == 0x0000F8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_1) == 0x0000FC, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_6) == 0x000104, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_7) == 0x000108, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_8) == 0x00010C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000110, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000118, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000120, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000128, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000130, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_TileSize) == 0x000138, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_TileSize' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_ThumbnailRendererPtr) == 0x000140, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_ThumbnailRendererPtr' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_CaptureActor) == 0x000148, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_CaptureActor' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000150, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_DynamicCast_AsBP_Capture_Item) == 0x000158, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_DynamicCast_AsBP_Capture_Item' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_float_Variable_9) == 0x000164, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_5) == 0x000168, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_6) == 0x000169, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_2) == 0x00016C, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_3) == 0x000170, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_7) == 0x000178, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000180, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000188, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsValid_ReturnValue_1) == 0x000190, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_byte_Variable_8) == 0x000191, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_bIsActiveState) == 0x000192, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_bIsActiveState' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_4) == 0x000198, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_5) == 0x0001A0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_DynamicCast_AsFort_Tag_Rotator) == 0x0001A8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_DynamicCast_AsFort_Tag_Rotator' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0001B8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0001C0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Event_bIsInPeekState) == 0x0001C8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Event_bIsInPeekState' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetMaxCharacterCountBeforeScaling_ReturnValue) == 0x0001CC, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetMaxCharacterCountBeforeScaling_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_Multiply_IntInt_ReturnValue) == 0x0001D0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x0001D8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x0001E0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x0001E8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_object_Variable) == 0x0001F0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_6) == 0x0001F8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000200, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_5) == 0x000208, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000210, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000218, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000220, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000228, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsHovered_ReturnValue) == 0x000230, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000238, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_GetDynamicMaterial_ReturnValue_8) == 0x000240, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_GetDynamicMaterial_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_6) == 0x000248, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsMobileFrontend_bIsMobileFrontend) == 0x000250, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsMobileFrontend_bIsMobileFrontend' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue_4) == 0x000258, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_7) == 0x000260, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsMobileFrontend_bIsMobileFrontend_1) == 0x000268, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsMobileFrontend_bIsMobileFrontend_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_8) == 0x000270, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_9) == 0x000278, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_10) == 0x000280, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationReverse_ReturnValue_5) == 0x000288, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationReverse_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000290, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000291, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, Temp_object_Variable_1) == 0x000298, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsMobileFrontend_bIsMobileFrontend_2) == 0x0002A0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsMobileFrontend_bIsMobileFrontend_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, K2Node_Select_Default_7) == 0x0002A8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_PlayAnimationForward_ReturnValue_11) == 0x0002B0, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_PlayAnimationForward_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsUsingLargeLayout_ReturnValue_1) == 0x0002B8, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsUsingLargeLayout_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsUsingLargeLayout_ReturnValue_2) == 0x0002B9, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsUsingLargeLayout_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_ExecuteUbergraph_ItemShopTile, CallFunc_IsUsingLargeLayout_ReturnValue_3) == 0x0002BA, "Member 'ItemShopTile_C_ExecuteUbergraph_ItemShopTile::CallFunc_IsUsingLargeLayout_ReturnValue_3' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemShopTile_C_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemShopTile_C_OnPeekStateChanged) == 0x000001, "Wrong alignment on ItemShopTile_C_OnPeekStateChanged");
static_assert(sizeof(ItemShopTile_C_OnPeekStateChanged) == 0x000001, "Wrong size on ItemShopTile_C_OnPeekStateChanged");
static_assert(offsetof(ItemShopTile_C_OnPeekStateChanged, bIsInPeekState) == 0x000000, "Member 'ItemShopTile_C_OnPeekStateChanged::bIsInPeekState' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnActiveStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemShopTile_C_OnActiveStateChanged final
{
public:
	bool                                          bIsActiveState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemShopTile_C_OnActiveStateChanged) == 0x000001, "Wrong alignment on ItemShopTile_C_OnActiveStateChanged");
static_assert(sizeof(ItemShopTile_C_OnActiveStateChanged) == 0x000001, "Wrong size on ItemShopTile_C_OnActiveStateChanged");
static_assert(offsetof(ItemShopTile_C_OnActiveStateChanged, bIsActiveState) == 0x000000, "Member 'ItemShopTile_C_OnActiveStateChanged::bIsActiveState' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnUpdateItemLivePreview
// 0x0018 (0x0018 - 0x0000)
struct ItemShopTile_C_OnUpdateItemLivePreview final
{
public:
	EItemShopTileSize                             TileSize;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemThumbnailRenderer*             ThumbnailRendererPtr;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortItemCaptureActor*                  CaptureActor;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopTile_C_OnUpdateItemLivePreview) == 0x000008, "Wrong alignment on ItemShopTile_C_OnUpdateItemLivePreview");
static_assert(sizeof(ItemShopTile_C_OnUpdateItemLivePreview) == 0x000018, "Wrong size on ItemShopTile_C_OnUpdateItemLivePreview");
static_assert(offsetof(ItemShopTile_C_OnUpdateItemLivePreview, TileSize) == 0x000000, "Member 'ItemShopTile_C_OnUpdateItemLivePreview::TileSize' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_OnUpdateItemLivePreview, ThumbnailRendererPtr) == 0x000008, "Member 'ItemShopTile_C_OnUpdateItemLivePreview::ThumbnailRendererPtr' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_OnUpdateItemLivePreview, CaptureActor) == 0x000010, "Member 'ItemShopTile_C_OnUpdateItemLivePreview::CaptureActor' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnUpdateViolator
// 0x0020 (0x0020 - 0x0000)
struct ItemShopTile_C_OnUpdateViolator final
{
public:
	EViolatorIntensity                            ViolatorIntensity;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ViolatorText;                                      // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ItemShopTile_C_OnUpdateViolator) == 0x000008, "Wrong alignment on ItemShopTile_C_OnUpdateViolator");
static_assert(sizeof(ItemShopTile_C_OnUpdateViolator) == 0x000020, "Wrong size on ItemShopTile_C_OnUpdateViolator");
static_assert(offsetof(ItemShopTile_C_OnUpdateViolator, ViolatorIntensity) == 0x000000, "Member 'ItemShopTile_C_OnUpdateViolator::ViolatorIntensity' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_OnUpdateViolator, ViolatorText) == 0x000008, "Member 'ItemShopTile_C_OnUpdateViolator::ViolatorText' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnUpdateTileSize
// 0x0001 (0x0001 - 0x0000)
struct ItemShopTile_C_OnUpdateTileSize final
{
public:
	EItemShopTileSize                             TileSize;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopTile_C_OnUpdateTileSize) == 0x000001, "Wrong alignment on ItemShopTile_C_OnUpdateTileSize");
static_assert(sizeof(ItemShopTile_C_OnUpdateTileSize) == 0x000001, "Wrong size on ItemShopTile_C_OnUpdateTileSize");
static_assert(offsetof(ItemShopTile_C_OnUpdateTileSize, TileSize) == 0x000000, "Member 'ItemShopTile_C_OnUpdateTileSize::TileSize' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnUpdateSeriesOrRarityColors
// 0x0050 (0x0050 - 0x0000)
struct ItemShopTile_C_OnUpdateSeriesOrRarityColors final
{
public:
	struct FFortColorPalette                      ColorPalette;                                      // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ItemShopTile_C_OnUpdateSeriesOrRarityColors) == 0x000004, "Wrong alignment on ItemShopTile_C_OnUpdateSeriesOrRarityColors");
static_assert(sizeof(ItemShopTile_C_OnUpdateSeriesOrRarityColors) == 0x000050, "Wrong size on ItemShopTile_C_OnUpdateSeriesOrRarityColors");
static_assert(offsetof(ItemShopTile_C_OnUpdateSeriesOrRarityColors, ColorPalette) == 0x000000, "Member 'ItemShopTile_C_OnUpdateSeriesOrRarityColors::ColorPalette' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnCurrencySet
// 0x0001 (0x0001 - 0x0000)
struct ItemShopTile_C_OnCurrencySet final
{
public:
	EItemShopCurrency                             Currency;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopTile_C_OnCurrencySet) == 0x000001, "Wrong alignment on ItemShopTile_C_OnCurrencySet");
static_assert(sizeof(ItemShopTile_C_OnCurrencySet) == 0x000001, "Wrong size on ItemShopTile_C_OnCurrencySet");
static_assert(offsetof(ItemShopTile_C_OnCurrencySet, Currency) == 0x000000, "Member 'ItemShopTile_C_OnCurrencySet::Currency' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.OnDisplayAssetImageLoaded
// 0x0008 (0x0008 - 0x0000)
struct ItemShopTile_C_OnDisplayAssetImageLoaded final
{
public:
	class UTexture2D*                             OfferImage;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemShopTile_C_OnDisplayAssetImageLoaded) == 0x000008, "Wrong alignment on ItemShopTile_C_OnDisplayAssetImageLoaded");
static_assert(sizeof(ItemShopTile_C_OnDisplayAssetImageLoaded) == 0x000008, "Wrong size on ItemShopTile_C_OnDisplayAssetImageLoaded");
static_assert(offsetof(ItemShopTile_C_OnDisplayAssetImageLoaded, OfferImage) == 0x000000, "Member 'ItemShopTile_C_OnDisplayAssetImageLoaded::OfferImage' has a wrong offset!");

// Function ItemShopTile.ItemShopTile_C.SetMaterials
// 0x0218 (0x0218 - 0x0000)
struct ItemShopTile_C_SetMaterials final
{
public:
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_3;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_4;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_4;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0028(0x0058)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0090(0x0058)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x00F0(0x0058)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_7; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0168(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_4;                 // 0x01C0(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(ItemShopTile_C_SetMaterials) == 0x000008, "Wrong alignment on ItemShopTile_C_SetMaterials");
static_assert(sizeof(ItemShopTile_C_SetMaterials) == 0x000218, "Wrong size on ItemShopTile_C_SetMaterials");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_IsMobileGame_ReturnValue) == 0x000000, "Member 'ItemShopTile_C_SetMaterials::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_IsMobileGame_ReturnValue_1) == 0x000001, "Member 'ItemShopTile_C_SetMaterials::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'ItemShopTile_C_SetMaterials::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_SelectInt_ReturnValue_1) == 0x000008, "Member 'ItemShopTile_C_SetMaterials::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_IsMobileGame_ReturnValue_2) == 0x00000C, "Member 'ItemShopTile_C_SetMaterials::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_IsMobileGame_ReturnValue_3) == 0x00000D, "Member 'ItemShopTile_C_SetMaterials::CallFunc_IsMobileGame_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_SelectInt_ReturnValue_2) == 0x000010, "Member 'ItemShopTile_C_SetMaterials::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_SelectInt_ReturnValue_3) == 0x000014, "Member 'ItemShopTile_C_SetMaterials::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_IsMobileGame_ReturnValue_4) == 0x000018, "Member 'ItemShopTile_C_SetMaterials::CallFunc_IsMobileGame_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_SelectInt_ReturnValue_4) == 0x00001C, "Member 'ItemShopTile_C_SetMaterials::CallFunc_SelectInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'ItemShopTile_C_SetMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, K2Node_MakeStruct_SlateFontInfo) == 0x000028, "Member 'ItemShopTile_C_SetMaterials::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000080, "Member 'ItemShopTile_C_SetMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000088, "Member 'ItemShopTile_C_SetMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemShopTile_C_SetMaterials, K2Node_MakeStruct_SlateFontInfo_1) == 0x000090, "Member 'ItemShopTile_C_SetMaterials::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
