#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItempShopSection

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItempShopSection.ItempShopSection_C.ExecuteUbergraph_ItempShopSection
// 0x0020 (0x0020 - 0x0000)
struct ItempShopSection_C_ExecuteUbergraph_ItempShopSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInSelectedState;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection) == 0x000008, "Wrong alignment on ItempShopSection_C_ExecuteUbergraph_ItempShopSection");
static_assert(sizeof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection) == 0x000020, "Wrong size on ItempShopSection_C_ExecuteUbergraph_ItempShopSection");
static_assert(offsetof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection, EntryPoint) == 0x000000, "Member 'ItempShopSection_C_ExecuteUbergraph_ItempShopSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection, K2Node_Event_bIsInSelectedState) == 0x000004, "Member 'ItempShopSection_C_ExecuteUbergraph_ItempShopSection::K2Node_Event_bIsInSelectedState' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ItempShopSection_C_ExecuteUbergraph_ItempShopSection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'ItempShopSection_C_ExecuteUbergraph_ItempShopSection::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_ExecuteUbergraph_ItempShopSection, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000018, "Member 'ItempShopSection_C_ExecuteUbergraph_ItempShopSection::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function ItempShopSection.ItempShopSection_C.OnSelectedStateUpdated
// 0x0001 (0x0001 - 0x0000)
struct ItempShopSection_C_OnSelectedStateUpdated final
{
public:
	bool                                          bIsInSelectedState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItempShopSection_C_OnSelectedStateUpdated) == 0x000001, "Wrong alignment on ItempShopSection_C_OnSelectedStateUpdated");
static_assert(sizeof(ItempShopSection_C_OnSelectedStateUpdated) == 0x000001, "Wrong size on ItempShopSection_C_OnSelectedStateUpdated");
static_assert(offsetof(ItempShopSection_C_OnSelectedStateUpdated, bIsInSelectedState) == 0x000000, "Member 'ItempShopSection_C_OnSelectedStateUpdated::bIsInSelectedState' has a wrong offset!");

// Function ItempShopSection.ItempShopSection_C.HandleFadeOutInfoAnim
// 0x0018 (0x0018 - 0x0000)
struct ItempShopSection_C_HandleFadeOutInfoAnim final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItempShopSection_C_HandleFadeOutInfoAnim) == 0x000008, "Wrong alignment on ItempShopSection_C_HandleFadeOutInfoAnim");
static_assert(sizeof(ItempShopSection_C_HandleFadeOutInfoAnim) == 0x000018, "Wrong size on ItempShopSection_C_HandleFadeOutInfoAnim");
static_assert(offsetof(ItempShopSection_C_HandleFadeOutInfoAnim, IsActive) == 0x000000, "Member 'ItempShopSection_C_HandleFadeOutInfoAnim::IsActive' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_HandleFadeOutInfoAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ItempShopSection_C_HandleFadeOutInfoAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItempShopSection_C_HandleFadeOutInfoAnim, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'ItempShopSection_C_HandleFadeOutInfoAnim::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

