#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargeSidewaysPlayspace

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SidewaysCodeRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LargeSidewaysPlayspace.LargeSidewaysPlayspace_C
// 0x0048 (0x0588 - 0x0540)
class ALargeSidewaysPlayspace_C final : public ASidewaysPlayspace
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPlayspaceComponent_AIPerceptionModifier* PlayspaceComponent_AIPerceptionModifier;           // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVolumeTimeOfDayComponent*          FortVolumeTimeOfDay;                               // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULargeSidewaysPlayspaceEncounterComponent_C* PlayspaceComponent_LargeSidewaysEncounter;         // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayspaceComponent_SidewaysDimension*  PlayspaceComponent_SidewaysDimension;              // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayspaceComponent_SpatialActorTracker* PlayspaceComponent_SpatialActorTracker;            // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMutatorListComponent*              FortMutatorList;                                   // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayspaceComponent_SpatialGameplay*    PlayspaceComponent_SpatialGameplay;                // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LargeSidewaysPlayspace(int32 EntryPoint);
	void ReceiveBeginPlay();
	void NotifyPlayspaceUserRemoved_Event_0(const struct FPlayspaceUser& RemovedUser);
	void NotifyPlayspaceUserAdded_Event_0(const struct FPlayspaceUser& AddedUser);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LargeSidewaysPlayspace_C">();
	}
	static class ALargeSidewaysPlayspace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALargeSidewaysPlayspace_C>();
	}
};
static_assert(alignof(ALargeSidewaysPlayspace_C) == 0x000008, "Wrong alignment on ALargeSidewaysPlayspace_C");
static_assert(sizeof(ALargeSidewaysPlayspace_C) == 0x000588, "Wrong size on ALargeSidewaysPlayspace_C");
static_assert(offsetof(ALargeSidewaysPlayspace_C, UberGraphFrame) == 0x000540, "Member 'ALargeSidewaysPlayspace_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, PlayspaceComponent_AIPerceptionModifier) == 0x000548, "Member 'ALargeSidewaysPlayspace_C::PlayspaceComponent_AIPerceptionModifier' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, FortVolumeTimeOfDay) == 0x000550, "Member 'ALargeSidewaysPlayspace_C::FortVolumeTimeOfDay' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, PlayspaceComponent_LargeSidewaysEncounter) == 0x000558, "Member 'ALargeSidewaysPlayspace_C::PlayspaceComponent_LargeSidewaysEncounter' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, PlayspaceComponent_SidewaysDimension) == 0x000560, "Member 'ALargeSidewaysPlayspace_C::PlayspaceComponent_SidewaysDimension' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, PlayspaceComponent_SpatialActorTracker) == 0x000568, "Member 'ALargeSidewaysPlayspace_C::PlayspaceComponent_SpatialActorTracker' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, FortMutatorList) == 0x000570, "Member 'ALargeSidewaysPlayspace_C::FortMutatorList' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, PlayspaceComponent_SpatialGameplay) == 0x000578, "Member 'ALargeSidewaysPlayspace_C::PlayspaceComponent_SpatialGameplay' has a wrong offset!");
static_assert(offsetof(ALargeSidewaysPlayspace_C, DefaultSceneRoot) == 0x000580, "Member 'ALargeSidewaysPlayspace_C::DefaultSceneRoot' has a wrong offset!");

}

