#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargeSidewaysPlayspace

#include "Basic.hpp"

#include "PlayspaceSystem_structs.hpp"


namespace SDK::Params
{

// Function LargeSidewaysPlayspace.LargeSidewaysPlayspace_C.ExecuteUbergraph_LargeSidewaysPlayspace
// 0x00E8 (0x00E8 - 0x0000)
struct LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FPlayspaceUser& AddedUser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FPlayspaceUser& RemovedUser)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayspaceUser                         K2Node_CustomEvent_AddedUser;                      // 0x0028(0x0050)(ConstParm)
	struct FPlayspaceUser                         K2Node_CustomEvent_RemovedUser;                    // 0x0078(0x0050)(ConstParm)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue;    // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue_1;  // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace) == 0x000008, "Wrong alignment on LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace");
static_assert(sizeof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace) == 0x0000E8, "Wrong size on LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, EntryPoint) == 0x000000, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::EntryPoint' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, K2Node_CustomEvent_AddedUser) == 0x000028, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::K2Node_CustomEvent_AddedUser' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, K2Node_CustomEvent_RemovedUser) == 0x000078, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::K2Node_CustomEvent_RemovedUser' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, CallFunc_GetDebugStringForUniqueId_ReturnValue) == 0x0000C8, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::CallFunc_GetDebugStringForUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace, CallFunc_GetDebugStringForUniqueId_ReturnValue_1) == 0x0000D8, "Member 'LargeSidewaysPlayspace_C_ExecuteUbergraph_LargeSidewaysPlayspace::CallFunc_GetDebugStringForUniqueId_ReturnValue_1' has a wrong offset!");

// Function LargeSidewaysPlayspace.LargeSidewaysPlayspace_C.NotifyPlayspaceUserRemoved_Event_0
// 0x0050 (0x0050 - 0x0000)
struct LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0 final
{
public:
	struct FPlayspaceUser                         RemovedUser;                                       // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0) == 0x000008, "Wrong alignment on LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0");
static_assert(sizeof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0) == 0x000050, "Wrong size on LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0");
static_assert(offsetof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0, RemovedUser) == 0x000000, "Member 'LargeSidewaysPlayspace_C_NotifyPlayspaceUserRemoved_Event_0::RemovedUser' has a wrong offset!");

// Function LargeSidewaysPlayspace.LargeSidewaysPlayspace_C.NotifyPlayspaceUserAdded_Event_0
// 0x0050 (0x0050 - 0x0000)
struct LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0 final
{
public:
	struct FPlayspaceUser                         AddedUser;                                         // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0) == 0x000008, "Wrong alignment on LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0");
static_assert(sizeof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0) == 0x000050, "Wrong size on LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0");
static_assert(offsetof(LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0, AddedUser) == 0x000000, "Member 'LargeSidewaysPlayspace_C_NotifyPlayspaceUserAdded_Event_0::AddedUser' has a wrong offset!");

}

