#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargeSidewaysPlayspaceEncounterComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_Athena_SidewaysEncounterL_EQS_Data_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BaseSidewaysPlayspaceEncounterComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LargeSidewaysPlayspaceEncounterComponent.LargeSidewaysPlayspaceEncounterComponent_C
// 0x0178 (0x02D0 - 0x0158)
class ULargeSidewaysPlayspaceEncounterComponent_C final : public UBaseSidewaysPlayspaceEncounterComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsEncounterActive;                                // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   EncounterStageVolume;                              // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EncounterBubbleVisualRadius;                       // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   EncounterBubble;                                   // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<float, struct FStruct_Athena_SidewaysEncounterL_EQS_Data> EncounterEQSDistanceData;                          // 0x0180(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Solo;                         // 0x01D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Duo;                          // 0x01E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Trio;                         // 0x01F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Squad;                        // 0x0208(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GC_Spawn_AI;                                       // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPawn*>                      SpawnedPawns;                                      // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UFortAthenaLivingWorldEncounterInstance* LWMEncounterInstance;                              // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BossStageEnabled;                                  // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BossRoundEliminationThreshold_HF;                  // 0x0240(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NumberOfBossesWeAreSpawning_HF;                    // 0x0268(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxNumAI_HF;                                       // 0x0290(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AIEliminated;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossesEliminated;                                  // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPawn*>                      BossesSpawned;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LargeSidewaysPlayspaceEncounterComponent(int32 EntryPoint);
	void OnEndPlay_Event(class AActor* Actor, EEndPlayReason EndPlayReason);
	void OnDied_Event(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnActorSpawnedResult_Event(class AActor* SpawnedActor, bool bResult);
	void SetupSidewaysEncounterLogic();
	void OnPlayspaceUserAdded(const struct FPlayspaceUser& AddedUser);
	void StartEncounter();
	void ReceiveBeginPlay();
	void OnReady_E306CD7043DE6BC8F9637DAA1FC8D512(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnReady_6559A8D641A76126AAC394B4EB5DD481(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void GetBuildingOwner(class ABGA_Athena_SidewaysEncounter_EnvCoreLarge_C** BuildingOwner);
	void GetSidewaysBubble(class ABGA_Athena_SidewaysEncounter_BubbleLarge_C** Bubble);
	void CopyParentComponentReferencesAndVariables();
	void SetEQSParamsIntoEncounterPointProvider();
	void GetPlaylistGametype(bool* Solo, bool* Duo, bool* Trio, bool* Squad_or_Rumble);
	void Start_LWM_Encounter();
	void GetScalableFloatHotfixValue(const struct FScalableFloat& ScalableFloat, float AtLevel, bool* AsBool, int32* AsIntRounded, float* AsFloat);
	void ScalableFloatIsValid(const struct FScalableFloat& ScalableFloat, bool* IsValid);
	void UpdatePOIUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LargeSidewaysPlayspaceEncounterComponent_C">();
	}
	static class ULargeSidewaysPlayspaceEncounterComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULargeSidewaysPlayspaceEncounterComponent_C>();
	}
};
static_assert(alignof(ULargeSidewaysPlayspaceEncounterComponent_C) == 0x000008, "Wrong alignment on ULargeSidewaysPlayspaceEncounterComponent_C");
static_assert(sizeof(ULargeSidewaysPlayspaceEncounterComponent_C) == 0x0002D0, "Wrong size on ULargeSidewaysPlayspaceEncounterComponent_C");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, UberGraphFrame) == 0x000158, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, bIsEncounterActive) == 0x000160, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::bIsEncounterActive' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, EncounterStageVolume) == 0x000168, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::EncounterStageVolume' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, EncounterBubbleVisualRadius) == 0x000170, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::EncounterBubbleVisualRadius' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, EncounterBubble) == 0x000178, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::EncounterBubble' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, EncounterEQSDistanceData) == 0x000180, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::EncounterEQSDistanceData' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, CachedGameState) == 0x0001D0, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::CachedGameState' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, DeimosEncounterTypes_Solo) == 0x0001D8, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::DeimosEncounterTypes_Solo' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, DeimosEncounterTypes_Duo) == 0x0001E8, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::DeimosEncounterTypes_Duo' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, DeimosEncounterTypes_Trio) == 0x0001F8, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::DeimosEncounterTypes_Trio' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, DeimosEncounterTypes_Squad) == 0x000208, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::DeimosEncounterTypes_Squad' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, GC_Spawn_AI) == 0x000218, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::GC_Spawn_AI' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, SpawnedPawns) == 0x000220, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::SpawnedPawns' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, LWMEncounterInstance) == 0x000230, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::LWMEncounterInstance' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, BossStageEnabled) == 0x000238, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::BossStageEnabled' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, BossRoundEliminationThreshold_HF) == 0x000240, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::BossRoundEliminationThreshold_HF' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, NumberOfBossesWeAreSpawning_HF) == 0x000268, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::NumberOfBossesWeAreSpawning_HF' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, MaxNumAI_HF) == 0x000290, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::MaxNumAI_HF' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, AIEliminated) == 0x0002B8, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::AIEliminated' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, BossesEliminated) == 0x0002BC, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::BossesEliminated' has a wrong offset!");
static_assert(offsetof(ULargeSidewaysPlayspaceEncounterComponent_C, BossesSpawned) == 0x0002C0, "Member 'ULargeSidewaysPlayspaceEncounterComponent_C::BossesSpawned' has a wrong offset!");

}

