#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamMenuButtonToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamMenuButtonToggle.LiveStreamMenuButtonToggle_C
// 0x0040 (0x0C68 - 0x0C28)
class ULiveStreamMenuButtonToggle_C final : public ULiveStreamMenuToggleButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Art;                                               // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconBox;                                           // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spikes_1;                                          // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LiveStreamMenuButtonToggle(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void RefreshButton(bool IsLiveStreamEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamMenuButtonToggle_C">();
	}
	static class ULiveStreamMenuButtonToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamMenuButtonToggle_C>();
	}
};
static_assert(alignof(ULiveStreamMenuButtonToggle_C) == 0x000008, "Wrong alignment on ULiveStreamMenuButtonToggle_C");
static_assert(sizeof(ULiveStreamMenuButtonToggle_C) == 0x000C68, "Wrong size on ULiveStreamMenuButtonToggle_C");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, UberGraphFrame) == 0x000C28, "Member 'ULiveStreamMenuButtonToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Hover) == 0x000C30, "Member 'ULiveStreamMenuButtonToggle_C::Hover' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Art) == 0x000C38, "Member 'ULiveStreamMenuButtonToggle_C::Art' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, ButtonBacking) == 0x000C40, "Member 'ULiveStreamMenuButtonToggle_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, ButtonText) == 0x000C48, "Member 'ULiveStreamMenuButtonToggle_C::ButtonText' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, IconBox) == 0x000C50, "Member 'ULiveStreamMenuButtonToggle_C::IconBox' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, LiveViolator) == 0x000C58, "Member 'ULiveStreamMenuButtonToggle_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(ULiveStreamMenuButtonToggle_C, Spikes_1) == 0x000C60, "Member 'ULiveStreamMenuButtonToggle_C::Spikes_1' has a wrong offset!");

}

