#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_HamburgerButton.MainMenu_HamburgerButton_C
// 0x0040 (0x0C60 - 0x0C20)
class UMainMenu_HamburgerButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Icon;                                              // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_HamburgerButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_HamburgerButton_C">();
	}
	static class UMainMenu_HamburgerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_HamburgerButton_C>();
	}
};
static_assert(alignof(UMainMenu_HamburgerButton_C) == 0x000008, "Wrong alignment on UMainMenu_HamburgerButton_C");
static_assert(sizeof(UMainMenu_HamburgerButton_C) == 0x000C60, "Wrong size on UMainMenu_HamburgerButton_C");
static_assert(offsetof(UMainMenu_HamburgerButton_C, UberGraphFrame) == 0x000C20, "Member 'UMainMenu_HamburgerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Grow) == 0x000C28, "Member 'UMainMenu_HamburgerButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Bounce) == 0x000C30, "Member 'UMainMenu_HamburgerButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover) == 0x000C38, "Member 'UMainMenu_HamburgerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, ButtonBacking) == 0x000C40, "Member 'UMainMenu_HamburgerButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Icon) == 0x000C48, "Member 'UMainMenu_HamburgerButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, IconColor) == 0x000C50, "Member 'UMainMenu_HamburgerButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, VariableSize) == 0x000C58, "Member 'UMainMenu_HamburgerButton_C::VariableSize' has a wrong offset!");

}

