#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NevadaRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class NevadaRuntime.NevadaGlobals
// 0x0000 (0x0028 - 0x0028)
class UNevadaGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaGlobals">();
	}
	static class UNevadaGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaGlobals>();
	}
};
static_assert(alignof(UNevadaGlobals) == 0x000008, "Wrong alignment on UNevadaGlobals");
static_assert(sizeof(UNevadaGlobals) == 0x000028, "Wrong size on UNevadaGlobals");

// Class NevadaRuntime.FortCameraMode_Nevada
// 0x0040 (0x0E30 - 0x0DF0)
class UFortCameraMode_Nevada final : public UFortCameraMode_AthenaVehicle
{
public:
	uint8                                         Pad_DE8[0x18];                                     // 0x0DE8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TractorBeamCameraOffset;                           // 0x0E00(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraLerpTime;                         // 0x0E0C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraExtraPitch;                       // 0x0E10(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamInactiveCameraExtraPitch;               // 0x0E14(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TractorBeamCameraPositionResetDelay;               // 0x0E18(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinPitchForOffset;                                 // 0x0E1C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxPitchForOffset;                                 // 0x0E20(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ExtraOffset;                                       // 0x0E24(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Nevada">();
	}
	static class UFortCameraMode_Nevada* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Nevada>();
	}
};
static_assert(alignof(UFortCameraMode_Nevada) == 0x000010, "Wrong alignment on UFortCameraMode_Nevada");
static_assert(sizeof(UFortCameraMode_Nevada) == 0x000E30, "Wrong size on UFortCameraMode_Nevada");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraOffset) == 0x000E00, "Member 'UFortCameraMode_Nevada::TractorBeamCameraOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraLerpTime) == 0x000E0C, "Member 'UFortCameraMode_Nevada::TractorBeamCameraLerpTime' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraExtraPitch) == 0x000E10, "Member 'UFortCameraMode_Nevada::TractorBeamCameraExtraPitch' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamInactiveCameraExtraPitch) == 0x000E14, "Member 'UFortCameraMode_Nevada::TractorBeamInactiveCameraExtraPitch' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, TractorBeamCameraPositionResetDelay) == 0x000E18, "Member 'UFortCameraMode_Nevada::TractorBeamCameraPositionResetDelay' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, MinPitchForOffset) == 0x000E1C, "Member 'UFortCameraMode_Nevada::MinPitchForOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, MaxPitchForOffset) == 0x000E20, "Member 'UFortCameraMode_Nevada::MaxPitchForOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Nevada, ExtraOffset) == 0x000E24, "Member 'UFortCameraMode_Nevada::ExtraOffset' has a wrong offset!");

// Class NevadaRuntime.FortNevadaAudioController
// 0x0080 (0x02A0 - 0x0220)
class AFortNevadaAudioController final : public AActor
{
public:
	struct FVector2D                              SpeedRangeMap;                                     // 0x0220(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TurningRangeMap;                                   // 0x0228(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AcceleratingRangeMap;                              // 0x0230(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BrakingRangeMap;                                   // 0x0238(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PassByRangeMap;                                    // 0x0240(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LFORangeMap;                                       // 0x0248(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortNevadaVehicle*                     Vehicle;                                           // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             LayeredAudioComponent;                             // 0x0258(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedParamValue;                                   // 0x0260(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedParamValuePrev;                               // 0x0264(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AcceleratingParamValue;                            // 0x0268(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingParamValue;                                 // 0x026C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ForwardVector;                                     // 0x0270(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ForwardVectorPrev;                                 // 0x027C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TurningParamValue;                                 // 0x0288(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PassByParamValue;                                  // 0x028C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LocallyControlledParamValue;                       // 0x0290(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LFOParamValue;                                     // 0x0294(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_Init();
	void BP_Update();
	void CacheReferences(class UFortLayeredAudioComponent* InLayeredAudioComponent);
	void Init(class AFortNevadaVehicle* InVehicle);
	void Update();

	class AFortNevadaVehicle* GetVehicleActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaAudioController">();
	}
	static class AFortNevadaAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNevadaAudioController>();
	}
};
static_assert(alignof(AFortNevadaAudioController) == 0x000008, "Wrong alignment on AFortNevadaAudioController");
static_assert(sizeof(AFortNevadaAudioController) == 0x0002A0, "Wrong size on AFortNevadaAudioController");
static_assert(offsetof(AFortNevadaAudioController, SpeedRangeMap) == 0x000220, "Member 'AFortNevadaAudioController::SpeedRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, TurningRangeMap) == 0x000228, "Member 'AFortNevadaAudioController::TurningRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, AcceleratingRangeMap) == 0x000230, "Member 'AFortNevadaAudioController::AcceleratingRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, BrakingRangeMap) == 0x000238, "Member 'AFortNevadaAudioController::BrakingRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, PassByRangeMap) == 0x000240, "Member 'AFortNevadaAudioController::PassByRangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LFORangeMap) == 0x000248, "Member 'AFortNevadaAudioController::LFORangeMap' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, Vehicle) == 0x000250, "Member 'AFortNevadaAudioController::Vehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LayeredAudioComponent) == 0x000258, "Member 'AFortNevadaAudioController::LayeredAudioComponent' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, SpeedParamValue) == 0x000260, "Member 'AFortNevadaAudioController::SpeedParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, SpeedParamValuePrev) == 0x000264, "Member 'AFortNevadaAudioController::SpeedParamValuePrev' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, AcceleratingParamValue) == 0x000268, "Member 'AFortNevadaAudioController::AcceleratingParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, BrakingParamValue) == 0x00026C, "Member 'AFortNevadaAudioController::BrakingParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, ForwardVector) == 0x000270, "Member 'AFortNevadaAudioController::ForwardVector' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, ForwardVectorPrev) == 0x00027C, "Member 'AFortNevadaAudioController::ForwardVectorPrev' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, TurningParamValue) == 0x000288, "Member 'AFortNevadaAudioController::TurningParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, PassByParamValue) == 0x00028C, "Member 'AFortNevadaAudioController::PassByParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LocallyControlledParamValue) == 0x000290, "Member 'AFortNevadaAudioController::LocallyControlledParamValue' has a wrong offset!");
static_assert(offsetof(AFortNevadaAudioController, LFOParamValue) == 0x000294, "Member 'AFortNevadaAudioController::LFOParamValue' has a wrong offset!");

// Class NevadaRuntime.FortNevadaVehicle
// 0x05D0 (0x1C10 - 0x1640)
class AFortNevadaVehicle final : public AFortAthenaSKVehicle
{
public:
	TWeakObjectPtr<class AController>             KillerController;                                  // 0x1638(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  KillerCauser;                                      // 0x1640(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNevadaState                           ServerReplicatedState;                             // 0x1648(0x0014)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_165C[0x4];                                     // 0x165C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortNevadaVehicleConfigs*              FortNevadaVehicleConfigs;                          // 0x1660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortNevadaVehicleConfigs>  FortNevadaVehicleConfigsClass;                     // 0x1668(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortNevadaAudioController> FortNevadaAudioControllerClass;                    // 0x1670(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChildActorComponent*                   AudioControllerActor;                              // 0x1678(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaAudioController*             FortNevadaAudioController;                         // 0x1680(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVehicleGamepadLiftInputs              LiftInputs;                                        // 0x1688(0x0008)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         LastBatteryRegenTickTime;                          // 0x1690(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostThrust;                                      // 0x1694(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostDrag;                                        // 0x1695(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostInputReleased;                               // 0x1696(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTractorBeamUprightForce;                       // 0x1697(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeadBattery;                                      // 0x1698(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1699[0x3];                                     // 0x1699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamExtraLengthForExtents;                  // 0x169C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CrashingDesiredUp;                                 // 0x16A0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostStartTime;                                    // 0x16AC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostPitchAlpha;                                   // 0x16B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostChargeProgress;                               // 0x16B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BoostChargesAvailable;                             // 0x16B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CachedBoostMoveDir;                                // 0x16BC(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentStateStartTime;                             // 0x16C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HeightAtLandingTime;                               // 0x16CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingScrapingTime;                              // 0x16D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingNotMovingTimer;                            // 0x16D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AltimeterTraceHitDistance;                         // 0x16D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TractorBeamAppliedForceMagnitude;                  // 0x16DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AnimParamDriverSeatLeftRight;                      // 0x16E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AnimParamDriverSeatForwardBack;                    // 0x16E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNegativeLift;                                // 0x16E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForcePositiveLift;                                // 0x16E9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitialLift;                                      // 0x16EA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENevadaFlightStates                           CurrentVehicleState;                               // 0x16EB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16EC[0x4C];                                    // 0x16EC(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ALandscapeProxy>         CachedLandscapeProxy;                              // 0x1738(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode_AthenaVehicle> PassengerCameraModeClass;                          // 0x1740(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1748[0x1];                                     // 0x1748(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTractorBeamChargeStarted;                         // 0x1749(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_174A[0x6];                                     // 0x174A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTowhookParams                         TowhookParams;                                     // 0x1750(0x00D0)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortAthenaVehicle>         AttachedPawnHiddenVehicle;                         // 0x1820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPrimitiveComponent>     TractorBeamAttachedPrimitive;                      // 0x1828(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     SpawnedTractorBeamVictimVehicle;                   // 0x1830(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPrimitiveComponent>     PreviousTractorBeamAttachedPrimitive;              // 0x1838(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         TractorBeamTargetedActors;                         // 0x1840(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         PreviouslyTargetedActors;                          // 0x1850(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 TractorBeamAttachedActor;                          // 0x1860(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TractorBeamTargetedActor;                          // 0x1868(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TractorBeamTargetPosition;                         // 0x1870(0x000C)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_187C[0x1];                                     // 0x187C(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBeamButtonReleased;                               // 0x187D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_187E[0x2];                                     // 0x187E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      TractorBeamObjectsTypes;                           // 0x1880(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisallowedBeamTags;                                // 0x1890(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  AlwaysAllowedBeamTags;                             // 0x18B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_18D0[0x98];                                    // 0x18D0(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         TractorBeamFX_Unattached;                          // 0x1968(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         TractorBeamFX_Attached;                            // 0x1970(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      BeamPSC;                                           // 0x1978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1980[0x50];                                    // 0x1980(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	ETractorBeamState                             TractorBeamState;                                  // 0x19D0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19D1[0x27];                                    // 0x19D1(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamDeactivationTimestamp;                  // 0x19F8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TractorBeamDisruptedTimestamp;                     // 0x19FC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A00[0x80];                                    // 0x1A00(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CockpitHealth;                                     // 0x1A80(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Native_CockpitEnabled;                             // 0x1A84(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastCockpitHealthTickTime;                         // 0x1A88(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastCockpitDamageTime;                             // 0x1A8C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CockpitDissolveStartTime;                          // 0x1A90(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A94[0x4];                                     // 0x1A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CockpitMaxHealth;                                  // 0x1A98(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitHealthTickRate;                             // 0x1AC0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitHealthPerTick;                              // 0x1AE8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CockpitRegenDelay;                                 // 0x1B10(0x0028)(Edit, NativeAccessSpecifierPublic)
	class UCurveFloat*                            CockpitHitMaterialWobble;                          // 0x1B38(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastDamageAlpha;                                   // 0x1B40(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDissolvingCockpit;                                // 0x1B44(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoringCockpit;                                 // 0x1B45(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCockpitWobble;                                    // 0x1B46(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B47[0x1];                                     // 0x1B47(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   NativeComp_ShieldMesh;                             // 0x1B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_CockpitMaterial;                            // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_EnergyRingMatInstance;                      // 0x1B58(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Native_EnergyFieldMatInstance;                     // 0x1B60(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        NativeComp_DamageStateLastLife;                    // 0x1B68(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        NativeComp_DamageState;                            // 0x1B70(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Native_LastHitLocation;                            // 0x1B78(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Native_LastHitNormal;                              // 0x1B84(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_DamageStateFX;                          // 0x1B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_HologramScreen;                         // 0x1B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NativeComp_SpeedLines;                             // 0x1BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Native_EnergyRingMat;                              // 0x1BA8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Native_EnergyFieldMat;                             // 0x1BB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         NativeSys_DamageStateFX;                           // 0x1BB8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         NativeSys_CockpitDestroyed;                        // 0x1BC0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitDamagedSound;                               // 0x1BC8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitDestroyedSound;                             // 0x1BD0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             CockpitRespawnSound;                               // 0x1BD8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Native_DamageStateSound;                           // 0x1BE0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Native_DamageStateLastLifeSound;                   // 0x1BE8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UForceFeedbackEffect*                   CockpitDeactivatedForceFeedback;                   // 0x1BF0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>        CockpitDestroyedCamShake;                          // 0x1BF8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             TractorBeamDisallowedClasses;                      // 0x1C00(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void AddPhysicsImpulseToTractorBeamAttachedActor(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void DisruptTractorBeam();
	void EnablePilotBubbleCollisionOnServer(bool bNewCollisionEnabled);
	void GetDriverSeatRotationAnimParams(float* OutLeftRight, float* OutForwardBack);
	void NativeToggleCockpit(bool bEnable);
	void OnAttachedActorDestroyed(class AActor* DestroyedActor);
	void OnAttachedActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnBatteryRegen(float Newcharge);
	void OnBoostChargeRefilled();
	void OnBoostFinished();
	void OnBoostStarted();
	void OnCrashedImpact();
	void OnCrashingStarted();
	void OnExplode();
	void OnNewVehicleState(ENevadaFlightStates NewVehicleState);
	void OnOutOfBattery();
	void OnRebootFinished();
	void OnRebootStarted();
	void OnRep_NevadaState(const struct FNevadaState& PrevState);
	void OnRep_ReplicatedTargetedActors();
	void OnRep_TargetedActorChanged();
	void OnRep_TractorBeamAttached();
	void OnRep_TractorBeamChargeStarted();
	void OnRep_TractorBeamState(const ETractorBeamState PreviousState);
	void OnStartAscend();
	void OnStartDescend();
	void OnTargetedActorChanged(class AActor* NewTargetedActor);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const struct FVector& LastBeamPosition);
	void OnTractorBeamDetached(class AActor* DetachedActor, const struct FVector& LastBeamPosition);
	void SetAttachedPawnAddedVelocity(const struct FVector& AddedVelocity);
	void SetCannonEnabled(const bool bEnabled);
	void SetTractorBeamEnabled(const bool bEnabled);
	void SetTractorBeamInactive();

	class AFortNevadaAudioController* GetAudioController() const;
	float GetBatteryCharge() const;
	float GetBoostChargeProgress() const;
	int32 GetBoostChargesAvailable() const;
	float GetBoostChargeTimeRemaining() const;
	ENevadaFlightStates GetCurrentVehicleState() const;
	float GetEnergyCanonChargePercent() const;
	int32 GetNumRebootsAvailable() const;
	struct FVector GetTractorBeamAttachLocation() const;
	bool IsTractorBeamActive() const;
	bool IsTractorBeamAttached() const;
	bool IsTractorBeamDisrupted() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicle">();
	}
	static class AFortNevadaVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortNevadaVehicle>();
	}
};
static_assert(alignof(AFortNevadaVehicle) == 0x000010, "Wrong alignment on AFortNevadaVehicle");
static_assert(sizeof(AFortNevadaVehicle) == 0x001C10, "Wrong size on AFortNevadaVehicle");
static_assert(offsetof(AFortNevadaVehicle, KillerController) == 0x001638, "Member 'AFortNevadaVehicle::KillerController' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, KillerCauser) == 0x001640, "Member 'AFortNevadaVehicle::KillerCauser' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, ServerReplicatedState) == 0x001648, "Member 'AFortNevadaVehicle::ServerReplicatedState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaVehicleConfigs) == 0x001660, "Member 'AFortNevadaVehicle::FortNevadaVehicleConfigs' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaVehicleConfigsClass) == 0x001668, "Member 'AFortNevadaVehicle::FortNevadaVehicleConfigsClass' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaAudioControllerClass) == 0x001670, "Member 'AFortNevadaVehicle::FortNevadaAudioControllerClass' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AudioControllerActor) == 0x001678, "Member 'AFortNevadaVehicle::AudioControllerActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, FortNevadaAudioController) == 0x001680, "Member 'AFortNevadaVehicle::FortNevadaAudioController' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LiftInputs) == 0x001688, "Member 'AFortNevadaVehicle::LiftInputs' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastBatteryRegenTickTime) == 0x001690, "Member 'AFortNevadaVehicle::LastBatteryRegenTickTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostThrust) == 0x001694, "Member 'AFortNevadaVehicle::bBoostThrust' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostDrag) == 0x001695, "Member 'AFortNevadaVehicle::bBoostDrag' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBoostInputReleased) == 0x001696, "Member 'AFortNevadaVehicle::bBoostInputReleased' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bUseTractorBeamUprightForce) == 0x001697, "Member 'AFortNevadaVehicle::bUseTractorBeamUprightForce' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bDeadBattery) == 0x001698, "Member 'AFortNevadaVehicle::bDeadBattery' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamExtraLengthForExtents) == 0x00169C, "Member 'AFortNevadaVehicle::TractorBeamExtraLengthForExtents' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingDesiredUp) == 0x0016A0, "Member 'AFortNevadaVehicle::CrashingDesiredUp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostStartTime) == 0x0016AC, "Member 'AFortNevadaVehicle::BoostStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostPitchAlpha) == 0x0016B0, "Member 'AFortNevadaVehicle::BoostPitchAlpha' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostChargeProgress) == 0x0016B4, "Member 'AFortNevadaVehicle::BoostChargeProgress' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BoostChargesAvailable) == 0x0016B8, "Member 'AFortNevadaVehicle::BoostChargesAvailable' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CachedBoostMoveDir) == 0x0016BC, "Member 'AFortNevadaVehicle::CachedBoostMoveDir' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CurrentStateStartTime) == 0x0016C8, "Member 'AFortNevadaVehicle::CurrentStateStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, HeightAtLandingTime) == 0x0016CC, "Member 'AFortNevadaVehicle::HeightAtLandingTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingScrapingTime) == 0x0016D0, "Member 'AFortNevadaVehicle::CrashingScrapingTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CrashingNotMovingTimer) == 0x0016D4, "Member 'AFortNevadaVehicle::CrashingNotMovingTimer' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AltimeterTraceHitDistance) == 0x0016D8, "Member 'AFortNevadaVehicle::AltimeterTraceHitDistance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAppliedForceMagnitude) == 0x0016DC, "Member 'AFortNevadaVehicle::TractorBeamAppliedForceMagnitude' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AnimParamDriverSeatLeftRight) == 0x0016E0, "Member 'AFortNevadaVehicle::AnimParamDriverSeatLeftRight' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AnimParamDriverSeatForwardBack) == 0x0016E4, "Member 'AFortNevadaVehicle::AnimParamDriverSeatForwardBack' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bForceNegativeLift) == 0x0016E8, "Member 'AFortNevadaVehicle::bForceNegativeLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bForcePositiveLift) == 0x0016E9, "Member 'AFortNevadaVehicle::bForcePositiveLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bInitialLift) == 0x0016EA, "Member 'AFortNevadaVehicle::bInitialLift' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CurrentVehicleState) == 0x0016EB, "Member 'AFortNevadaVehicle::CurrentVehicleState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CachedLandscapeProxy) == 0x001738, "Member 'AFortNevadaVehicle::CachedLandscapeProxy' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PassengerCameraModeClass) == 0x001740, "Member 'AFortNevadaVehicle::PassengerCameraModeClass' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bTractorBeamChargeStarted) == 0x001749, "Member 'AFortNevadaVehicle::bTractorBeamChargeStarted' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TowhookParams) == 0x001750, "Member 'AFortNevadaVehicle::TowhookParams' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AttachedPawnHiddenVehicle) == 0x001820, "Member 'AFortNevadaVehicle::AttachedPawnHiddenVehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAttachedPrimitive) == 0x001828, "Member 'AFortNevadaVehicle::TractorBeamAttachedPrimitive' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, SpawnedTractorBeamVictimVehicle) == 0x001830, "Member 'AFortNevadaVehicle::SpawnedTractorBeamVictimVehicle' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PreviousTractorBeamAttachedPrimitive) == 0x001838, "Member 'AFortNevadaVehicle::PreviousTractorBeamAttachedPrimitive' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetedActors) == 0x001840, "Member 'AFortNevadaVehicle::TractorBeamTargetedActors' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, PreviouslyTargetedActors) == 0x001850, "Member 'AFortNevadaVehicle::PreviouslyTargetedActors' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamAttachedActor) == 0x001860, "Member 'AFortNevadaVehicle::TractorBeamAttachedActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetedActor) == 0x001868, "Member 'AFortNevadaVehicle::TractorBeamTargetedActor' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamTargetPosition) == 0x001870, "Member 'AFortNevadaVehicle::TractorBeamTargetPosition' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bBeamButtonReleased) == 0x00187D, "Member 'AFortNevadaVehicle::bBeamButtonReleased' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamObjectsTypes) == 0x001880, "Member 'AFortNevadaVehicle::TractorBeamObjectsTypes' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, DisallowedBeamTags) == 0x001890, "Member 'AFortNevadaVehicle::DisallowedBeamTags' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, AlwaysAllowedBeamTags) == 0x0018B0, "Member 'AFortNevadaVehicle::AlwaysAllowedBeamTags' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamFX_Unattached) == 0x001968, "Member 'AFortNevadaVehicle::TractorBeamFX_Unattached' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamFX_Attached) == 0x001970, "Member 'AFortNevadaVehicle::TractorBeamFX_Attached' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, BeamPSC) == 0x001978, "Member 'AFortNevadaVehicle::BeamPSC' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamState) == 0x0019D0, "Member 'AFortNevadaVehicle::TractorBeamState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDeactivationTimestamp) == 0x0019F8, "Member 'AFortNevadaVehicle::TractorBeamDeactivationTimestamp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDisruptedTimestamp) == 0x0019FC, "Member 'AFortNevadaVehicle::TractorBeamDisruptedTimestamp' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealth) == 0x001A80, "Member 'AFortNevadaVehicle::CockpitHealth' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_CockpitEnabled) == 0x001A84, "Member 'AFortNevadaVehicle::Native_CockpitEnabled' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastCockpitHealthTickTime) == 0x001A88, "Member 'AFortNevadaVehicle::LastCockpitHealthTickTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastCockpitDamageTime) == 0x001A8C, "Member 'AFortNevadaVehicle::LastCockpitDamageTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDissolveStartTime) == 0x001A90, "Member 'AFortNevadaVehicle::CockpitDissolveStartTime' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitMaxHealth) == 0x001A98, "Member 'AFortNevadaVehicle::CockpitMaxHealth' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealthTickRate) == 0x001AC0, "Member 'AFortNevadaVehicle::CockpitHealthTickRate' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHealthPerTick) == 0x001AE8, "Member 'AFortNevadaVehicle::CockpitHealthPerTick' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitRegenDelay) == 0x001B10, "Member 'AFortNevadaVehicle::CockpitRegenDelay' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitHitMaterialWobble) == 0x001B38, "Member 'AFortNevadaVehicle::CockpitHitMaterialWobble' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, LastDamageAlpha) == 0x001B40, "Member 'AFortNevadaVehicle::LastDamageAlpha' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bDissolvingCockpit) == 0x001B44, "Member 'AFortNevadaVehicle::bDissolvingCockpit' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bRestoringCockpit) == 0x001B45, "Member 'AFortNevadaVehicle::bRestoringCockpit' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, bCockpitWobble) == 0x001B46, "Member 'AFortNevadaVehicle::bCockpitWobble' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_ShieldMesh) == 0x001B48, "Member 'AFortNevadaVehicle::NativeComp_ShieldMesh' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_CockpitMaterial) == 0x001B50, "Member 'AFortNevadaVehicle::Native_CockpitMaterial' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyRingMatInstance) == 0x001B58, "Member 'AFortNevadaVehicle::Native_EnergyRingMatInstance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyFieldMatInstance) == 0x001B60, "Member 'AFortNevadaVehicle::Native_EnergyFieldMatInstance' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageStateLastLife) == 0x001B68, "Member 'AFortNevadaVehicle::NativeComp_DamageStateLastLife' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageState) == 0x001B70, "Member 'AFortNevadaVehicle::NativeComp_DamageState' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_LastHitLocation) == 0x001B78, "Member 'AFortNevadaVehicle::Native_LastHitLocation' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_LastHitNormal) == 0x001B84, "Member 'AFortNevadaVehicle::Native_LastHitNormal' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_DamageStateFX) == 0x001B90, "Member 'AFortNevadaVehicle::NativeComp_DamageStateFX' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_HologramScreen) == 0x001B98, "Member 'AFortNevadaVehicle::NativeComp_HologramScreen' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeComp_SpeedLines) == 0x001BA0, "Member 'AFortNevadaVehicle::NativeComp_SpeedLines' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyRingMat) == 0x001BA8, "Member 'AFortNevadaVehicle::Native_EnergyRingMat' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_EnergyFieldMat) == 0x001BB0, "Member 'AFortNevadaVehicle::Native_EnergyFieldMat' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeSys_DamageStateFX) == 0x001BB8, "Member 'AFortNevadaVehicle::NativeSys_DamageStateFX' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, NativeSys_CockpitDestroyed) == 0x001BC0, "Member 'AFortNevadaVehicle::NativeSys_CockpitDestroyed' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDamagedSound) == 0x001BC8, "Member 'AFortNevadaVehicle::CockpitDamagedSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDestroyedSound) == 0x001BD0, "Member 'AFortNevadaVehicle::CockpitDestroyedSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitRespawnSound) == 0x001BD8, "Member 'AFortNevadaVehicle::CockpitRespawnSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_DamageStateSound) == 0x001BE0, "Member 'AFortNevadaVehicle::Native_DamageStateSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, Native_DamageStateLastLifeSound) == 0x001BE8, "Member 'AFortNevadaVehicle::Native_DamageStateLastLifeSound' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDeactivatedForceFeedback) == 0x001BF0, "Member 'AFortNevadaVehicle::CockpitDeactivatedForceFeedback' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, CockpitDestroyedCamShake) == 0x001BF8, "Member 'AFortNevadaVehicle::CockpitDestroyedCamShake' has a wrong offset!");
static_assert(offsetof(AFortNevadaVehicle, TractorBeamDisallowedClasses) == 0x001C00, "Member 'AFortNevadaVehicle::TractorBeamDisallowedClasses' has a wrong offset!");

// Class NevadaRuntime.FortNevadaVehicleAnimInstance
// 0x0100 (0x0540 - 0x0440)
class UFortNevadaVehicleAnimInstance final : public UFortVehicleAnimInstance
{
public:
	class AFortNevadaVehicle*                     NevadaVehicle;                                     // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsAttached;                           // 0x0440(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsCharging;                           // 0x0441(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsActive;                             // 0x0442(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsInactive;                           // 0x0443(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_IsOn;                                 // 0x0444(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_HasTarget;                            // 0x0445(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeam_ShouldApplyCustomAO;                  // 0x0446(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_447[0x1];                                      // 0x0447(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeam_LookAtPitch;                           // 0x0448(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TractorBeam_LookAtYaw;                             // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanLeftRight;                                     // 0x0450(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanForwardBackward;                               // 0x0454(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanValue;                                         // 0x0458(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousLeanValue;                                 // 0x045C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityZValue;                                    // 0x0460(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanDelta;                                         // 0x0464(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
