#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewQuestTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function NewQuestTooltip.NewQuestTooltip_C.ExecuteUbergraph_NewQuestTooltip
// 0x0058 (0x0058 - 0x0000)
struct NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip) == 0x000008, "Wrong alignment on NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip");
static_assert(sizeof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip) == 0x000058, "Wrong size on NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, EntryPoint) == 0x000000, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000040, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000048, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'NewQuestTooltip_C_ExecuteUbergraph_NewQuestTooltip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

