#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewQuestTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewQuestTooltip.NewQuestTooltip_C
// 0x0030 (0x02E0 - 0x02B0)
class UNewQuestTooltip_C final : public UAthenaChallengeInviteFriendCallout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NewQuestTooltip(int32 EntryPoint);
	void BP_PlayQuestCTA();
	void Finished_EF9715224E45E9121D93B897E19E1AA2();
	void Finished_0DB3F4D24910625FCD448F81581FAA4C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewQuestTooltip_C">();
	}
	static class UNewQuestTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewQuestTooltip_C>();
	}
};
static_assert(alignof(UNewQuestTooltip_C) == 0x000008, "Wrong alignment on UNewQuestTooltip_C");
static_assert(sizeof(UNewQuestTooltip_C) == 0x0002E0, "Wrong size on UNewQuestTooltip_C");
static_assert(offsetof(UNewQuestTooltip_C, UberGraphFrame) == 0x0002B0, "Member 'UNewQuestTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewQuestTooltip_C, Outro) == 0x0002B8, "Member 'UNewQuestTooltip_C::Outro' has a wrong offset!");
static_assert(offsetof(UNewQuestTooltip_C, Pulse) == 0x0002C0, "Member 'UNewQuestTooltip_C::Pulse' has a wrong offset!");
static_assert(offsetof(UNewQuestTooltip_C, CommonRichTextBlock_140) == 0x0002C8, "Member 'UNewQuestTooltip_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(UNewQuestTooltip_C, Image_Arrow) == 0x0002D0, "Member 'UNewQuestTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UNewQuestTooltip_C, ImageBurst) == 0x0002D8, "Member 'UNewQuestTooltip_C::ImageBurst' has a wrong offset!");

}

