#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_Tree_Apollo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_Tree_Apollo.Parent_Tree_Apollo_C
// 0x0030 (0x0D70 - 0x0D40)
class AParent_Tree_Apollo_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Has_Bugs;                                          // 0x0D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D49[0x3];                                      // 0x0D49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Use_Lightning_Bug;                                 // 0x0D4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BugOffset;                                         // 0x0D50(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Falling_Leaves;                                // 0x0D5C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5D[0x3];                                      // 0x0D5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeavesOffset;                                      // 0x0D60(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Parent_Tree_Apollo(int32 EntryPoint);
	void RemoveUnderwaterTrees();
	void OnWaterLevelSetOffline();
	void UserConstructionScript();
	bool IsSubmergedByWater();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_Tree_Apollo_C">();
	}
	static class AParent_Tree_Apollo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_Tree_Apollo_C>();
	}
};
static_assert(alignof(AParent_Tree_Apollo_C) == 0x000008, "Wrong alignment on AParent_Tree_Apollo_C");
static_assert(sizeof(AParent_Tree_Apollo_C) == 0x000D70, "Wrong size on AParent_Tree_Apollo_C");
static_assert(offsetof(AParent_Tree_Apollo_C, UberGraphFrame) == 0x000D40, "Member 'AParent_Tree_Apollo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Has_Bugs) == 0x000D48, "Member 'AParent_Tree_Apollo_C::Has_Bugs' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Use_Lightning_Bug) == 0x000D4C, "Member 'AParent_Tree_Apollo_C::Use_Lightning_Bug' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, BugOffset) == 0x000D50, "Member 'AParent_Tree_Apollo_C::BugOffset' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, Has_Falling_Leaves) == 0x000D5C, "Member 'AParent_Tree_Apollo_C::Has_Falling_Leaves' has a wrong offset!");
static_assert(offsetof(AParent_Tree_Apollo_C, LeavesOffset) == 0x000D60, "Member 'AParent_Tree_Apollo_C::LeavesOffset' has a wrong offset!");

}

