#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PendingAccountMergeNotification

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PendingAccountMergeNotification.PendingAccountMergeNotification_C
// 0x0030 (0x0C50 - 0x0C20)
class UPendingAccountMergeNotification_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_48;                             // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_42;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_45;                                      // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PendingAccountMergeNotification(int32 EntryPoint);
	void OnInputChanged(ECommonInputType bNewInputType);
	void Destruct();
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Hovered(bool IsHovered_0);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PendingAccountMergeNotification_C">();
	}
	static class UPendingAccountMergeNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPendingAccountMergeNotification_C>();
	}
};
static_assert(alignof(UPendingAccountMergeNotification_C) == 0x000008, "Wrong alignment on UPendingAccountMergeNotification_C");
static_assert(sizeof(UPendingAccountMergeNotification_C) == 0x000C50, "Wrong size on UPendingAccountMergeNotification_C");
static_assert(offsetof(UPendingAccountMergeNotification_C, UberGraphFrame) == 0x000C20, "Member 'UPendingAccountMergeNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Hover) == 0x000C28, "Member 'UPendingAccountMergeNotification_C::Hover' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, Border_1) == 0x000C30, "Member 'UPendingAccountMergeNotification_C::Border_1' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, CommonActionWidget_48) == 0x000C38, "Member 'UPendingAccountMergeNotification_C::CommonActionWidget_48' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_42) == 0x000C40, "Member 'UPendingAccountMergeNotification_C::TextBlock_42' has a wrong offset!");
static_assert(offsetof(UPendingAccountMergeNotification_C, TextBlock_45) == 0x000C48, "Member 'UPendingAccountMergeNotification_C::TextBlock_45' has a wrong offset!");

}

