#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plane_Water_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Plane_Water_Blueprint.Plane_Water_Blueprint_C
// 0x0028 (0x0278 - 0x0250)
class APlane_Water_Blueprint_C final : public AFortStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               water_material;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FarwaveINormaIIntensity;                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Roughness;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FarWaveNormalScaleFare;                            // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Plane_Water_Blueprint(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Plane_Water_Blueprint_C">();
	}
	static class APlane_Water_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlane_Water_Blueprint_C>();
	}
};
static_assert(alignof(APlane_Water_Blueprint_C) == 0x000008, "Wrong alignment on APlane_Water_Blueprint_C");
static_assert(sizeof(APlane_Water_Blueprint_C) == 0x000278, "Wrong size on APlane_Water_Blueprint_C");
static_assert(offsetof(APlane_Water_Blueprint_C, UberGraphFrame) == 0x000250, "Member 'APlane_Water_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlane_Water_Blueprint_C, water_material) == 0x000258, "Member 'APlane_Water_Blueprint_C::water_material' has a wrong offset!");
static_assert(offsetof(APlane_Water_Blueprint_C, FarwaveINormaIIntensity) == 0x000260, "Member 'APlane_Water_Blueprint_C::FarwaveINormaIIntensity' has a wrong offset!");
static_assert(offsetof(APlane_Water_Blueprint_C, Roughness) == 0x000268, "Member 'APlane_Water_Blueprint_C::Roughness' has a wrong offset!");
static_assert(offsetof(APlane_Water_Blueprint_C, FarWaveNormalScaleFare) == 0x000270, "Member 'APlane_Water_Blueprint_C::FarWaveNormalScaleFare' has a wrong offset!");

}

