#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plane_Water_Blueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function Plane_Water_Blueprint.Plane_Water_Blueprint_C.ExecuteUbergraph_Plane_Water_Blueprint
// 0x0018 (0x0018 - 0x0000)
struct Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsErebus_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint) == 0x000008, "Wrong alignment on Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint");
static_assert(sizeof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint) == 0x000018, "Wrong size on Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, EntryPoint) == 0x000000, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, CallFunc_IsMobileGame_ReturnValue) == 0x000010, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, CallFunc_IsErebus_ReturnValue) == 0x000011, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::CallFunc_IsErebus_ReturnValue' has a wrong offset!");
static_assert(offsetof(Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'Plane_Water_Blueprint_C_ExecuteUbergraph_Plane_Water_Blueprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

