#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyRatingChoice

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.ExecuteUbergraph_PlayerSurveyRatingChoice
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice) == 0x000004, "Wrong alignment on PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice");
static_assert(sizeof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice) == 0x000004, "Wrong size on PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice");
static_assert(offsetof(PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice, EntryPoint) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice::EntryPoint' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateTextStyle
// 0x0040 (0x0040 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateTextStyle final
{
public:
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(PlayerSurveyRatingChoice_C_UpdateTextStyle) == 0x000008, "Wrong alignment on PlayerSurveyRatingChoice_C_UpdateTextStyle");
static_assert(sizeof(PlayerSurveyRatingChoice_C_UpdateTextStyle) == 0x000040, "Wrong size on PlayerSurveyRatingChoice_C_UpdateTextStyle");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, CallFunc_GetCurrentTextStyle_ReturnValue) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::CallFunc_GetCurrentTextStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, CallFunc_GetColor_OutColor) == 0x000008, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::CallFunc_GetColor_OutColor' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateTextStyle, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'PlayerSurveyRatingChoice_C_UpdateTextStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateInputActionRenderOpacity
// 0x0014 (0x0014 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity) == 0x000004, "Wrong alignment on PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity");
static_assert(sizeof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity) == 0x000014, "Wrong size on PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_bool_Variable) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable) == 0x000004, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable_1) == 0x000008, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, CallFunc_IsHovered_ReturnValue) == 0x00000C, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity, K2Node_Select_Default) == 0x000010, "Member 'PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity::K2Node_Select_Default' has a wrong offset!");

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.GetCurrentButtonBrush
// 0x0788 (0x0788 - 0x0000)
struct PlayerSurveyRatingChoice_C_GetCurrentButtonBrush final
{
public:
	struct FSlateBrush                            CurrentBrush;                                      // 0x0000(0x0088)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue_1;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetDisabledBrush_Brush;                   // 0x00A0(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalBaseBrush_Brush;                 // 0x0128(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalHoveredBrush_Brush;              // 0x01B0(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalPressedBrush_Brush;              // 0x0238(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x02C0(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedPressedBrush_Brush;            // 0x0348(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x03D0(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedBaseBrush_Brush;               // 0x0458(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedHoveredBrush_Brush;            // 0x04E0(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x0568(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_3;                           // 0x05F0(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_4;                           // 0x0678(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_5;                           // 0x0700(0x0088)()
};
static_assert(alignof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush) == 0x000008, "Wrong alignment on PlayerSurveyRatingChoice_C_GetCurrentButtonBrush");
static_assert(sizeof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush) == 0x000788, "Wrong size on PlayerSurveyRatingChoice_C_GetCurrentButtonBrush");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CurrentBrush) == 0x000000, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CurrentBrush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable) == 0x000088, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_1) == 0x000089, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_2) == 0x00008A, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_3) == 0x00008B, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_4) == 0x00008C, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_5) == 0x00008D, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue) == 0x00008E, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue) == 0x00008F, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue_1) == 0x000090, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue_1) == 0x000091, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelected_ReturnValue) == 0x000092, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetIsEnabled_ReturnValue) == 0x000093, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetStyle_ReturnValue) == 0x000098, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetDisabledBrush_Brush) == 0x0000A0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetDisabledBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalBaseBrush_Brush) == 0x000128, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalHoveredBrush_Brush) == 0x0001B0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalPressedBrush_Brush) == 0x000238, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default) == 0x0002C0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedPressedBrush_Brush) == 0x000348, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_1) == 0x0003D0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedBaseBrush_Brush) == 0x000458, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedHoveredBrush_Brush) == 0x0004E0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_2) == 0x000568, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_3) == 0x0005F0, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_4) == 0x000678, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyRatingChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_5) == 0x000700, "Member 'PlayerSurveyRatingChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_5' has a wrong offset!");

}

