#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSidewaysComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SidewaysCodeRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerSidewaysComponent.PlayerSidewaysComponent_C.ExecuteUbergraph_PlayerSidewaysComponent
// 0x00B0 (0x00B0 - 0x0000)
struct PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASidewaysPlayspace*                     K2Node_Event_NewSidewaysPlayspace;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                K2Node_Event_OldState;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                K2Node_Event_NewState;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALargeSidewaysPlayspace_C*              K2Node_DynamicCast_AsLarge_Sideways_Playspace;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASmallSidewaysPlayspace_C*              K2Node_DynamicCast_AsSmall_Sideways_Playspace;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent) == 0x000008, "Wrong alignment on PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent");
static_assert(sizeof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent) == 0x0000B0, "Wrong size on PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, EntryPoint) == 0x000000, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_Event_NewSidewaysPlayspace) == 0x000008, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_Event_NewSidewaysPlayspace' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_Event_OldState) == 0x000010, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_Event_NewState) == 0x000011, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_HasAuthority_ReturnValue) == 0x000022, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000023, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_AsLarge_Sideways_Playspace) == 0x000028, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_AsLarge_Sideways_Playspace' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_AsSmall_Sideways_Playspace) == 0x000038, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_AsSmall_Sideways_Playspace' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_IsValid_ReturnValue_2) == 0x000042, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000048, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000060, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000088, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000090, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0000A0, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000A8, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent, K2Node_Event_EndPlayReason) == 0x0000A9, "Member 'PlayerSidewaysComponent_C_ExecuteUbergraph_PlayerSidewaysComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function PlayerSidewaysComponent.PlayerSidewaysComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PlayerSidewaysComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSidewaysComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PlayerSidewaysComponent_C_ReceiveEndPlay");
static_assert(sizeof(PlayerSidewaysComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on PlayerSidewaysComponent_C_ReceiveEndPlay");
static_assert(offsetof(PlayerSidewaysComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PlayerSidewaysComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PlayerSidewaysComponent.PlayerSidewaysComponent_C.HandleSidewaysStateChanged
// 0x0010 (0x0010 - 0x0000)
struct PlayerSidewaysComponent_C_HandleSidewaysStateChanged final
{
public:
	class ASidewaysPlayspace*                     NewSidewaysPlayspace;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                OldState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                NewState;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSidewaysComponent_C_HandleSidewaysStateChanged) == 0x000008, "Wrong alignment on PlayerSidewaysComponent_C_HandleSidewaysStateChanged");
static_assert(sizeof(PlayerSidewaysComponent_C_HandleSidewaysStateChanged) == 0x000010, "Wrong size on PlayerSidewaysComponent_C_HandleSidewaysStateChanged");
static_assert(offsetof(PlayerSidewaysComponent_C_HandleSidewaysStateChanged, NewSidewaysPlayspace) == 0x000000, "Member 'PlayerSidewaysComponent_C_HandleSidewaysStateChanged::NewSidewaysPlayspace' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_HandleSidewaysStateChanged, OldState) == 0x000008, "Member 'PlayerSidewaysComponent_C_HandleSidewaysStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_HandleSidewaysStateChanged, NewState) == 0x000009, "Member 'PlayerSidewaysComponent_C_HandleSidewaysStateChanged::NewState' has a wrong offset!");

// Function PlayerSidewaysComponent.PlayerSidewaysComponent_C.UpdateGameplayAbilities
// 0x0028 (0x0028 - 0x0000)
struct PlayerSidewaysComponent_C_UpdateGameplayAbilities final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESidewaysState                                SidewaysState_0;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSidewaysComponent_C_UpdateGameplayAbilities) == 0x000008, "Wrong alignment on PlayerSidewaysComponent_C_UpdateGameplayAbilities");
static_assert(sizeof(PlayerSidewaysComponent_C_UpdateGameplayAbilities) == 0x000028, "Wrong size on PlayerSidewaysComponent_C_UpdateGameplayAbilities");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, AbilitySystemComponent) == 0x000000, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, SidewaysState_0) == 0x000008, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::SidewaysState_0' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x00000C, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue) == 0x000010, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1) == 0x000018, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSidewaysComponent_C_UpdateGameplayAbilities, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1) == 0x000020, "Member 'PlayerSidewaysComponent_C_UpdateGameplayAbilities::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1' has a wrong offset!");

}

