#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyResponseChoice

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.ExecuteUbergraph_PlayerSurveyResponseChoice
// 0x0008 (0x0008 - 0x0000)
struct PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlayerSurveyResponseChoiceType           K2Node_Event_Type;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice) == 0x000004, "Wrong alignment on PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice");
static_assert(sizeof(PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice) == 0x000008, "Wrong size on PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice");
static_assert(offsetof(PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice, EntryPoint) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice, K2Node_Event_Type) == 0x000004, "Member 'PlayerSurveyResponseChoice_C_ExecuteUbergraph_PlayerSurveyResponseChoice::K2Node_Event_Type' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.SetChoiceType
// 0x0001 (0x0001 - 0x0000)
struct PlayerSurveyResponseChoice_C_SetChoiceType final
{
public:
	EFortPlayerSurveyResponseChoiceType           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyResponseChoice_C_SetChoiceType) == 0x000001, "Wrong alignment on PlayerSurveyResponseChoice_C_SetChoiceType");
static_assert(sizeof(PlayerSurveyResponseChoice_C_SetChoiceType) == 0x000001, "Wrong size on PlayerSurveyResponseChoice_C_SetChoiceType");
static_assert(offsetof(PlayerSurveyResponseChoice_C_SetChoiceType, Type) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_SetChoiceType::Type' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.UpdateButtonColor
// 0x0108 (0x0108 - 0x0000)
struct PlayerSurveyResponseChoice_C_UpdateButtonColor final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetCurrentButtonBrush_CurrentBrush;       // 0x0020(0x0088)()
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0028)()
};
static_assert(alignof(PlayerSurveyResponseChoice_C_UpdateButtonColor) == 0x000008, "Wrong alignment on PlayerSurveyResponseChoice_C_UpdateButtonColor");
static_assert(sizeof(PlayerSurveyResponseChoice_C_UpdateButtonColor) == 0x000108, "Wrong size on PlayerSurveyResponseChoice_C_UpdateButtonColor");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, Temp_bool_Variable) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, Temp_struct_Variable) == 0x000004, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000018, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_GetCurrentButtonBrush_CurrentBrush) == 0x000020, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_GetCurrentButtonBrush_CurrentBrush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_GetSelected_ReturnValue) == 0x0000A8, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_GetCurrentTextStyle_ReturnValue) == 0x0000B0, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_GetCurrentTextStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B8, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_GetColor_OutColor) == 0x0000BC, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_GetColor_OutColor' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, CallFunc_BooleanAND_ReturnValue) == 0x0000CC, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, K2Node_Select_Default) == 0x0000D0, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateButtonColor, K2Node_MakeStruct_SlateColor) == 0x0000E0, "Member 'PlayerSurveyResponseChoice_C_UpdateButtonColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.UpdateInputActionRenderOpacity
// 0x0014 (0x0014 - 0x0000)
struct PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity) == 0x000004, "Wrong alignment on PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity");
static_assert(sizeof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity) == 0x000014, "Wrong size on PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity, Temp_bool_Variable) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable) == 0x000004, "Member 'PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity, Temp_float_Variable_1) == 0x000008, "Member 'PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity, CallFunc_IsHovered_ReturnValue) == 0x00000C, "Member 'PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity, K2Node_Select_Default) == 0x000010, "Member 'PlayerSurveyResponseChoice_C_UpdateInputActionRenderOpacity::K2Node_Select_Default' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.UpdateChoiceImage
// 0x01A0 (0x01A0 - 0x0000)
struct PlayerSurveyResponseChoice_C_UpdateChoiceImage final
{
public:
	EFortPlayerSurveyResponseChoiceType           Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0008(0x0088)(ConstParm)
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x0090(0x0088)(ConstParm)
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x0118(0x0088)(ConstParm)
};
static_assert(alignof(PlayerSurveyResponseChoice_C_UpdateChoiceImage) == 0x000008, "Wrong alignment on PlayerSurveyResponseChoice_C_UpdateChoiceImage");
static_assert(sizeof(PlayerSurveyResponseChoice_C_UpdateChoiceImage) == 0x0001A0, "Wrong size on PlayerSurveyResponseChoice_C_UpdateChoiceImage");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, Temp_byte_Variable) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, Temp_bool_Variable) == 0x000001, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, Temp_bool_Variable_1) == 0x000002, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, CallFunc_GetSelected_ReturnValue) == 0x000003, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, CallFunc_GetSelected_ReturnValue_1) == 0x000004, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, K2Node_Select_Default) == 0x000008, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, K2Node_Select_Default_1) == 0x000090, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_UpdateChoiceImage, K2Node_Select_Default_2) == 0x000118, "Member 'PlayerSurveyResponseChoice_C_UpdateChoiceImage::K2Node_Select_Default_2' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.GetCurrentButtonBrush
// 0x0788 (0x0788 - 0x0000)
struct PlayerSurveyResponseChoice_C_GetCurrentButtonBrush final
{
public:
	struct FSlateBrush                            CurrentBrush;                                      // 0x0000(0x0088)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue_1;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetDisabledBrush_Brush;                   // 0x00A0(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalBaseBrush_Brush;                 // 0x0128(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalHoveredBrush_Brush;              // 0x01B0(0x0088)()
	struct FSlateBrush                            CallFunc_GetNormalPressedBrush_Brush;              // 0x0238(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x02C0(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedPressedBrush_Brush;            // 0x0348(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x03D0(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedBaseBrush_Brush;               // 0x0458(0x0088)()
	struct FSlateBrush                            CallFunc_GetSelectedHoveredBrush_Brush;            // 0x04E0(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x0568(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_3;                           // 0x05F0(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_4;                           // 0x0678(0x0088)()
	struct FSlateBrush                            K2Node_Select_Default_5;                           // 0x0700(0x0088)()
};
static_assert(alignof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush) == 0x000008, "Wrong alignment on PlayerSurveyResponseChoice_C_GetCurrentButtonBrush");
static_assert(sizeof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush) == 0x000788, "Wrong size on PlayerSurveyResponseChoice_C_GetCurrentButtonBrush");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CurrentBrush) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CurrentBrush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable) == 0x000088, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_1) == 0x000089, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_2) == 0x00008A, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_3) == 0x00008B, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_4) == 0x00008C, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, Temp_bool_Variable_5) == 0x00008D, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue) == 0x00008E, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue) == 0x00008F, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_IsPressed_ReturnValue_1) == 0x000090, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_IsPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_IsHovered_ReturnValue_1) == 0x000091, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetSelected_ReturnValue) == 0x000092, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetIsEnabled_ReturnValue) == 0x000093, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetStyle_ReturnValue) == 0x000098, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetDisabledBrush_Brush) == 0x0000A0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetDisabledBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalBaseBrush_Brush) == 0x000128, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalHoveredBrush_Brush) == 0x0001B0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetNormalPressedBrush_Brush) == 0x000238, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetNormalPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default) == 0x0002C0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedPressedBrush_Brush) == 0x000348, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedPressedBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_1) == 0x0003D0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedBaseBrush_Brush) == 0x000458, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedBaseBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, CallFunc_GetSelectedHoveredBrush_Brush) == 0x0004E0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::CallFunc_GetSelectedHoveredBrush_Brush' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_2) == 0x000568, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_3) == 0x0005F0, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_4) == 0x000678, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_GetCurrentButtonBrush, K2Node_Select_Default_5) == 0x000700, "Member 'PlayerSurveyResponseChoice_C_GetCurrentButtonBrush::K2Node_Select_Default_5' has a wrong offset!");

// Function PlayerSurveyResponseChoice.PlayerSurveyResponseChoice_C.Update Text Scale
// 0x0070 (0x0070 - 0x0000)
struct PlayerSurveyResponseChoice_C_Update_Text_Scale final
{
public:
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerSurveyResponseChoice_C_Update_Text_Scale) == 0x000008, "Wrong alignment on PlayerSurveyResponseChoice_C_Update_Text_Scale");
static_assert(sizeof(PlayerSurveyResponseChoice_C_Update_Text_Scale) == 0x000070, "Wrong size on PlayerSurveyResponseChoice_C_Update_Text_Scale");
static_assert(offsetof(PlayerSurveyResponseChoice_C_Update_Text_Scale, CallFunc_GetDesiredSize_ReturnValue) == 0x000000, "Member 'PlayerSurveyResponseChoice_C_Update_Text_Scale::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_Update_Text_Scale, CallFunc_BreakVector2D_X) == 0x000008, "Member 'PlayerSurveyResponseChoice_C_Update_Text_Scale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_Update_Text_Scale, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'PlayerSurveyResponseChoice_C_Update_Text_Scale::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_Update_Text_Scale, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'PlayerSurveyResponseChoice_C_Update_Text_Scale::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(PlayerSurveyResponseChoice_C_Update_Text_Scale, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'PlayerSurveyResponseChoice_C_Update_Text_Scale::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

