#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlusMinusButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlusMinusButton.PlusMinusButton_C
// 0x0048 (0x0C18 - 0x0BD0)
class UPlusMinusButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundColor;                                   // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ButtonPrompt;                              // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0BF8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Font_Size;                                         // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLeft;                                            // 0x0C14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsBottom;                                          // 0x0C15(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_PlusMinusButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlusMinusButton_C">();
	}
	static class UPlusMinusButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlusMinusButton_C>();
	}
};
static_assert(alignof(UPlusMinusButton_C) == 0x000008, "Wrong alignment on UPlusMinusButton_C");
static_assert(sizeof(UPlusMinusButton_C) == 0x000C18, "Wrong size on UPlusMinusButton_C");
static_assert(offsetof(UPlusMinusButton_C, UberGraphFrame) == 0x000BD0, "Member 'UPlusMinusButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, HoverAnim) == 0x000BD8, "Member 'UPlusMinusButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, BackgroundColor) == 0x000BE0, "Member 'UPlusMinusButton_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, ButtonText) == 0x000BE8, "Member 'UPlusMinusButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, Overlay_ButtonPrompt) == 0x000BF0, "Member 'UPlusMinusButton_C::Overlay_ButtonPrompt' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, In_Text) == 0x000BF8, "Member 'UPlusMinusButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, Font_Size) == 0x000C10, "Member 'UPlusMinusButton_C::Font_Size' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, IsLeft) == 0x000C14, "Member 'UPlusMinusButton_C::IsLeft' has a wrong offset!");
static_assert(offsetof(UPlusMinusButton_C, IsBottom) == 0x000C15, "Member 'UPlusMinusButton_C::IsBottom' has a wrong offset!");

}

