#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_SidewaysEncounter_Grabber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prj_Athena_SidewaysEncounter_Grabber.Prj_Athena_SidewaysEncounter_Grabber_C.ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber
// 0x0150 (0x0150 - 0x0000)
struct Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsPlayers_ReturnValue;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SidewaysEncounter_Grabber_C* K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Grabber; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber) == 0x000008, "Wrong alignment on Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber");
static_assert(sizeof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber) == 0x000150, "Wrong size on Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, EntryPoint) == 0x000000, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_MyComp) == 0x000008, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_Other) == 0x000010, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_OtherComp) == 0x000018, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_bSelfMoved) == 0x000020, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_HitLocation) == 0x000024, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_HitNormal) == 0x000030, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_NormalImpulse) == 0x00003C, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_Event_Hit) == 0x000048, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000D0, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x0000D8, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_ContainsPlayers_ReturnValue) == 0x0000E9, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_ContainsPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000F0, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_IsInVehicle_ReturnValue) == 0x0000F9, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_GetOwner_ReturnValue) == 0x000100, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Grabber) == 0x000108, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_AsBGA_Athena_Sideways_Encounter_Grabber' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, Temp_bool_IsClosed_Variable) == 0x000111, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000118, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000128, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, Temp_bool_Has_Been_Initd_Variable) == 0x000129, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00012C, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_RandomFloat_ReturnValue) == 0x000138, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_VLerp_ReturnValue) == 0x00013C, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000148, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ExecuteUbergraph_Prj_Athena_SidewaysEncounter_Grabber::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");

// Function Prj_Athena_SidewaysEncounter_Grabber.Prj_Athena_SidewaysEncounter_Grabber_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit");
static_assert(sizeof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit) == 0x0000C8, "Wrong size on Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit, Hit) == 0x000040, "Member 'Prj_Athena_SidewaysEncounter_Grabber_C_ReceiveHit::Hit' has a wrong offset!");

}

