#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveItemScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.ExecuteUbergraph_ProgressiveItemScreen
// 0x0058 (0x0058 - 0x0000)
struct ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoloButton_C*                          K2Node_DynamicCast_AsSolo_Button;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTextButton*                        K2Node_Event_NewPipButton;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RowDisplayName;                       // 0x0030(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen");
static_assert(sizeof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen) == 0x000058, "Wrong size on ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, EntryPoint) == 0x000000, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_byte_Variable) == 0x000004, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_byte_Variable_1) == 0x000010, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_AsSolo_Button) == 0x000018, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_AsSolo_Button' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, Temp_bool_Variable) == 0x000021, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_NewPipButton) == 0x000028, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_NewPipButton' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Event_RowDisplayName) == 0x000030, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Event_RowDisplayName' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_TextIsEmpty_ReturnValue) == 0x000048, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, K2Node_Select_Default) == 0x000049, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'ProgressiveItemScreen_C_ExecuteUbergraph_ProgressiveItemScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.OnPreviewActionButtonUpdated
// 0x0018 (0x0018 - 0x0000)
struct ProgressiveItemScreen_C_OnPreviewActionButtonUpdated final
{
public:
	class FText                                   RowDisplayName;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_OnPreviewActionButtonUpdated");
static_assert(sizeof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated) == 0x000018, "Wrong size on ProgressiveItemScreen_C_OnPreviewActionButtonUpdated");
static_assert(offsetof(ProgressiveItemScreen_C_OnPreviewActionButtonUpdated, RowDisplayName) == 0x000000, "Member 'ProgressiveItemScreen_C_OnPreviewActionButtonUpdated::RowDisplayName' has a wrong offset!");

// Function ProgressiveItemScreen.ProgressiveItemScreen_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct ProgressiveItemScreen_C_CustomEvent final
{
public:
	class UFortTextButton*                        NewPipButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressiveItemScreen_C_CustomEvent) == 0x000008, "Wrong alignment on ProgressiveItemScreen_C_CustomEvent");
static_assert(sizeof(ProgressiveItemScreen_C_CustomEvent) == 0x000008, "Wrong size on ProgressiveItemScreen_C_CustomEvent");
static_assert(offsetof(ProgressiveItemScreen_C_CustomEvent, NewPipButton) == 0x000000, "Member 'ProgressiveItemScreen_C_CustomEvent::NewPipButton' has a wrong offset!");

}

