#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_SidewaysGeo_Rock_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prop_SidewaysGeo_Rock_Parent.Prop_SidewaysGeo_Rock_Parent_C.ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent
// 0x0050 (0x0050 - 0x0000)
struct Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_CoreLocation_1;                 // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_CoreLocation;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent) == 0x000008, "Wrong alignment on Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent");
static_assert(sizeof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent) == 0x000050, "Wrong size on Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, EntryPoint) == 0x000000, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, K2Node_CustomEvent_CoreLocation_1) == 0x000014, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::K2Node_CustomEvent_CoreLocation_1' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, K2Node_CustomEvent_CoreLocation) == 0x000020, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::K2Node_CustomEvent_CoreLocation' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00002C, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x00003C, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent, CallFunc_GetMaterial_ReturnValue) == 0x000048, "Member 'Prop_SidewaysGeo_Rock_Parent_C_ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");

// Function Prop_SidewaysGeo_Rock_Parent.Prop_SidewaysGeo_Rock_Parent_C.SidewaysFadeOut
// 0x000C (0x000C - 0x0000)
struct Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut final
{
public:
	struct FVector                                CoreLocation;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut) == 0x000004, "Wrong alignment on Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut");
static_assert(sizeof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut) == 0x00000C, "Wrong size on Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut, CoreLocation) == 0x000000, "Member 'Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeOut::CoreLocation' has a wrong offset!");

// Function Prop_SidewaysGeo_Rock_Parent.Prop_SidewaysGeo_Rock_Parent_C.SidewaysFadeBegin
// 0x000C (0x000C - 0x0000)
struct Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin final
{
public:
	struct FVector                                CoreLocation;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin) == 0x000004, "Wrong alignment on Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin");
static_assert(sizeof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin) == 0x00000C, "Wrong size on Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin");
static_assert(offsetof(Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin, CoreLocation) == 0x000000, "Member 'Prop_SidewaysGeo_Rock_Parent_C_SidewaysFadeBegin::CoreLocation' has a wrong offset!");

}

