#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_SidewaysGeo_Rock_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_SidewaysGeo_Rock_Parent.Prop_SidewaysGeo_Rock_Parent_C
// 0x0048 (0x0D88 - 0x0D40)
class AProp_SidewaysGeo_Rock_Parent_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Pillar_Remove_Sound;                               // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Pillar_Spawn_Sound;                                // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DynamicSpawn;                                      // 0x0D60(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D61[0x7];                                      // 0x0D61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CoreReference;                                     // 0x0D68(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          FadedIn;                                           // 0x0D70(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D71[0x3];                                      // 0x0D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayForFadingOut;                                 // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      FadeMaterial;                                      // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     StaticMaterial;                                    // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prop_SidewaysGeo_Rock_Parent(int32 EntryPoint);
	void DestroyDynamicPillar();
	void SidewaysFadeOut(const struct FVector& CoreLocation);
	void SidewaysFadeBegin(const struct FVector& CoreLocation);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_SidewaysGeo_Rock_Parent_C">();
	}
	static class AProp_SidewaysGeo_Rock_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_SidewaysGeo_Rock_Parent_C>();
	}
};
static_assert(alignof(AProp_SidewaysGeo_Rock_Parent_C) == 0x000008, "Wrong alignment on AProp_SidewaysGeo_Rock_Parent_C");
static_assert(sizeof(AProp_SidewaysGeo_Rock_Parent_C) == 0x000D88, "Wrong size on AProp_SidewaysGeo_Rock_Parent_C");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, UberGraphFrame) == 0x000D40, "Member 'AProp_SidewaysGeo_Rock_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, Pillar_Remove_Sound) == 0x000D48, "Member 'AProp_SidewaysGeo_Rock_Parent_C::Pillar_Remove_Sound' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, Pillar_Spawn_Sound) == 0x000D50, "Member 'AProp_SidewaysGeo_Rock_Parent_C::Pillar_Spawn_Sound' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, Mid) == 0x000D58, "Member 'AProp_SidewaysGeo_Rock_Parent_C::Mid' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, DynamicSpawn) == 0x000D60, "Member 'AProp_SidewaysGeo_Rock_Parent_C::DynamicSpawn' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, CoreReference) == 0x000D68, "Member 'AProp_SidewaysGeo_Rock_Parent_C::CoreReference' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, FadedIn) == 0x000D70, "Member 'AProp_SidewaysGeo_Rock_Parent_C::FadedIn' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, DelayForFadingOut) == 0x000D74, "Member 'AProp_SidewaysGeo_Rock_Parent_C::DelayForFadingOut' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, FadeMaterial) == 0x000D78, "Member 'AProp_SidewaysGeo_Rock_Parent_C::FadeMaterial' has a wrong offset!");
static_assert(offsetof(AProp_SidewaysGeo_Rock_Parent_C, StaticMaterial) == 0x000D80, "Member 'AProp_SidewaysGeo_Rock_Parent_C::StaticMaterial' has a wrong offset!");

}

