#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityLevelSelectTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualityLevelSelectTimer.QualityLevelSelectTimer_C
// 0x0010 (0x02E0 - 0x02D0)
class UQualityLevelSelectTimer_C final : public UFortHUDQualityLevelSelectTimer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TextScaleUnderOneSecond;                           // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextScaleOverOneSecond;                            // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnProgressStarted(const float Duration);
	void OnProgressEnded();
	void UpdateTextScale(float TimeRemaining);
	void OnTimeRemainingChanged(const float TimeRemaining);
	void OnInitialized();
	void ExecuteUbergraph_QualityLevelSelectTimer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualityLevelSelectTimer_C">();
	}
	static class UQualityLevelSelectTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityLevelSelectTimer_C>();
	}
};
static_assert(alignof(UQualityLevelSelectTimer_C) == 0x000008, "Wrong alignment on UQualityLevelSelectTimer_C");
static_assert(sizeof(UQualityLevelSelectTimer_C) == 0x0002E0, "Wrong size on UQualityLevelSelectTimer_C");
static_assert(offsetof(UQualityLevelSelectTimer_C, UberGraphFrame) == 0x0002D0, "Member 'UQualityLevelSelectTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectTimer_C, TextScaleUnderOneSecond) == 0x0002D8, "Member 'UQualityLevelSelectTimer_C::TextScaleUnderOneSecond' has a wrong offset!");
static_assert(offsetof(UQualityLevelSelectTimer_C, TextScaleOverOneSecond) == 0x0002DC, "Member 'UQualityLevelSelectTimer_C::TextScaleOverOneSecond' has a wrong offset!");

}

