#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RejoinWindow

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RejoinWindow.RejoinWindow_C
// 0x0038 (0x0530 - 0x04F8)
class URejoinWindow_C final : public UFortRejoinWindowBase
{
public:
	class UCommonTextBlock*                       AutorejoinText;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonBox;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRequestAbandon;                                  // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRequestRejoinRetry;                              // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RejoinWindow_C">();
	}
	static class URejoinWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URejoinWindow_C>();
	}
};
static_assert(alignof(URejoinWindow_C) == 0x000008, "Wrong alignment on URejoinWindow_C");
static_assert(sizeof(URejoinWindow_C) == 0x000530, "Wrong size on URejoinWindow_C");
static_assert(offsetof(URejoinWindow_C, AutorejoinText) == 0x0004F8, "Member 'URejoinWindow_C::AutorejoinText' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, ButtonBox) == 0x000500, "Member 'URejoinWindow_C::ButtonBox' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, Title) == 0x000508, "Member 'URejoinWindow_C::Title' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, OnRequestAbandon) == 0x000510, "Member 'URejoinWindow_C::OnRequestAbandon' has a wrong offset!");
static_assert(offsetof(URejoinWindow_C, OnRequestRejoinRetry) == 0x000520, "Member 'URejoinWindow_C::OnRequestRejoinRetry' has a wrong offset!");

}

