#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Semi_Truck_Veh_AnimBP_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base
// 0x0068 (0x0068 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTireMod_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMiddleAxleForwardAdjust_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetMaxHealth_self_CastInput;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetHealth_self_CastInput;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base) == 0x000008, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base) == 0x000068, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, EntryPoint) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x000014, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000020, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_HasTireMod_ReturnValue) == 0x000029, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_HasTireMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMiddleAxleForwardAdjust_ReturnValue) == 0x00002C, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMiddleAxleForwardAdjust_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMaxHealth_self_CastInput) == 0x000030, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMaxHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMaxHealth_ReturnValue) == 0x000040, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetHealth_self_CastInput) == 0x000048, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetHealth_ReturnValue) == 0x000058, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000061, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000062, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph) == 0x000008, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_AnimGraph");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph) == 0x000010, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_AnimGraph");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

