#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Semi_Truck_Veh_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C
// 0x3180 (0x35D0 - 0x0450)
class USemi_Truck_Veh_AnimBP_Base_C final : public UFortGoatVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0458(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x0478(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0580(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x0688(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x0790(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0898(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x09A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0AA8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0BB0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0CB8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0DC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0EC8(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0FD0(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1000(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1020(0x0018)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1038(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1140(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1248(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x1350(0x0790)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1AE0(0x0790)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x2270(0x0790)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2A00(0x0790)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x3190(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3298(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x33A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x34A8(0x0108)()
	float                                         triggerLadder;                                     // 0x35B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorL;                                    // 0x35B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorR;                                    // 0x35B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MiddleAxleAdjust;                                  // 0x35BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTireMod;                                        // 0x35C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base_AnimGraphNode_ModifyBone_7B814FBA4BE584CC554BBCBC712BA9A9();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Semi_Truck_Veh_AnimBP_Base_C">();
	}
	static class USemi_Truck_Veh_AnimBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USemi_Truck_Veh_AnimBP_Base_C>();
	}
};
static_assert(alignof(USemi_Truck_Veh_AnimBP_Base_C) == 0x000010, "Wrong alignment on USemi_Truck_Veh_AnimBP_Base_C");
static_assert(sizeof(USemi_Truck_Veh_AnimBP_Base_C) == 0x0035D0, "Wrong size on USemi_Truck_Veh_AnimBP_Base_C");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, UberGraphFrame) == 0x000450, "Member 'USemi_Truck_Veh_AnimBP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ComponentToLocalSpace) == 0x000458, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_17) == 0x000478, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_16) == 0x000580, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_15) == 0x000688, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_14) == 0x000790, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_13) == 0x000898, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_12) == 0x0009A0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_11) == 0x000AA8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_10) == 0x000BB0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_9) == 0x000CB8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_8) == 0x000DC0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_7) == 0x000EC8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_Root) == 0x000FD0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_LocalToComponentSpace) == 0x001000, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_LocalRefPose) == 0x001020, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_6) == 0x001038, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_5) == 0x001140, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_4) == 0x001248, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_3) == 0x001350, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_2) == 0x001AE0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_1) == 0x002270, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody) == 0x002A00, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_3) == 0x003190, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_2) == 0x003298, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_1) == 0x0033A0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone) == 0x0034A8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, triggerLadder) == 0x0035B0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::triggerLadder' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, TriggerMirrorL) == 0x0035B4, "Member 'USemi_Truck_Veh_AnimBP_Base_C::TriggerMirrorL' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, TriggerMirrorR) == 0x0035B8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::TriggerMirrorR' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, MiddleAxleAdjust) == 0x0035BC, "Member 'USemi_Truck_Veh_AnimBP_Base_C::MiddleAxleAdjust' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, HasTireMod) == 0x0035C0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::HasTireMod' has a wrong offset!");

}

