#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkewButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkewButton.SkewButton_C
// 0x0068 (0x0C88 - 0x0C20)
class USkewButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Released;                                          // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageButtonFill;                                   // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageShadow;                                       // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_ButtonContent;                           // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SkewBrushes;                               // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ButtonColor;                                       // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Chip;                                              // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Skew;                                              // 0x0C81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoHoverColor;                                      // 0x0C82(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Construct();
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	void BP_OnClicked();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void ExecuteUbergraph_SkewButton(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkewButton_C">();
	}
	static class USkewButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkewButton_C>();
	}
};
static_assert(alignof(USkewButton_C) == 0x000008, "Wrong alignment on USkewButton_C");
static_assert(sizeof(USkewButton_C) == 0x000C88, "Wrong size on USkewButton_C");
static_assert(offsetof(USkewButton_C, UberGraphFrame) == 0x000C20, "Member 'USkewButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Released) == 0x000C28, "Member 'USkewButton_C::Released' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Pressed) == 0x000C30, "Member 'USkewButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Hover) == 0x000C38, "Member 'USkewButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ImageButtonFill) == 0x000C40, "Member 'USkewButton_C::ImageButtonFill' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ImageShadow) == 0x000C48, "Member 'USkewButton_C::ImageShadow' has a wrong offset!");
static_assert(offsetof(USkewButton_C, NamedSlot_ButtonContent) == 0x000C50, "Member 'USkewButton_C::NamedSlot_ButtonContent' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Overlay_SkewBrushes) == 0x000C58, "Member 'USkewButton_C::Overlay_SkewBrushes' has a wrong offset!");
static_assert(offsetof(USkewButton_C, ButtonColor) == 0x000C60, "Member 'USkewButton_C::ButtonColor' has a wrong offset!");
static_assert(offsetof(USkewButton_C, HoverColor) == 0x000C70, "Member 'USkewButton_C::HoverColor' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Chip) == 0x000C80, "Member 'USkewButton_C::Chip' has a wrong offset!");
static_assert(offsetof(USkewButton_C, Skew) == 0x000C81, "Member 'USkewButton_C::Skew' has a wrong offset!");
static_assert(offsetof(USkewButton_C, NoHoverColor) == 0x000C82, "Member 'USkewButton_C::NoHoverColor' has a wrong offset!");

}

