#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmallSidewaysPlayspaceEncounterComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Struct_Athena_SidewaysEncounter_StageData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_Athena_SidewaysEncounter_State_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Enum_Athena_SidewaysEncounter_State_structs.hpp"
#include "Struct_Athena_SidewaysEncounter_EQS_Data_structs.hpp"
#include "BaseSidewaysPlayspaceEncounterComponent_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SmallSidewaysPlayspaceEncounterComponent.SmallSidewaysPlayspaceEncounterComponent_C
// 0x06A0 (0x07F8 - 0x0158)
class USmallSidewaysPlayspaceEncounterComponent_C final : public UBaseSidewaysPlayspaceEncounterComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTimelineComponent*                     BubbleScale;                                       // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPawn*>                      SpawnedPawns;                                      // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AFortAthenaLivingWorldVolume*           CurrentLivingWorldEncounterPointProviderVolume;    // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          EncounterVolumeEnabled;                            // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EncounterTimerEnabled;                             // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EncounterStageActive;                              // 0x0182(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterTotalScoreSpawned;                        // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterTotalScoreTarget;                         // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterTotalScoreEliminated;                     // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterStageScoreSpawned;                        // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterStageScoreTarget;                         // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterStageScoreEliminated;                     // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverkillEnabled;                                   // 0x019C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterStageOverkillPoints;                      // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EncounterTotalOverkillPoints;                      // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverkillThresholdL;                                // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverkillThresholdM;                                // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverkillThresholdS;                                // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEncounterWaveDurationMax;                   // 0x01B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentEncounterWaveDurationMin;                   // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentEncounterLootTier;                          // 0x01BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EncounterNoSpawnTimeoutFailure;                    // 0x01C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EncounterCleanupTimeoutFailure;                    // 0x01C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FinalWaveBeaten;                                   // 0x01C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AutoKillInProgress;                                // 0x01C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	Enum_Athena_SidewaysEncounter_State           HighestCombatState;                                // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaLivingWorldEncounterInstance* LWMEncounterInstance;                              // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<Enum_Athena_SidewaysEncounter_State, struct FStruct_Athena_SidewaysEncounter_State> MAP_EncounterStateSettings;                        // 0x01E0(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMap<float, struct FStruct_Athena_SidewaysEncounter_EQS_Data> EncounterEQSDistanceData;                          // 0x0230(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      OverkillLootTiers_Solo;                            // 0x0280(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      OverkillLootTiers_Duo;                             // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      OverkillLootTiers_Trio;                            // 0x0320(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FName>                      OverkillLootTiers_Squad;                           // 0x0370(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EncounterNoSpawnTimeoutDuration_HF;                // 0x03C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EncounterLastStageCleanupTimeoutDuration_HF;       // 0x03E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EncounterStageWarningCountdownDuration_HF;         // 0x0410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EncounterStageWarningCountdownPulseTime_HF;        // 0x0438(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NPC_SmallBag_Score_HF;                             // 0x0460(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NPC_IO_Score_HF;                                   // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NPC_Misc_Score_HF;                                 // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Solo;                         // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Duo;                          // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Trio;                         // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> DeimosEncounterTypes_Squad;                        // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> DeimosEncounterForcedTest;                         // 0x0518(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          SpawnEnvironmentActors;                            // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DebugEncounterObject;                              // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_Athena_SidewaysEncounter_StageData> EncounterStageData_Solo;                           // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStruct_Athena_SidewaysEncounter_StageData> EncounterStageData_Duo;                            // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStruct_Athena_SidewaysEncounter_StageData> EncounterStageData_Trio;                           // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStruct_Athena_SidewaysEncounter_StageData> EncounterStageData_Squad;                          // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         RadiusScaleMult;                                   // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BubbleCurrentScale;                                // 0x058C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BubbleStartScale;                                  // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BubbleEndScale;                                    // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Success;                                  // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Overkill;                                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MaxIdleLife;                                   // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_EncounterInactiveDespawn;                    // 0x05D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DoesEncounterEverDespawn;                          // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnvironmentalsZOffset;                             // 0x05E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         EnvironmentalActorsToSpawn;                        // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABuildingActor*>                 SpawnedEnvironmentalActors;                        // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FVector>                        EnvironmentalActorLocations;                       // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class ACBGA_SpookyMist_C>         EncounterSpookyMist;                               // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FScalableFloat                         SpookyMistCount;                                   // 0x0620(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        SpookyMistLocations;                               // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class ABuildingActor>             SpookyMist;                                        // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEnvQuery*                              EQS_SpookyMist;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Spawn;                                          // 0x0668(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Despawn;                                        // 0x0670(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destruction_Failed;                             // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destruction_Success;                            // 0x0680(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Closing_Failed;                                 // 0x0688(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Closing_Success;                                // 0x0690(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Overkill_First;                                 // 0x0698(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Overkill_Normal;                                // 0x06A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Elimimination_Positive;                         // 0x06A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Elimination_Neutral;                            // 0x06B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MusicOverkill;                                     // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MusicLoss;                                         // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MusicCountdown;                                    // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EncounterStageVolume;                              // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_OutOfSafeZoneDespawn;                        // 0x06D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_OutOfSafeZoneFrequencyCheck;                   // 0x06E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UObject>                    PillarParentClass;                                 // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FScalableFloat                         Row_PillarScaleMin;                                // 0x0710(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_PillarScaleMax;                                // 0x0738(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PlayersMustCleanupEnemies;                         // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AutoKillEnemiesBeforeClosingBubble;                // 0x0761(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_762[0x2];                                      // 0x0762(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MapTrackerColor;                                   // 0x0764(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_Stage1_Quest;                                   // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_Stage2_Quest;                                   // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_Stage3_Quest;                                   // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_DropNoLoot;                                     // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         ScoreValue;                                        // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EncounterChestScale;                               // 0x079C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_SpawnAI;                                        // 0x07A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Class_0;                                           // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Stage3Success;                                  // 0x07B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MaxIdleLifeForPreDrop;                         // 0x07C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            Visited_Sideways;                                  // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CanSpawnEnemies;                                   // 0x07F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SmallSidewaysPlayspaceEncounterComponent(int32 EntryPoint);
	void CE_UpdateCoreFX_Stage3();
	void CE_UpdateCoreFX_Stage1();
	void CE_UpdateCoreFX_Stage2();
	void CheckInSafezoneTimer();
	void SpawnOverkillLoot();
	void TrackOverkillTotal();
	void EncounterTimerCountdown();
	void CloseEncounter();
	void ElimFeedback(class AFortPawn* EliminatedFortPawn);
	void StartEncounter();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void EncounterSoloC();
	void EncounterSoloB();
	void EncounterSoloA();
	void EncounterSoloE();
	void EncounterTimerMin();
	void ServerDespawnTriggered();
	void SetupEncounterDespawn();
	void DespawnCosmetics();
	void DestroyCosmetics();
	void SpawnInCosmetics();
	void SpawnGhostRocks(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void EQSSpawnGhostRocks();
