#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialInteraction.SocialInteraction_C
// 0x0058 (0x0CE8 - 0x0C90)
class USocialInteraction_C final : public USocialInteractionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0C98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EncourageEpicFriend;                               // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractionIcon;                                   // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0CB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0CC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AddFriendColor;                                    // 0x0CD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialInteraction(int32 EntryPoint);
	void Construct();
	void BP_OnHovered();
	void OnInteractionSet();
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialInteraction_C">();
	}
	static class USocialInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteraction_C>();
	}
};
static_assert(alignof(USocialInteraction_C) == 0x000008, "Wrong alignment on USocialInteraction_C");
static_assert(sizeof(USocialInteraction_C) == 0x000CE8, "Wrong size on USocialInteraction_C");
static_assert(offsetof(USocialInteraction_C, UberGraphFrame) == 0x000C90, "Member 'USocialInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, OnHover) == 0x000C98, "Member 'USocialInteraction_C::OnHover' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend) == 0x000CA0, "Member 'USocialInteraction_C::EncourageEpicFriend' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, InteractionIcon) == 0x000CA8, "Member 'USocialInteraction_C::InteractionIcon' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, MenuAnchor_Actions) == 0x000CB0, "Member 'USocialInteraction_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend_IdleColor) == 0x000CB8, "Member 'USocialInteraction_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, EncourageEpicFriend_HoveredColor) == 0x000CC8, "Member 'USocialInteraction_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USocialInteraction_C, AddFriendColor) == 0x000CD8, "Member 'USocialInteraction_C::AddFriendColor' has a wrong offset!");

}

