#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendLinkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_FriendLinkButton.SocialPanel_FriendLinkButton_C
// 0x0048 (0x0C70 - 0x0C28)
class USocialPanel_FriendLinkButton_C final : public UFortSocialPanelView_FriendLinkButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnCopied;                                          // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_CopyState;                                // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CopyConfirmed;                                // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FriendLinkInstructions;                       // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LinkPrompt;                                   // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialPanel_FriendLinkButton(int32 EntryPoint);
	void OnShareButtonTypeSet(EFriendLinkShareButtonType Type);
	void Construct();
	void BP_OnHovered();
	void OnCopiedToClipboard();
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_FriendLinkButton_C">();
	}
	static class USocialPanel_FriendLinkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_FriendLinkButton_C>();
	}
};
static_assert(alignof(USocialPanel_FriendLinkButton_C) == 0x000008, "Wrong alignment on USocialPanel_FriendLinkButton_C");
static_assert(sizeof(USocialPanel_FriendLinkButton_C) == 0x000C70, "Wrong size on USocialPanel_FriendLinkButton_C");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, UberGraphFrame) == 0x000C28, "Member 'USocialPanel_FriendLinkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnCopied) == 0x000C30, "Member 'USocialPanel_FriendLinkButton_C::OnCopied' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, OnHovered) == 0x000C38, "Member 'USocialPanel_FriendLinkButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, MenuAnchor_Actions) == 0x000C40, "Member 'USocialPanel_FriendLinkButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, SharingIcon) == 0x000C48, "Member 'USocialPanel_FriendLinkButton_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Switcher_CopyState) == 0x000C50, "Member 'USocialPanel_FriendLinkButton_C::Switcher_CopyState' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_CopyConfirmed) == 0x000C58, "Member 'USocialPanel_FriendLinkButton_C::Text_CopyConfirmed' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_FriendLinkInstructions) == 0x000C60, "Member 'USocialPanel_FriendLinkButton_C::Text_FriendLinkInstructions' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendLinkButton_C, Text_LinkPrompt) == 0x000C68, "Member 'USocialPanel_FriendLinkButton_C::Text_LinkPrompt' has a wrong offset!");

}

