#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_FriendSearchBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_FriendSearchBar.SocialPanel_FriendSearchBar_C
// 0x0050 (0x0D08 - 0x0CB8)
class USocialPanel_FriendSearchBar_C final : public UFortFriendSearchButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0CC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AddFriendBanIcon;                                  // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ClickCapture;                                      // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CannotAddFriends;                         // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_SocialBan;                                // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x0CE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleWidgetAnimationsPanel;                       // 0x0CF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ShakeAnimation;                                    // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShakeAnimationIsPlaying;                          // 0x0D00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SocialPanel_FriendSearchBar(int32 EntryPoint);
	void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BP_OnUnhovered();
	void BP_OnHovered();
	struct FEventReply On_ClickCapture_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_FriendSearchBar_C">();
	}
	static class USocialPanel_FriendSearchBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_FriendSearchBar_C>();
	}
};
static_assert(alignof(USocialPanel_FriendSearchBar_C) == 0x000008, "Wrong alignment on USocialPanel_FriendSearchBar_C");
static_assert(sizeof(USocialPanel_FriendSearchBar_C) == 0x000D08, "Wrong size on USocialPanel_FriendSearchBar_C");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, UberGraphFrame) == 0x000CB8, "Member 'USocialPanel_FriendSearchBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, OnHovered) == 0x000CC0, "Member 'USocialPanel_FriendSearchBar_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, AddFriendBanIcon) == 0x000CC8, "Member 'USocialPanel_FriendSearchBar_C::AddFriendBanIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, ClickCapture) == 0x000CD0, "Member 'USocialPanel_FriendSearchBar_C::ClickCapture' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, RichText_CannotAddFriends) == 0x000CD8, "Member 'USocialPanel_FriendSearchBar_C::RichText_CannotAddFriends' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, RichText_SocialBan) == 0x000CE0, "Member 'USocialPanel_FriendSearchBar_C::RichText_SocialBan' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, SharingIcon) == 0x000CE8, "Member 'USocialPanel_FriendSearchBar_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, SimpleWidgetAnimationsPanel) == 0x000CF0, "Member 'USocialPanel_FriendSearchBar_C::SimpleWidgetAnimationsPanel' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, ShakeAnimation) == 0x000CF8, "Member 'USocialPanel_FriendSearchBar_C::ShakeAnimation' has a wrong offset!");
static_assert(offsetof(USocialPanel_FriendSearchBar_C, bShakeAnimationIsPlaying) == 0x000D00, "Member 'USocialPanel_FriendSearchBar_C::bShakeAnimationIsPlaying' has a wrong offset!");

}

