#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialButton.SocialButton_C
// 0x0070 (0x0CB0 - 0x0C40)
class USocialButton_C final : public UFortSocialButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Indentifier_Outro;                                 // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Indentifier_Intro;                                 // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerBanner*                      Banner_MemberBanner;                               // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Image_FriendIcon;                                  // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeaderIcon;                                  // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NumFriendsColor;                                   // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIdentifier_Bkg;                              // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialButton(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialButton_C">();
	}
	static class USocialButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialButton_C>();
	}
};
static_assert(alignof(USocialButton_C) == 0x000008, "Wrong alignment on USocialButton_C");
static_assert(sizeof(USocialButton_C) == 0x000CB0, "Wrong size on USocialButton_C");
static_assert(offsetof(USocialButton_C, UberGraphFrame) == 0x000C40, "Member 'USocialButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Outro) == 0x000C48, "Member 'USocialButton_C::Indentifier_Outro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Indentifier_Intro) == 0x000C50, "Member 'USocialButton_C::Indentifier_Intro' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Grow) == 0x000C58, "Member 'USocialButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover_Bounce) == 0x000C60, "Member 'USocialButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Hover) == 0x000C68, "Member 'USocialButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Banner_MemberBanner) == 0x000C70, "Member 'USocialButton_C::Banner_MemberBanner' has a wrong offset!");
static_assert(offsetof(USocialButton_C, ButtonBacking) == 0x000C78, "Member 'USocialButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USocialButton_C, IconColor) == 0x000C80, "Member 'USocialButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_FriendIcon) == 0x000C88, "Member 'USocialButton_C::Image_FriendIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, Image_LeaderIcon) == 0x000C90, "Member 'USocialButton_C::Image_LeaderIcon' has a wrong offset!");
static_assert(offsetof(USocialButton_C, NumFriendsColor) == 0x000C98, "Member 'USocialButton_C::NumFriendsColor' has a wrong offset!");
static_assert(offsetof(USocialButton_C, PlayerIdentifier_Bkg) == 0x000CA0, "Member 'USocialButton_C::PlayerIdentifier_Bkg' has a wrong offset!");
static_assert(offsetof(USocialButton_C, VariableSize) == 0x000CA8, "Member 'USocialButton_C::VariableSize' has a wrong offset!");

}

