#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialConfirmationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialConfirmationButton.SocialConfirmationButton_C
// 0x0050 (0x0C70 - 0x0C20)
class USocialConfirmationButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InteractionIcon;                                   // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsAccept;                                         // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayText;                                       // 0x0C58(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_SocialConfirmationButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialConfirmationButton_C">();
	}
	static class USocialConfirmationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialConfirmationButton_C>();
	}
};
static_assert(alignof(USocialConfirmationButton_C) == 0x000008, "Wrong alignment on USocialConfirmationButton_C");
static_assert(sizeof(USocialConfirmationButton_C) == 0x000C70, "Wrong size on USocialConfirmationButton_C");
static_assert(offsetof(USocialConfirmationButton_C, UberGraphFrame) == 0x000C20, "Member 'USocialConfirmationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, OnHover) == 0x000C28, "Member 'USocialConfirmationButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, Border_InteractionIndicator) == 0x000C30, "Member 'USocialConfirmationButton_C::Border_InteractionIndicator' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, InteractionIcon) == 0x000C38, "Member 'USocialConfirmationButton_C::InteractionIcon' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, MenuAnchor_Actions) == 0x000C40, "Member 'USocialConfirmationButton_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, Text_InteractionName) == 0x000C48, "Member 'USocialConfirmationButton_C::Text_InteractionName' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, bIsAccept) == 0x000C50, "Member 'USocialConfirmationButton_C::bIsAccept' has a wrong offset!");
static_assert(offsetof(USocialConfirmationButton_C, DisplayText) == 0x000C58, "Member 'USocialConfirmationButton_C::DisplayText' has a wrong offset!");

}

