#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_BattlePassPurchase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton_BattlePassPurchase.SoloButton_BattlePassPurchase_C
// 0x0078 (0x0C98 - 0x0C20)
class USoloButton_BattlePassPurchase_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0C60(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C79[0x3];                                      // 0x0C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x0C90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SoloButton_BattlePassPurchase(int32 EntryPoint);
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void HandleSize();
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_BattlePassPurchase_C">();
	}
	static class USoloButton_BattlePassPurchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_BattlePassPurchase_C>();
	}
};
static_assert(alignof(USoloButton_BattlePassPurchase_C) == 0x000008, "Wrong alignment on USoloButton_BattlePassPurchase_C");
static_assert(sizeof(USoloButton_BattlePassPurchase_C) == 0x000C98, "Wrong size on USoloButton_BattlePassPurchase_C");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, UberGraphFrame) == 0x000C20, "Member 'USoloButton_BattlePassPurchase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Pressed) == 0x000C28, "Member 'USoloButton_BattlePassPurchase_C::Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Hover) == 0x000C30, "Member 'USoloButton_BattlePassPurchase_C::Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Border_Container) == 0x000C38, "Member 'USoloButton_BattlePassPurchase_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, ButtonBacking) == 0x000C40, "Member 'USoloButton_BattlePassPurchase_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, ScaleBox_0) == 0x000C48, "Member 'USoloButton_BattlePassPurchase_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, SizeBox_Control) == 0x000C50, "Member 'USoloButton_BattlePassPurchase_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Text_ButtonAction) == 0x000C58, "Member 'USoloButton_BattlePassPurchase_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Button_Description) == 0x000C60, "Member 'USoloButton_BattlePassPurchase_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, FontSizeOveride) == 0x000C78, "Member 'USoloButton_BattlePassPurchase_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, FontSize) == 0x000C7C, "Member 'USoloButton_BattlePassPurchase_C::FontSize' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, Padding_Overide) == 0x000C80, "Member 'USoloButton_BattlePassPurchase_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(USoloButton_BattlePassPurchase_C, PaddingOveride) == 0x000C90, "Member 'USoloButton_BattlePassPurchase_C::PaddingOveride' has a wrong offset!");

}

