#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton.SoloButton_C
// 0x0070 (0x0C90 - 0x0C20)
class USoloButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Container;                                  // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x0C58(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x0C78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDisabled;                                        // 0x0C89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetText(const class FText& Text);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void HandleSize();
	void BP_OnClicked();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void ExecuteUbergraph_SoloButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_C">();
	}
	static class USoloButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_C>();
	}
};
static_assert(alignof(USoloButton_C) == 0x000008, "Wrong alignment on USoloButton_C");
static_assert(sizeof(USoloButton_C) == 0x000C90, "Wrong size on USoloButton_C");
static_assert(offsetof(USoloButton_C, UberGraphFrame) == 0x000C20, "Member 'USoloButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Pressed) == 0x000C28, "Member 'USoloButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Hover) == 0x000C30, "Member 'USoloButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Border_Container) == 0x000C38, "Member 'USoloButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(USoloButton_C, ButtonBacking) == 0x000C40, "Member 'USoloButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_C, SizeBox_Control) == 0x000C48, "Member 'USoloButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Text_ButtonAction) == 0x000C50, "Member 'USoloButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Button_Description) == 0x000C58, "Member 'USoloButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSizeOveride) == 0x000C70, "Member 'USoloButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, FontSize) == 0x000C74, "Member 'USoloButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(USoloButton_C, Padding_Overide) == 0x000C78, "Member 'USoloButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(USoloButton_C, PaddingOveride) == 0x000C88, "Member 'USoloButton_C::PaddingOveride' has a wrong offset!");
static_assert(offsetof(USoloButton_C, IsDisabled) == 0x000C89, "Member 'USoloButton_C::IsDisabled' has a wrong offset!");

}

