#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoloButton_ViewQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoloButton_ViewQuest.SoloButton_ViewQuest_C
// 0x0050 (0x0C78 - 0x0C28)
class USoloButton_ViewQuest_C final : public UFortAthenaViewQuestsButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ViewQuest_Hover;                                   // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse_Pressed;                             // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse_Hover;                               // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewQuestPulse;                                     // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NewQuestBorder;                              // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              InputActionIconScale;                              // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pulse;                                             // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ViewQuestText;                                     // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SoloButton_ViewQuest(int32 EntryPoint);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void Construct();
	void HandleUnseenQuestsChanged(bool bHasUnseenQuests);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void UpdateInputActionIconScale();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoloButton_ViewQuest_C">();
	}
	static class USoloButton_ViewQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoloButton_ViewQuest_C>();
	}
};
static_assert(alignof(USoloButton_ViewQuest_C) == 0x000008, "Wrong alignment on USoloButton_ViewQuest_C");
static_assert(sizeof(USoloButton_ViewQuest_C) == 0x000C78, "Wrong size on USoloButton_ViewQuest_C");
static_assert(offsetof(USoloButton_ViewQuest_C, UberGraphFrame) == 0x000C28, "Member 'USoloButton_ViewQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ViewQuest_Hover) == 0x000C30, "Member 'USoloButton_ViewQuest_C::ViewQuest_Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse_Pressed) == 0x000C38, "Member 'USoloButton_ViewQuest_C::NewQuestPulse_Pressed' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse_Hover) == 0x000C40, "Member 'USoloButton_ViewQuest_C::NewQuestPulse_Hover' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, NewQuestPulse) == 0x000C48, "Member 'USoloButton_ViewQuest_C::NewQuestPulse' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ButtonBacking) == 0x000C50, "Member 'USoloButton_ViewQuest_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, Image_NewQuestBorder) == 0x000C58, "Member 'USoloButton_ViewQuest_C::Image_NewQuestBorder' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, InputActionIconScale) == 0x000C60, "Member 'USoloButton_ViewQuest_C::InputActionIconScale' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, Pulse) == 0x000C68, "Member 'USoloButton_ViewQuest_C::Pulse' has a wrong offset!");
static_assert(offsetof(USoloButton_ViewQuest_C, ViewQuestText) == 0x000C70, "Member 'USoloButton_ViewQuest_C::ViewQuestText' has a wrong offset!");

}

