#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadMemberTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SquadMemberTile.SquadMemberTile_C
// 0x0078 (0x0D00 - 0x0C88)
class USquadMemberTile_C final : public UAthenaSquadMemberDetailedEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnIntro;                                           // 0x0C90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnLocalUserDefined;                                // 0x0C98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelected;                                        // 0x0CA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetRibbonRotation;                                 // 0x0CA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleEmpty;                                        // 0x0CB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleNotReady;                                     // 0x0CB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleReady;                                        // 0x0CC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StyleSitOut;                                       // 0x0CC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0CD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingThrobberBacking;                            // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LocalUserIcon;                                     // 0x0CE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadOverlay;                                      // 0x0CF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadRibbon;                                       // 0x0CF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SquadMemberTile(int32 EntryPoint);
	void OnMemberIsInFrontendChanged(bool bIsInFrontEnd);
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void BP_OnDeselected();
	void BP_OnSelected();
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnSquadAssigned();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnLoaded_A3B69DDA4214DBAA66546FAB9F43D5E7(class UObject* Loaded);
	void SetNotReadyVisuals();
	void SetReadyVisuals();
	void SetSitOutVisuals();
	void SetEmptyVisuals();
	void SetVisuals(EGameReadiness Member_Readiness, bool Is_In_Frontend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SquadMemberTile_C">();
	}
	static class USquadMemberTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadMemberTile_C>();
	}
};
static_assert(alignof(USquadMemberTile_C) == 0x000008, "Wrong alignment on USquadMemberTile_C");
static_assert(sizeof(USquadMemberTile_C) == 0x000D00, "Wrong size on USquadMemberTile_C");
static_assert(offsetof(USquadMemberTile_C, UberGraphFrame) == 0x000C88, "Member 'USquadMemberTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnIntro) == 0x000C90, "Member 'USquadMemberTile_C::OnIntro' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnLocalUserDefined) == 0x000C98, "Member 'USquadMemberTile_C::OnLocalUserDefined' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnSelected) == 0x000CA0, "Member 'USquadMemberTile_C::OnSelected' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SetRibbonRotation) == 0x000CA8, "Member 'USquadMemberTile_C::SetRibbonRotation' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleEmpty) == 0x000CB0, "Member 'USquadMemberTile_C::StyleEmpty' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleNotReady) == 0x000CB8, "Member 'USquadMemberTile_C::StyleNotReady' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleReady) == 0x000CC0, "Member 'USquadMemberTile_C::StyleReady' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, StyleSitOut) == 0x000CC8, "Member 'USquadMemberTile_C::StyleSitOut' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, OnHovered) == 0x000CD0, "Member 'USquadMemberTile_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, EntryBorder) == 0x000CD8, "Member 'USquadMemberTile_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, LoadingThrobberBacking) == 0x000CE0, "Member 'USquadMemberTile_C::LoadingThrobberBacking' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, LocalUserIcon) == 0x000CE8, "Member 'USquadMemberTile_C::LocalUserIcon' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SquadOverlay) == 0x000CF0, "Member 'USquadMemberTile_C::SquadOverlay' has a wrong offset!");
static_assert(offsetof(USquadMemberTile_C, SquadRibbon) == 0x000CF8, "Member 'USquadMemberTile_C::SquadRibbon' has a wrong offset!");

}

