#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Street_Light__2

#include "Basic.hpp"

#include "Parent_BuildingPropActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Street_Light__2.Street_Light__2_C
// 0x0018 (0x0E38 - 0x0E20)
class AStreet_Light__2_C final : public AParent_BuildingPropActor_C
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               coneintensity;                                     // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EmissiveMult;                                      // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Street_Light__2_C">();
	}
	static class AStreet_Light__2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStreet_Light__2_C>();
	}
};
static_assert(alignof(AStreet_Light__2_C) == 0x000008, "Wrong alignment on AStreet_Light__2_C");
static_assert(sizeof(AStreet_Light__2_C) == 0x000E38, "Wrong size on AStreet_Light__2_C");
static_assert(offsetof(AStreet_Light__2_C, SpotLight) == 0x000E20, "Member 'AStreet_Light__2_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AStreet_Light__2_C, coneintensity) == 0x000E28, "Member 'AStreet_Light__2_C::coneintensity' has a wrong offset!");
static_assert(offsetof(AStreet_Light__2_C, EmissiveMult) == 0x000E30, "Member 'AStreet_Light__2_C::EmissiveMult' has a wrong offset!");

}

