#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Athena_SidewaysEncounter_StageData

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Athena_SidewaysEncounter_StageData.Struct_Athena_SidewaysEncounter_StageData
// 0x0080 (0x0080 - 0x0000)
struct FStruct_Athena_SidewaysEncounter_StageData final
{
public:
	struct FScalableFloat                         EncounterWaveDurationMax_6_76AC01F54939EB0CC9EA559EED563281; // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         EncounterWaveDurationMin_7_66C813034B405960F300DBA5F8DE2F87; // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         EncounterPointEliminationTarget_8_E6A4E7EA4E52E911ED0182966B43EB19; // 0x0050(0x0028)(Edit, BlueprintVisible)
	class FName                                   EncounterLootTier_9_B27BF7F0481DB78EB5ED359395CCFA9B; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Athena_SidewaysEncounter_StageData) == 0x000008, "Wrong alignment on FStruct_Athena_SidewaysEncounter_StageData");
static_assert(sizeof(FStruct_Athena_SidewaysEncounter_StageData) == 0x000080, "Wrong size on FStruct_Athena_SidewaysEncounter_StageData");
static_assert(offsetof(FStruct_Athena_SidewaysEncounter_StageData, EncounterWaveDurationMax_6_76AC01F54939EB0CC9EA559EED563281) == 0x000000, "Member 'FStruct_Athena_SidewaysEncounter_StageData::EncounterWaveDurationMax_6_76AC01F54939EB0CC9EA559EED563281' has a wrong offset!");
static_assert(offsetof(FStruct_Athena_SidewaysEncounter_StageData, EncounterWaveDurationMin_7_66C813034B405960F300DBA5F8DE2F87) == 0x000028, "Member 'FStruct_Athena_SidewaysEncounter_StageData::EncounterWaveDurationMin_7_66C813034B405960F300DBA5F8DE2F87' has a wrong offset!");
static_assert(offsetof(FStruct_Athena_SidewaysEncounter_StageData, EncounterPointEliminationTarget_8_E6A4E7EA4E52E911ED0182966B43EB19) == 0x000050, "Member 'FStruct_Athena_SidewaysEncounter_StageData::EncounterPointEliminationTarget_8_E6A4E7EA4E52E911ED0182966B43EB19' has a wrong offset!");
static_assert(offsetof(FStruct_Athena_SidewaysEncounter_StageData, EncounterLootTier_9_B27BF7F0481DB78EB5ED359395CCFA9B) == 0x000078, "Member 'FStruct_Athena_SidewaysEncounter_StageData::EncounterLootTier_9_B27BF7F0481DB78EB5ED359395CCFA9B' has a wrong offset!");

}

