#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate.TeamMemberPedestal_Nameplate_C
// 0x02D8 (0x0FC0 - 0x0CE8)
class UTeamMemberPedestal_Nameplate_C final : public UFortTeamMemberPedestalNameplate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NotReadyTextColor;                                 // 0x0CF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReadyTextColor;                                    // 0x0CF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Ready_Change_Text;                              // 0x0D00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x0D08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamMemberPedestal_ActivatableContainer_C* TeamMemberPedestal_ActivatableContainer;           // 0x0D10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Widget_PlayerLevel;                                // 0x0D18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0D20(0x0200)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x0F20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F21[0x3];                                      // 0x0F21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReadyColor;                                        // 0x0F24(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NotReadyColor;                                     // 0x0F34(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F44[0x4];                                      // 0x0F44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             UnReadySound;                                      // 0x0F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReadySound;                                        // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   AddFriendText;                                     // 0x0F58(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x0F70(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptFriendRequestText;                           // 0x0F88(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x0FA0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              FALSE_0;                                           // 0x0FB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               DefaultOldCameraValue;                             // 0x0FB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateInputActionVisibility();
	ESlateVisibility GetInputActionVisibility();
	void OnReadyStatusChanged(EGameReadiness GameReadiness);
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void Construct();
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void OnPlayReadyAudio(bool bIsReadyForMatchmaking);
	void OnCurrentSubGameChanged(ESubGame NewSubGame);
	void OnFriendStatusUpdated(const EFortFriendRequestStatus FriendRequestStatus);
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void Destruct();
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_C">();
	}
	static class UTeamMemberPedestal_Nameplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_C) == 0x000008, "Wrong alignment on UTeamMemberPedestal_Nameplate_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_C) == 0x000FC0, "Wrong size on UTeamMemberPedestal_Nameplate_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UberGraphFrame) == 0x000CE8, "Member 'UTeamMemberPedestal_Nameplate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyTextColor) == 0x000CF0, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyTextColor) == 0x000CF8, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyTextColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, On_Ready_Change_Text) == 0x000D00, "Member 'UTeamMemberPedestal_Nameplate_C::On_Ready_Change_Text' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SB_InputAction) == 0x000D08, "Member 'UTeamMemberPedestal_Nameplate_C::SB_InputAction' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberPedestal_ActivatableContainer) == 0x000D10, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberPedestal_ActivatableContainer' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, Widget_PlayerLevel) == 0x000D18, "Member 'UTeamMemberPedestal_Nameplate_C::Widget_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, TeamMemberInfo) == 0x000D20, "Member 'UTeamMemberPedestal_Nameplate_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, bHovered) == 0x000F20, "Member 'UTeamMemberPedestal_Nameplate_C::bHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadyColor) == 0x000F24, "Member 'UTeamMemberPedestal_Nameplate_C::ReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, NotReadyColor) == 0x000F34, "Member 'UTeamMemberPedestal_Nameplate_C::NotReadyColor' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, UnReadySound) == 0x000F48, "Member 'UTeamMemberPedestal_Nameplate_C::UnReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, ReadySound) == 0x000F50, "Member 'UTeamMemberPedestal_Nameplate_C::ReadySound' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AddFriendText) == 0x000F58, "Member 'UTeamMemberPedestal_Nameplate_C::AddFriendText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptedInviteText) == 0x000F70, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptedInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, AcceptFriendRequestText) == 0x000F88, "Member 'UTeamMemberPedestal_Nameplate_C::AcceptFriendRequestText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, SentInviteText) == 0x000FA0, "Member 'UTeamMemberPedestal_Nameplate_C::SentInviteText' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, FALSE_0) == 0x000FB8, "Member 'UTeamMemberPedestal_Nameplate_C::FALSE_0' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_C, DefaultOldCameraValue) == 0x000FB9, "Member 'UTeamMemberPedestal_Nameplate_C::DefaultOldCameraValue' has a wrong offset!");

}

