#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberBanner.TeamMemberBanner_C
// 0x0040 (0x0CA0 - 0x0C60)
class UTeamMemberBanner_C final : public UFortCampaignTeamMemberBanner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ButtonPartyFinder;                                 // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Connected;                                         // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Connecting;                                        // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_571;                                         // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Open;                                              // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpenImage;                                         // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_MemberState;                              // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TeamMemberBanner(int32 EntryPoint);
	void OnTeamMemberConnectionStateChanged(EFortMemberConnectionState NewConnectionState);
	void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonPartyFinder_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void HandleMouseHoverVisualState(bool Hover);
	void OpenPartyFinder();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberBanner_C">();
	}
	static class UTeamMemberBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberBanner_C>();
	}
};
static_assert(alignof(UTeamMemberBanner_C) == 0x000008, "Wrong alignment on UTeamMemberBanner_C");
static_assert(sizeof(UTeamMemberBanner_C) == 0x000CA0, "Wrong size on UTeamMemberBanner_C");
static_assert(offsetof(UTeamMemberBanner_C, UberGraphFrame) == 0x000C60, "Member 'UTeamMemberBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, ButtonPartyFinder) == 0x000C68, "Member 'UTeamMemberBanner_C::ButtonPartyFinder' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, Connected) == 0x000C70, "Member 'UTeamMemberBanner_C::Connected' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, Connecting) == 0x000C78, "Member 'UTeamMemberBanner_C::Connecting' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, Image_571) == 0x000C80, "Member 'UTeamMemberBanner_C::Image_571' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, Open) == 0x000C88, "Member 'UTeamMemberBanner_C::Open' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, OpenImage) == 0x000C90, "Member 'UTeamMemberBanner_C::OpenImage' has a wrong offset!");
static_assert(offsetof(UTeamMemberBanner_C, Switcher_MemberState) == 0x000C98, "Member 'UTeamMemberBanner_C::Switcher_MemberState' has a wrong offset!");

}

