#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate_AddFriendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate_AddFriendButton.TeamMemberPedestal_Nameplate_AddFriendButton_C
// 0x0048 (0x0C68 - 0x0C20)
class UTeamMemberPedestal_Nameplate_AddFriendButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnhovered;                                       // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayShine;                                         // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetButtonText(const class FText& InText);
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void SetInputActionVisibility(ESlateVisibility InVisibility);
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate_AddFriendButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_AddFriendButton_C">();
	}
	static class UTeamMemberPedestal_Nameplate_AddFriendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_AddFriendButton_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x000008, "Wrong alignment on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x000C68, "Wrong size on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, UberGraphFrame) == 0x000C20, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnUnhovered) == 0x000C28, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Reset) == 0x000C30, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Reset' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Disabled) == 0x000C38, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, PlayShine) == 0x000C40, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::PlayShine' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnHovered) == 0x000C48, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, CenterButtonTextWidget) == 0x000C50, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Image_ButtonTop) == 0x000C58, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, SB_InputAction) == 0x000C60, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::SB_InputAction' has a wrong offset!");

}

