#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserListEntry.UserListEntry_C
// 0x0058 (0x0CF0 - 0x0C98)
class UUserListEntry_C final : public UFortSocialUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0CA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0CA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0CD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0CE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UserListEntry(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void BP_OnHovered();
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserListEntry_C">();
	}
	static class UUserListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserListEntry_C>();
	}
};
static_assert(alignof(UUserListEntry_C) == 0x000008, "Wrong alignment on UUserListEntry_C");
static_assert(sizeof(UUserListEntry_C) == 0x000CF0, "Wrong size on UUserListEntry_C");
static_assert(offsetof(UUserListEntry_C, UberGraphFrame) == 0x000C98, "Member 'UUserListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, Selected) == 0x000CA0, "Member 'UUserListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, Hovered) == 0x000CA8, "Member 'UUserListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, Arrow) == 0x000CB0, "Member 'UUserListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x000CB8, "Member 'UUserListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, Text_DisplayName) == 0x000CC0, "Member 'UUserListEntry_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, UserActionMenuInputButton) == 0x000CC8, "Member 'UUserListEntry_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, EncourageEpicFriend_IdleColor) == 0x000CD0, "Member 'UUserListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UUserListEntry_C, EncourageEpicFriend_HoveredColor) == 0x000CE0, "Member 'UUserListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

