#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetMod_Tire_OffRoad_Foray

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function ValetMod_Tire_OffRoad_Foray.ValetMod_Tire_OffRoad_Foray_C.ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray
// 0x00F0 (0x00F0 - 0x0000)
struct ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0028(0x00C0)(ContainsInstancedReference)
	class AFortDagwoodVehicle*                    K2Node_Event_ModdedVehicle;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray) == 0x000008, "Wrong alignment on ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray");
static_assert(sizeof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray) == 0x0000F0, "Wrong size on ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, EntryPoint) == 0x000000, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::EntryPoint' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000018, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000028, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray, K2Node_Event_ModdedVehicle) == 0x0000E8, "Member 'ValetMod_Tire_OffRoad_Foray_C_ExecuteUbergraph_ValetMod_Tire_OffRoad_Foray::K2Node_Event_ModdedVehicle' has a wrong offset!");

// Function ValetMod_Tire_OffRoad_Foray.ValetMod_Tire_OffRoad_Foray_C.OnModAppliedClient
// 0x0008 (0x0008 - 0x0000)
struct ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient final
{
public:
	class AFortDagwoodVehicle*                    ModdedVehicle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient) == 0x000008, "Wrong alignment on ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient");
static_assert(sizeof(ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient) == 0x000008, "Wrong size on ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient");
static_assert(offsetof(ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient, ModdedVehicle) == 0x000000, "Member 'ValetMod_Tire_OffRoad_Foray_C_OnModAppliedClient::ModdedVehicle' has a wrong offset!");

}

