#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BigRig_Vehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Valet_BasicCar_Vehicle_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C
// 0x0090 (0x29C0 - 0x2930)
class AValet_BigRig_Vehicle_C final : public AValet_BasicCar_Vehicle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Valet_BigRig_Vehicle_C;             // 0x2930(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               SmokeLeft_FX;                                      // 0x2938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SmokeRight_FX;                                     // 0x2940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         HotfixScalePontoonTickRateFront_0;                 // 0x2948(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HotfixScalePontoonTickRateRear_0;                  // 0x2970(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MatIndex;                                          // 0x2998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299C[0x4];                                     // 0x299C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             SK_RandomMat0_Array_Occluded;                      // 0x29A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsLocalPlayerPassenger;                            // 0x29B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_29B1[0x7];                                     // 0x29B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PawnPassenger;                                     // 0x29B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Valet_BigRig_Vehicle(int32 EntryPoint);
	void OnPawnExitVehicle(class AFortPlayerPawn* PlayerPawn, class FName ExitSocketName);
	void OnPawnEnterVehicle(class AFortPlayerPawn* PlayerPawn, const int32 SeatIdx);
	void OnEnteredWaterBody(class AFortWaterBodyActor* WaterBody_0);
	void UserConstructionScript();
	void LocalPassengerMatSwap();
	void PassengerEnter(class AFortPlayerPawn* PlayerPawn);
	void PassengerExit(class AFortPawn* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Valet_BigRig_Vehicle_C">();
	}
	static class AValet_BigRig_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_BigRig_Vehicle_C>();
	}
};
static_assert(alignof(AValet_BigRig_Vehicle_C) == 0x000010, "Wrong alignment on AValet_BigRig_Vehicle_C");
static_assert(sizeof(AValet_BigRig_Vehicle_C) == 0x0029C0, "Wrong size on AValet_BigRig_Vehicle_C");
static_assert(offsetof(AValet_BigRig_Vehicle_C, UberGraphFrame_Valet_BigRig_Vehicle_C) == 0x002930, "Member 'AValet_BigRig_Vehicle_C::UberGraphFrame_Valet_BigRig_Vehicle_C' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SmokeLeft_FX) == 0x002938, "Member 'AValet_BigRig_Vehicle_C::SmokeLeft_FX' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SmokeRight_FX) == 0x002940, "Member 'AValet_BigRig_Vehicle_C::SmokeRight_FX' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, HotfixScalePontoonTickRateFront_0) == 0x002948, "Member 'AValet_BigRig_Vehicle_C::HotfixScalePontoonTickRateFront_0' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, HotfixScalePontoonTickRateRear_0) == 0x002970, "Member 'AValet_BigRig_Vehicle_C::HotfixScalePontoonTickRateRear_0' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, MatIndex) == 0x002998, "Member 'AValet_BigRig_Vehicle_C::MatIndex' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, SK_RandomMat0_Array_Occluded) == 0x0029A0, "Member 'AValet_BigRig_Vehicle_C::SK_RandomMat0_Array_Occluded' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, IsLocalPlayerPassenger) == 0x0029B0, "Member 'AValet_BigRig_Vehicle_C::IsLocalPlayerPassenger' has a wrong offset!");
static_assert(offsetof(AValet_BigRig_Vehicle_C, PawnPassenger) == 0x0029B8, "Member 'AValet_BigRig_Vehicle_C::PawnPassenger' has a wrong offset!");

}

