#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetModsRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function ValetModsRuntime.FortGameStateComponent_ValetMods.TryInitValetMods
// 0x0001 (0x0001 - 0x0000)
struct FortGameStateComponent_ValetMods_TryInitValetMods final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGameStateComponent_ValetMods_TryInitValetMods) == 0x000001, "Wrong alignment on FortGameStateComponent_ValetMods_TryInitValetMods");
static_assert(sizeof(FortGameStateComponent_ValetMods_TryInitValetMods) == 0x000001, "Wrong size on FortGameStateComponent_ValetMods_TryInitValetMods");
static_assert(offsetof(FortGameStateComponent_ValetMods_TryInitValetMods, ReturnValue) == 0x000000, "Member 'FortGameStateComponent_ValetMods_TryInitValetMods::ReturnValue' has a wrong offset!");

// Function ValetModsRuntime.FortValetModBase.OnModAppliedClient
// 0x0008 (0x0008 - 0x0000)
struct FortValetModBase_OnModAppliedClient final
{
public:
	class AFortDagwoodVehicle*                    ModdedVehicle;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortValetModBase_OnModAppliedClient) == 0x000008, "Wrong alignment on FortValetModBase_OnModAppliedClient");
static_assert(sizeof(FortValetModBase_OnModAppliedClient) == 0x000008, "Wrong size on FortValetModBase_OnModAppliedClient");
static_assert(offsetof(FortValetModBase_OnModAppliedClient, ModdedVehicle) == 0x000000, "Member 'FortValetModBase_OnModAppliedClient::ModdedVehicle' has a wrong offset!");

// Function ValetModsRuntime.FortValetModGarage.OnVehicleEnter
// 0x0008 (0x0008 - 0x0000)
struct FortValetModGarage_OnVehicleEnter final
{
public:
	class AFortDagwoodVehicle*                    NewVehicle;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortValetModGarage_OnVehicleEnter) == 0x000008, "Wrong alignment on FortValetModGarage_OnVehicleEnter");
static_assert(sizeof(FortValetModGarage_OnVehicleEnter) == 0x000008, "Wrong size on FortValetModGarage_OnVehicleEnter");
static_assert(offsetof(FortValetModGarage_OnVehicleEnter, NewVehicle) == 0x000000, "Member 'FortValetModGarage_OnVehicleEnter::NewVehicle' has a wrong offset!");

// Function ValetModsRuntime.FortValetModGarage.OnVehicleExit
// 0x0008 (0x0008 - 0x0000)
struct FortValetModGarage_OnVehicleExit final
{
public:
	class AFortDagwoodVehicle*                    ExitingVehicle;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortValetModGarage_OnVehicleExit) == 0x000008, "Wrong alignment on FortValetModGarage_OnVehicleExit");
static_assert(sizeof(FortValetModGarage_OnVehicleExit) == 0x000008, "Wrong size on FortValetModGarage_OnVehicleExit");
static_assert(offsetof(FortValetModGarage_OnVehicleExit, ExitingVehicle) == 0x000000, "Member 'FortValetModGarage_OnVehicleExit::ExitingVehicle' has a wrong offset!");

}

