#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "NetworkPrediction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ValetRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class ValetRuntime.DagwoodNetworkPhysicsComponent
// 0x0BB0 (0x0C60 - 0x00B0)
class UDagwoodNetworkPhysicsComponent final : public UActorComponent
{
public:
	struct FNetworkPhysicsState                   NetworkPhysicsState;                               // 0x00B0(0x0060)(Net, Transient, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGeneratedLocalInputCmd;                          // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDagwoodManagedState                   ReplicatedManagedState;                            // 0x0120(0x03C0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FDagwoodManagedState                   InManagedState;                                    // 0x04E0(0x03C0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FDagwoodManagedState                   OutManagedState;                                   // 0x08A0(0x03C0)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void SetPendingInputCmd(const struct FFortDagwoodCmd& In);
	void SetState_GT(const struct FDagwoodInPersistent& In);

	struct FFortDagwoodCmd GetPendingInputCmd() const;
	struct FDagwoodInPersistent GetState_GT() const;
	struct FDagwoodState_PT GetState_PT() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DagwoodNetworkPhysicsComponent">();
	}
	static class UDagwoodNetworkPhysicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDagwoodNetworkPhysicsComponent>();
	}
};
static_assert(alignof(UDagwoodNetworkPhysicsComponent) == 0x000010, "Wrong alignment on UDagwoodNetworkPhysicsComponent");
static_assert(sizeof(UDagwoodNetworkPhysicsComponent) == 0x000C60, "Wrong size on UDagwoodNetworkPhysicsComponent");
static_assert(offsetof(UDagwoodNetworkPhysicsComponent, NetworkPhysicsState) == 0x0000B0, "Member 'UDagwoodNetworkPhysicsComponent::NetworkPhysicsState' has a wrong offset!");
static_assert(offsetof(UDagwoodNetworkPhysicsComponent, OnGeneratedLocalInputCmd) == 0x000110, "Member 'UDagwoodNetworkPhysicsComponent::OnGeneratedLocalInputCmd' has a wrong offset!");
static_assert(offsetof(UDagwoodNetworkPhysicsComponent, ReplicatedManagedState) == 0x000120, "Member 'UDagwoodNetworkPhysicsComponent::ReplicatedManagedState' has a wrong offset!");
static_assert(offsetof(UDagwoodNetworkPhysicsComponent, InManagedState) == 0x0004E0, "Member 'UDagwoodNetworkPhysicsComponent::InManagedState' has a wrong offset!");
static_assert(offsetof(UDagwoodNetworkPhysicsComponent, OutManagedState) == 0x0008A0, "Member 'UDagwoodNetworkPhysicsComponent::OutManagedState' has a wrong offset!");

// Class ValetRuntime.FortDagwoodVehicleConfigs
// 0x0410 (0x0980 - 0x0570)
class UFortDagwoodVehicleConfigs : public UFortSKMotorVehicleConfigs
{
public:
	struct FTireInfo                              BaseTireInfo;                                      // 0x0570(0x01A0)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	float                                         BoostMinPushForce;                                 // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostTopSpeedForceMultiplier;                      // 0x0714(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostTopSpeedMultiplier;                           // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostWaterMultiplier;                              // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVehicleDamage;                                  // 0x0720(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVehicleDamage;                                  // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVehicleDamageSpeedKmh;                          // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVehicleDamageSpeedKmh;                          // 0x072C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVehicleDamageWhileBoosting;                     // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVehicleDamageWhileBoosting;                     // 0x0734(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVehicleDamageSpeedWhileBoostingKmh;             // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVehicleDamageSpeedWhileBoostingKmh;             // 0x073C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehiclePowerSlideFrontMultiplier;                  // 0x0740(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehiclePowerSlideRearMultiplier;                   // 0x0744(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeGripAngle;                                // 0x0748(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeGripAngleRecovery;                        // 0x074C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeSpeedForGripLoss;                         // 0x0750(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSlipDuration;                                   // 0x0754(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeLateralFriction;                          // 0x0758(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeSteeringMultiplier;                       // 0x075C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeFrictionDampFactor;                       // 0x0760(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RestoreTractionDampFactor;                         // 0x0764(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeForce;                                    // 0x0768(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeForceNoAccel;                             // 0x076C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostSteeringMultiplier;                           // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadTopSpeedMultiplier;                        // 0x0774(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadFrontLateralFriction;                      // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadRearLateralFriction;                       // 0x077C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadAccelForceMultiplier;                      // 0x0780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadFakeBumpinessMultiplier;                   // 0x0784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffRoadTopSpeedMultiplier;                         // 0x0788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffRoadFrontLateralFriction;                       // 0x078C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffRoadRearLateralFriction;                        // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffRoadPushForceMultiplier;                        // 0x0794(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadDamageImpactForceMin;                       // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadDamageImpactForceMax;                       // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadImpactDamageMin;                            // 0x07A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadImpactDamageMax;                            // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeedForOffroadHandling;                        // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireHealthPercentThreshold;                        // 0x07AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBumpinessSpringHitTimeMultiplier;               // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBumpinessSpringHitTimeMultiplier;               // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BumpinessExponentForShocks;                        // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadRumbleIntensity;                            // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirtRoadRumbleIntensity;                           // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffroadDamageScaleExponent;                        // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HardLandingThresholdMin;                           // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HardLandingThresholdMax;                           // 0x07CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HardLandingShakeZAmplitudeMin;                     // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HardLandingShakeZAmplitudeMax;                     // 0x07D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedLinesThreshold;                               // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropDestructionImpulse;                            // 0x07DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestructionAngle;                                  // 0x07E0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpNormalMinProtected;                              // 0x07E4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpForwardMinProtected;                             // 0x07E8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NonCameraSteeringAngleMultiplier;                  // 0x07EC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraAssistStrengthMax;                           // 0x07F0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraAssistStrengthMin;                           // 0x07F4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraAssistStrengthRecovery;                      // 0x07F8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraAssistInterpSpeed;                           // 0x07FC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverseChangeDirectionBrakeForceMultiplier;        // 0x0800(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverseChangeDirectionSpeedThreshold;              // 0x0804(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriftExitPushForce;                                // 0x0808(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriftExitCatchupSpeed;                             // 0x080C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandbrakeDurationRequiredForCatchup;               // 0x0810(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactMagnitudeToEndCatchup;                       // 0x0814(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireSpringLength;                            // 0x0818(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireSpringStiff;                             // 0x081C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireSpringDamp;                              // 0x0820(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireTractionMultiplier_StageOne;             // 0x0824(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireTractionMultiplier_StageTwo;             // 0x0828(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireTractionMultiplier_Min;                  // 0x082C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireScrapeFrictionMultiplier;                // 0x0830(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeedForRimScrapeDamage;                        // 0x0834(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RimScrapeDamageRate;                               // 0x0838(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RimScrapeFlipRollMagnitude;                        // 0x083C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RimScrapeFlipPitchMagnitude;                       // 0x0840(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedForRimFlip;                                   // 0x0844(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthPercentForFlip;                              // 0x0848(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipYawDuration;                                   // 0x084C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipRollDuration;                                  // 0x0850(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPitchDuration;                                 // 0x0854(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipExplodeDuration_Yaw;                           // 0x0858(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipExplodeDuration_Pitch;                         // 0x085C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPushForceDuration_Yaw;                         // 0x0860(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPushForceDuration_Pitch;                       // 0x0864(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPushForcMultiplier;                            // 0x0868(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPushForce_UpComponentPitch;                    // 0x086C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipPushForce_UpComponentRoll;                     // 0x0870(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinTimeInAirRequiredForExplodeLanding;             // 0x0874(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipYawSpringStiff;                                // 0x0878(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipYawSpringDamp;                                 // 0x087C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipYawSpringMaxAccel;                             // 0x0880(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthPercentForExplode;                           // 0x0884(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipRecoveryTime;                                  // 0x0888(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipMaxDuration;                                   // 0x088C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipWiggleDuration;                                // 0x0890(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireVeerDuration;                            // 0x0894(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoppedTireVeerSteeringAngle;                       // 0x0898(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipWiggleFrequency;                               // 0x089C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipWiggleSteeringAngle;                           // 0x08A0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlipYawAngleThreshold;                             // 0x08A4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsesBoost;                                        // 0x08A8(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A9[0x3];                                      // 0x08A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RechargeableBoostRateOfUse;                        // 0x08AC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RechargeableBoostRateOfRegen;                      // 0x08B0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostRateOfRegenMinMultiplier;                     // 0x08B4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostRateOfRegenMaxMultiplier;                     // 0x08B8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostRegenMaxMultiplyTime;                         // 0x08BC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RechargeableBoostRequiredPercentToActivate;        // 0x08C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RechargeableBoostMaxPercent;                       // 0x08C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RechargeableBoostMinPercent;                       // 0x08C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageFriendlyFire;                               // 0x08CC(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageOtherVehicles;                              // 0x08CD(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDamageOwnVehicle;                                 // 0x08CE(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8CF[0x1];                                      // 0x08CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumWheelsOnSurfaceRequired;                        // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FuelLeakProjectileTimeInterval;                    // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FuelLeakHealthPercentThreshold;                    // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerExtraHealth;                                 // 0x08DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeZeroHealth;                                 // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeExplosion;                                  // 0x08E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeSelfDestructCleanup;                        // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelfDestructTime;                                  // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnalogDriftStickThreshold;                         // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TireBootRightSocketName;                           // 0x08F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TireBootLeftSocketName;                            // 0x08FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TireBootRelativeDistance;                          // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostForceInAir;                                   // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostAirMaxSpeed;                                  // 0x090C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           TireSocketNames;                                   // 0x0910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           TireBoneNames;                                     // 0x0920(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<int32>                                 RearTireIndices;                                   // 0x0930(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<int32>                                 RightSideTires;                                    // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<int32>                                 FakeTireIndices;                                   // 0x0950(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bNoWheels;                                         // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_961[0x3];                                      // 0x0961(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NoWheelsSpringLenMult;                             // 0x0964(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           NoWheelsBonesToHide;                               // 0x0968(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpawnWithModTag;                                   // 0x0978(0x0008)(Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDagwoodVehicleConfigs">();
	}
	static class UFortDagwoodVehicleConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDagwoodVehicleConfigs>();
	}
};
static_assert(alignof(UFortDagwoodVehicleConfigs) == 0x000008, "Wrong alignment on UFortDagwoodVehicleConfigs");
static_assert(sizeof(UFortDagwoodVehicleConfigs) == 0x000980, "Wrong size on UFortDagwoodVehicleConfigs");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BaseTireInfo) == 0x000570, "Member 'UFortDagwoodVehicleConfigs::BaseTireInfo' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostMinPushForce) == 0x000710, "Member 'UFortDagwoodVehicleConfigs::BoostMinPushForce' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostTopSpeedForceMultiplier) == 0x000714, "Member 'UFortDagwoodVehicleConfigs::BoostTopSpeedForceMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostTopSpeedMultiplier) == 0x000718, "Member 'UFortDagwoodVehicleConfigs::BoostTopSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostWaterMultiplier) == 0x00071C, "Member 'UFortDagwoodVehicleConfigs::BoostWaterMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinVehicleDamage) == 0x000720, "Member 'UFortDagwoodVehicleConfigs::MinVehicleDamage' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxVehicleDamage) == 0x000724, "Member 'UFortDagwoodVehicleConfigs::MaxVehicleDamage' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinVehicleDamageSpeedKmh) == 0x000728, "Member 'UFortDagwoodVehicleConfigs::MinVehicleDamageSpeedKmh' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxVehicleDamageSpeedKmh) == 0x00072C, "Member 'UFortDagwoodVehicleConfigs::MaxVehicleDamageSpeedKmh' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinVehicleDamageWhileBoosting) == 0x000730, "Member 'UFortDagwoodVehicleConfigs::MinVehicleDamageWhileBoosting' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxVehicleDamageWhileBoosting) == 0x000734, "Member 'UFortDagwoodVehicleConfigs::MaxVehicleDamageWhileBoosting' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinVehicleDamageSpeedWhileBoostingKmh) == 0x000738, "Member 'UFortDagwoodVehicleConfigs::MinVehicleDamageSpeedWhileBoostingKmh' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxVehicleDamageSpeedWhileBoostingKmh) == 0x00073C, "Member 'UFortDagwoodVehicleConfigs::MaxVehicleDamageSpeedWhileBoostingKmh' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, VehiclePowerSlideFrontMultiplier) == 0x000740, "Member 'UFortDagwoodVehicleConfigs::VehiclePowerSlideFrontMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, VehiclePowerSlideRearMultiplier) == 0x000744, "Member 'UFortDagwoodVehicleConfigs::VehiclePowerSlideRearMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeGripAngle) == 0x000748, "Member 'UFortDagwoodVehicleConfigs::HandbrakeGripAngle' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeGripAngleRecovery) == 0x00074C, "Member 'UFortDagwoodVehicleConfigs::HandbrakeGripAngleRecovery' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeSpeedForGripLoss) == 0x000750, "Member 'UFortDagwoodVehicleConfigs::HandbrakeSpeedForGripLoss' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinSlipDuration) == 0x000754, "Member 'UFortDagwoodVehicleConfigs::MinSlipDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeLateralFriction) == 0x000758, "Member 'UFortDagwoodVehicleConfigs::HandbrakeLateralFriction' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeSteeringMultiplier) == 0x00075C, "Member 'UFortDagwoodVehicleConfigs::HandbrakeSteeringMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeFrictionDampFactor) == 0x000760, "Member 'UFortDagwoodVehicleConfigs::HandbrakeFrictionDampFactor' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RestoreTractionDampFactor) == 0x000764, "Member 'UFortDagwoodVehicleConfigs::RestoreTractionDampFactor' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeForce) == 0x000768, "Member 'UFortDagwoodVehicleConfigs::HandbrakeForce' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeForceNoAccel) == 0x00076C, "Member 'UFortDagwoodVehicleConfigs::HandbrakeForceNoAccel' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostSteeringMultiplier) == 0x000770, "Member 'UFortDagwoodVehicleConfigs::BoostSteeringMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadTopSpeedMultiplier) == 0x000774, "Member 'UFortDagwoodVehicleConfigs::DirtRoadTopSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadFrontLateralFriction) == 0x000778, "Member 'UFortDagwoodVehicleConfigs::DirtRoadFrontLateralFriction' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadRearLateralFriction) == 0x00077C, "Member 'UFortDagwoodVehicleConfigs::DirtRoadRearLateralFriction' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadAccelForceMultiplier) == 0x000780, "Member 'UFortDagwoodVehicleConfigs::DirtRoadAccelForceMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadFakeBumpinessMultiplier) == 0x000784, "Member 'UFortDagwoodVehicleConfigs::DirtRoadFakeBumpinessMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffRoadTopSpeedMultiplier) == 0x000788, "Member 'UFortDagwoodVehicleConfigs::OffRoadTopSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffRoadFrontLateralFriction) == 0x00078C, "Member 'UFortDagwoodVehicleConfigs::OffRoadFrontLateralFriction' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffRoadRearLateralFriction) == 0x000790, "Member 'UFortDagwoodVehicleConfigs::OffRoadRearLateralFriction' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffRoadPushForceMultiplier) == 0x000794, "Member 'UFortDagwoodVehicleConfigs::OffRoadPushForceMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadDamageImpactForceMin) == 0x000798, "Member 'UFortDagwoodVehicleConfigs::OffroadDamageImpactForceMin' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadDamageImpactForceMax) == 0x00079C, "Member 'UFortDagwoodVehicleConfigs::OffroadDamageImpactForceMax' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadImpactDamageMin) == 0x0007A0, "Member 'UFortDagwoodVehicleConfigs::OffroadImpactDamageMin' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadImpactDamageMax) == 0x0007A4, "Member 'UFortDagwoodVehicleConfigs::OffroadImpactDamageMax' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinSpeedForOffroadHandling) == 0x0007A8, "Member 'UFortDagwoodVehicleConfigs::MinSpeedForOffroadHandling' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FireHealthPercentThreshold) == 0x0007AC, "Member 'UFortDagwoodVehicleConfigs::FireHealthPercentThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinBumpinessSpringHitTimeMultiplier) == 0x0007B0, "Member 'UFortDagwoodVehicleConfigs::MinBumpinessSpringHitTimeMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxBumpinessSpringHitTimeMultiplier) == 0x0007B4, "Member 'UFortDagwoodVehicleConfigs::MaxBumpinessSpringHitTimeMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BumpinessExponentForShocks) == 0x0007B8, "Member 'UFortDagwoodVehicleConfigs::BumpinessExponentForShocks' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadRumbleIntensity) == 0x0007BC, "Member 'UFortDagwoodVehicleConfigs::OffroadRumbleIntensity' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DirtRoadRumbleIntensity) == 0x0007C0, "Member 'UFortDagwoodVehicleConfigs::DirtRoadRumbleIntensity' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, OffroadDamageScaleExponent) == 0x0007C4, "Member 'UFortDagwoodVehicleConfigs::OffroadDamageScaleExponent' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HardLandingThresholdMin) == 0x0007C8, "Member 'UFortDagwoodVehicleConfigs::HardLandingThresholdMin' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HardLandingThresholdMax) == 0x0007CC, "Member 'UFortDagwoodVehicleConfigs::HardLandingThresholdMax' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HardLandingShakeZAmplitudeMin) == 0x0007D0, "Member 'UFortDagwoodVehicleConfigs::HardLandingShakeZAmplitudeMin' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HardLandingShakeZAmplitudeMax) == 0x0007D4, "Member 'UFortDagwoodVehicleConfigs::HardLandingShakeZAmplitudeMax' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, SpeedLinesThreshold) == 0x0007D8, "Member 'UFortDagwoodVehicleConfigs::SpeedLinesThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PropDestructionImpulse) == 0x0007DC, "Member 'UFortDagwoodVehicleConfigs::PropDestructionImpulse' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DestructionAngle) == 0x0007E0, "Member 'UFortDagwoodVehicleConfigs::DestructionAngle' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, UpNormalMinProtected) == 0x0007E4, "Member 'UFortDagwoodVehicleConfigs::UpNormalMinProtected' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, UpForwardMinProtected) == 0x0007E8, "Member 'UFortDagwoodVehicleConfigs::UpForwardMinProtected' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, NonCameraSteeringAngleMultiplier) == 0x0007EC, "Member 'UFortDagwoodVehicleConfigs::NonCameraSteeringAngleMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, CameraAssistStrengthMax) == 0x0007F0, "Member 'UFortDagwoodVehicleConfigs::CameraAssistStrengthMax' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, CameraAssistStrengthMin) == 0x0007F4, "Member 'UFortDagwoodVehicleConfigs::CameraAssistStrengthMin' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, CameraAssistStrengthRecovery) == 0x0007F8, "Member 'UFortDagwoodVehicleConfigs::CameraAssistStrengthRecovery' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, CameraAssistInterpSpeed) == 0x0007FC, "Member 'UFortDagwoodVehicleConfigs::CameraAssistInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, ReverseChangeDirectionBrakeForceMultiplier) == 0x000800, "Member 'UFortDagwoodVehicleConfigs::ReverseChangeDirectionBrakeForceMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, ReverseChangeDirectionSpeedThreshold) == 0x000804, "Member 'UFortDagwoodVehicleConfigs::ReverseChangeDirectionSpeedThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DriftExitPushForce) == 0x000808, "Member 'UFortDagwoodVehicleConfigs::DriftExitPushForce' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, DriftExitCatchupSpeed) == 0x00080C, "Member 'UFortDagwoodVehicleConfigs::DriftExitCatchupSpeed' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HandbrakeDurationRequiredForCatchup) == 0x000810, "Member 'UFortDagwoodVehicleConfigs::HandbrakeDurationRequiredForCatchup' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, ImpactMagnitudeToEndCatchup) == 0x000814, "Member 'UFortDagwoodVehicleConfigs::ImpactMagnitudeToEndCatchup' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireSpringLength) == 0x000818, "Member 'UFortDagwoodVehicleConfigs::PoppedTireSpringLength' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireSpringStiff) == 0x00081C, "Member 'UFortDagwoodVehicleConfigs::PoppedTireSpringStiff' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireSpringDamp) == 0x000820, "Member 'UFortDagwoodVehicleConfigs::PoppedTireSpringDamp' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireTractionMultiplier_StageOne) == 0x000824, "Member 'UFortDagwoodVehicleConfigs::PoppedTireTractionMultiplier_StageOne' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireTractionMultiplier_StageTwo) == 0x000828, "Member 'UFortDagwoodVehicleConfigs::PoppedTireTractionMultiplier_StageTwo' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireTractionMultiplier_Min) == 0x00082C, "Member 'UFortDagwoodVehicleConfigs::PoppedTireTractionMultiplier_Min' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireScrapeFrictionMultiplier) == 0x000830, "Member 'UFortDagwoodVehicleConfigs::PoppedTireScrapeFrictionMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinSpeedForRimScrapeDamage) == 0x000834, "Member 'UFortDagwoodVehicleConfigs::MinSpeedForRimScrapeDamage' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RimScrapeDamageRate) == 0x000838, "Member 'UFortDagwoodVehicleConfigs::RimScrapeDamageRate' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RimScrapeFlipRollMagnitude) == 0x00083C, "Member 'UFortDagwoodVehicleConfigs::RimScrapeFlipRollMagnitude' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RimScrapeFlipPitchMagnitude) == 0x000840, "Member 'UFortDagwoodVehicleConfigs::RimScrapeFlipPitchMagnitude' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, SpeedForRimFlip) == 0x000844, "Member 'UFortDagwoodVehicleConfigs::SpeedForRimFlip' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HealthPercentForFlip) == 0x000848, "Member 'UFortDagwoodVehicleConfigs::HealthPercentForFlip' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipYawDuration) == 0x00084C, "Member 'UFortDagwoodVehicleConfigs::FlipYawDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipRollDuration) == 0x000850, "Member 'UFortDagwoodVehicleConfigs::FlipRollDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPitchDuration) == 0x000854, "Member 'UFortDagwoodVehicleConfigs::FlipPitchDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipExplodeDuration_Yaw) == 0x000858, "Member 'UFortDagwoodVehicleConfigs::FlipExplodeDuration_Yaw' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipExplodeDuration_Pitch) == 0x00085C, "Member 'UFortDagwoodVehicleConfigs::FlipExplodeDuration_Pitch' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPushForceDuration_Yaw) == 0x000860, "Member 'UFortDagwoodVehicleConfigs::FlipPushForceDuration_Yaw' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPushForceDuration_Pitch) == 0x000864, "Member 'UFortDagwoodVehicleConfigs::FlipPushForceDuration_Pitch' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPushForcMultiplier) == 0x000868, "Member 'UFortDagwoodVehicleConfigs::FlipPushForcMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPushForce_UpComponentPitch) == 0x00086C, "Member 'UFortDagwoodVehicleConfigs::FlipPushForce_UpComponentPitch' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipPushForce_UpComponentRoll) == 0x000870, "Member 'UFortDagwoodVehicleConfigs::FlipPushForce_UpComponentRoll' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MinTimeInAirRequiredForExplodeLanding) == 0x000874, "Member 'UFortDagwoodVehicleConfigs::MinTimeInAirRequiredForExplodeLanding' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipYawSpringStiff) == 0x000878, "Member 'UFortDagwoodVehicleConfigs::FlipYawSpringStiff' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipYawSpringDamp) == 0x00087C, "Member 'UFortDagwoodVehicleConfigs::FlipYawSpringDamp' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipYawSpringMaxAccel) == 0x000880, "Member 'UFortDagwoodVehicleConfigs::FlipYawSpringMaxAccel' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, HealthPercentForExplode) == 0x000884, "Member 'UFortDagwoodVehicleConfigs::HealthPercentForExplode' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipRecoveryTime) == 0x000888, "Member 'UFortDagwoodVehicleConfigs::FlipRecoveryTime' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipMaxDuration) == 0x00088C, "Member 'UFortDagwoodVehicleConfigs::FlipMaxDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipWiggleDuration) == 0x000890, "Member 'UFortDagwoodVehicleConfigs::FlipWiggleDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireVeerDuration) == 0x000894, "Member 'UFortDagwoodVehicleConfigs::PoppedTireVeerDuration' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, PoppedTireVeerSteeringAngle) == 0x000898, "Member 'UFortDagwoodVehicleConfigs::PoppedTireVeerSteeringAngle' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipWiggleFrequency) == 0x00089C, "Member 'UFortDagwoodVehicleConfigs::FlipWiggleFrequency' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipWiggleSteeringAngle) == 0x0008A0, "Member 'UFortDagwoodVehicleConfigs::FlipWiggleSteeringAngle' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FlipYawAngleThreshold) == 0x0008A4, "Member 'UFortDagwoodVehicleConfigs::FlipYawAngleThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, bUsesBoost) == 0x0008A8, "Member 'UFortDagwoodVehicleConfigs::bUsesBoost' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RechargeableBoostRateOfUse) == 0x0008AC, "Member 'UFortDagwoodVehicleConfigs::RechargeableBoostRateOfUse' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RechargeableBoostRateOfRegen) == 0x0008B0, "Member 'UFortDagwoodVehicleConfigs::RechargeableBoostRateOfRegen' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostRateOfRegenMinMultiplier) == 0x0008B4, "Member 'UFortDagwoodVehicleConfigs::BoostRateOfRegenMinMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostRateOfRegenMaxMultiplier) == 0x0008B8, "Member 'UFortDagwoodVehicleConfigs::BoostRateOfRegenMaxMultiplier' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, BoostRegenMaxMultiplyTime) == 0x0008BC, "Member 'UFortDagwoodVehicleConfigs::BoostRegenMaxMultiplyTime' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RechargeableBoostRequiredPercentToActivate) == 0x0008C0, "Member 'UFortDagwoodVehicleConfigs::RechargeableBoostRequiredPercentToActivate' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RechargeableBoostMaxPercent) == 0x0008C4, "Member 'UFortDagwoodVehicleConfigs::RechargeableBoostMaxPercent' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, RechargeableBoostMinPercent) == 0x0008C8, "Member 'UFortDagwoodVehicleConfigs::RechargeableBoostMinPercent' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, bDamageFriendlyFire) == 0x0008CC, "Member 'UFortDagwoodVehicleConfigs::bDamageFriendlyFire' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, bDamageOtherVehicles) == 0x0008CD, "Member 'UFortDagwoodVehicleConfigs::bDamageOtherVehicles' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, bDamageOwnVehicle) == 0x0008CE, "Member 'UFortDagwoodVehicleConfigs::bDamageOwnVehicle' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, NumWheelsOnSurfaceRequired) == 0x0008D0, "Member 'UFortDagwoodVehicleConfigs::NumWheelsOnSurfaceRequired' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FuelLeakProjectileTimeInterval) == 0x0008D4, "Member 'UFortDagwoodVehicleConfigs::FuelLeakProjectileTimeInterval' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, FuelLeakHealthPercentThreshold) == 0x0008D8, "Member 'UFortDagwoodVehicleConfigs::FuelLeakHealthPercentThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, ServerExtraHealth) == 0x0008DC, "Member 'UFortDagwoodVehicleConfigs::ServerExtraHealth' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxTimeZeroHealth) == 0x0008E0, "Member 'UFortDagwoodVehicleConfigs::MaxTimeZeroHealth' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxTimeExplosion) == 0x0008E4, "Member 'UFortDagwoodVehicleConfigs::MaxTimeExplosion' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, MaxTimeSelfDestructCleanup) == 0x0008E8, "Member 'UFortDagwoodVehicleConfigs::MaxTimeSelfDestructCleanup' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, SelfDestructTime) == 0x0008EC, "Member 'UFortDagwoodVehicleConfigs::SelfDestructTime' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, AnalogDriftStickThreshold) == 0x0008F0, "Member 'UFortDagwoodVehicleConfigs::AnalogDriftStickThreshold' has a wrong offset!");
static_assert(offsetof(UFortDagwoodVehicleConfigs, TireBootRightSocketName) == 0x0008F4, "Member 'UFortDagwoodVehicleConfigs::TireBootRightSocketName' has a wrong offset!");
