#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelHeaderButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelHeaderButton.VoiceChannelHeaderButton_C
// 0x0080 (0x0CE0 - 0x0C60)
class UVoiceChannelHeaderButton_C final : public UFortVoiceChannelHeaderButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinSlideOut;                                      // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Join;                                         // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   JoinText;                                          // 0x0C90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotTransmitting;                                   // 0x0C98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OffText;                                           // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OnOffSwitcher;                                     // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OnText;                                            // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionBackplate;                                // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SimultaneousChannelSwitcher;                       // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Transmitting;                               // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Transmitting;                                      // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoiceChannelHeaderButton(int32 EntryPoint);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void OnListItemObjectSet_1(class UObject* ListItemObject);
	void BP_OnEnabled();
	void BP_OnDisabled();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelHeaderButton_C">();
	}
	static class UVoiceChannelHeaderButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelHeaderButton_C>();
	}
};
static_assert(alignof(UVoiceChannelHeaderButton_C) == 0x000008, "Wrong alignment on UVoiceChannelHeaderButton_C");
static_assert(sizeof(UVoiceChannelHeaderButton_C) == 0x000CE0, "Wrong size on UVoiceChannelHeaderButton_C");
static_assert(offsetof(UVoiceChannelHeaderButton_C, UberGraphFrame) == 0x000C60, "Member 'UVoiceChannelHeaderButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnExpansion) == 0x000C68, "Member 'UVoiceChannelHeaderButton_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinSlideOut) == 0x000C70, "Member 'UVoiceChannelHeaderButton_C::JoinSlideOut' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ScaleUp) == 0x000C78, "Member 'UVoiceChannelHeaderButton_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ExpandDirectionTick) == 0x000C80, "Member 'UVoiceChannelHeaderButton_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, HBox_Join) == 0x000C88, "Member 'UVoiceChannelHeaderButton_C::HBox_Join' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinText) == 0x000C90, "Member 'UVoiceChannelHeaderButton_C::JoinText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, NotTransmitting) == 0x000C98, "Member 'UVoiceChannelHeaderButton_C::NotTransmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OffText) == 0x000CA0, "Member 'UVoiceChannelHeaderButton_C::OffText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnOffSwitcher) == 0x000CA8, "Member 'UVoiceChannelHeaderButton_C::OnOffSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnText) == 0x000CB0, "Member 'UVoiceChannelHeaderButton_C::OnText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Overlay_1) == 0x000CB8, "Member 'UVoiceChannelHeaderButton_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SelectionBackplate) == 0x000CC0, "Member 'UVoiceChannelHeaderButton_C::SelectionBackplate' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SimultaneousChannelSwitcher) == 0x000CC8, "Member 'UVoiceChannelHeaderButton_C::SimultaneousChannelSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Switch_Transmitting) == 0x000CD0, "Member 'UVoiceChannelHeaderButton_C::Switch_Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Transmitting) == 0x000CD8, "Member 'UVoiceChannelHeaderButton_C::Transmitting' has a wrong offset!");

}

