#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebLogin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WebLogin.WebLogin_C
// 0x0018 (0x04A0 - 0x0488)
class UWebLogin_C final : public UFortWebLoginWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      Throbber;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                WebContent;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DismissWidget();
	void DisplayWidget(class UWidget* WebWidget);
	void ExecuteUbergraph_WebLogin(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WebLogin_C">();
	}
	static class UWebLogin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebLogin_C>();
	}
};
static_assert(alignof(UWebLogin_C) == 0x000008, "Wrong alignment on UWebLogin_C");
static_assert(sizeof(UWebLogin_C) == 0x0004A0, "Wrong size on UWebLogin_C");
static_assert(offsetof(UWebLogin_C, UberGraphFrame) == 0x000488, "Member 'UWebLogin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, Throbber) == 0x000490, "Member 'UWebLogin_C::Throbber' has a wrong offset!");
static_assert(offsetof(UWebLogin_C, WebContent) == 0x000498, "Member 'UWebLogin_C::WebContent' has a wrong offset!");

}

